{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-28T00:00:00+00:00", "News_Date_Formatted": "2026-01-28 00:00:00 (GMT+0)", "Week_Num": 1, "News_Title": "BYD (SEHK:1211) Valuation Check As P/E Premium Contrasts With Cash Flow Upside Signals", "News_Source": "SIMPLYWALL", "News_Content": "Hong Kong\n/Auto\n/SEHK:1211\nBYD (SEHK:1211) Valuation Check As P/E Premium Contrasts With Cash Flow Upside Signals\nSimply Wall St\nJanuary 28, 2026\nRecent share performance and business scale\nWithout a clear single news catalyst, you might be looking at BYD (SEHK:1211) simply because its recent share performance and business size stand out among Hong Kong listed auto and battery groups.\nOver the past month, BYD shares have returned about 5.9%, while the past 3 months show a modest 1.3% decline. On a 1 year view, the total return figure provided is 14.2%.\nThe company reports revenue of CN¥841.1b and net income of CN¥38.3b. This reflects a large-scale operation across automobiles, batteries and related services. Annual revenue growth is given as 10.8%, with net income growth at 16.3%.\nAt the last close of HK$102.80, some valuation metrics in the data suggest a potential gap between market price and certain fair value estimates. However, these approaches depend heavily on the assumptions behind each model.\nSee our latest analysis for BYD.\nRecent trading points to rebuilding momentum, with a 1 day share price return of 4.6% and a 7 day share price return of 3.8%, set against a 1 year total shareholder return of 14.2% that reflects steadier long term gains.\nIf BYD has you thinking more broadly about the auto space, it could be a good time to see what else is on the move among auto manufacturers.\nSo with BYD trading at HK$102.80 alongside fair value and price target estimates that sit higher, is the current share price a genuine gap you can exploit, or is the market already factoring in future growth?\nPrice to earnings of 21.7x: Is it justified?\nOn the latest numbers, BYD trades on a P/E of 21.7x, while our fair value work points to a lower P/E of 13.8x and the shares sit below some cash flow based estimates such as the SWS DCF model fair value of HK$136 versus the last close at HK$102.80.\nThe P/E ratio compares the current share price with earnings per share and is a common way for investors to judge how much they are paying for each unit of profit. For a large auto and battery group like BYD, a higher P/E can reflect expectations for further earnings progress as well as the breadth of its businesses across vehicles, batteries and related services.\nHere, the 21.7x P/E sits above both the Asian auto industry average of 18.2x and a peer average of 8.3x. This suggests the market is assigning BYD a richer earnings tag than many regional and peer names. Compared with the estimated fair P/E of 13.8x, the gap is also wide. This highlights a level that the market could move towards if sentiment or earnings expectations change.\nExplore the SWS fair ratio for BYD\nResult: Price to earnings of 21.7x (OVERVALUED)\nHowever, you still need to watch for earnings expectations resetting if sentiment toward higher P/E auto names cools or if analyst price targets are revised lower.\nFind out about the key risks to this BYD narrative.\nAnother view: Cash flow says something different\nIf you put the earnings multiple to one side and look at our SWS DCF model, you get a different message. On this view, BYD at HK$102.80 sits about 24.4% below an estimated fair value of HK$136, which points to potential upside rather than stretch.\nThat gap matters because it shows how sensitive conclusions can be to the tool you use, and to the assumptions built into it. If profits or cash flows play out differently, could this apparent cushion shrink or widen from here?\nLook into how the SWS DCF model arrives at its fair value.\n1211 Discounted Cash Flow as at Jan 2026\nSimply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (check out BYD for example). We show the entire calculation in full. You can track the result in your watchlist or portfolio and be alerted when this changes, or use our stock screener to discover 876 undervalued stocks based on their cash flows. If you save a screener we even alert you when new companies match - so you never miss a potential opportunity.\nBuild Your Own BYD Narrative\nIf this view does not quite match your own read of the numbers, you can test the assumptions yourself and shape a personalised thesis in just a few minutes with Do it your way.\nA great starting point for your BYD research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\nLooking for more investment ideas?\nIf you stop with just one stock, you risk missing other opportunities that better suit your goals, so put a few minutes aside and scan fresh ideas now.\nSpot potential bargains early by checking out these 876 undervalued stocks based on cash flows that stand out on cash flow metrics and pricing.\nRide powerful tech trends by reviewing these 24 AI penny stocks that are tied to artificial intelligence themes.\nExplore income-focused ideas by scanning these 13 dividend stocks with yields > 3% that offer yields above 3%.\nThis article by Simply Wall St is general in ", "Content_Length": 6908, "Word_Count": 1154, "Image_URLs": ["https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/dcf", "https://images.ctfassets.net/n07nr2koi959/220TWz80MMu5IKd31MX2Mh/5baf073475c70362f71c7471b9e72a3c/portrait.jpg?fit=thumb&w=64&h=64", "https://images.ctfassets.net/n07nr2koi959/51SSiWSLQ6bnbhvLt2LrUO/204581c61a830f0e0500f0816d54ddf6/IMG_8661.jpg?fit=thumb&w=64&h=64", "https://media.simplywall.st/news/1721008721705-Timo-profile-picutre.jpg", "https://media.simplywall.st/news/1732588370521-bullish.png"], "News_URL": "https://simplywall.st/stocks/hk/automobiles/hkg-1211/byd-shares/news/byd-sehk1211-valuation-check-as-pe-premium-contrasts-with-ca/amp", "Scrape_Time_Sec": 1.7277898788452148}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-29T21:39:04.007000+00:00", "News_Date_Formatted": "2026-01-29 21:39:04 (GMT+0)", "Week_Num": 1, "News_Title": "BYD (1211 HK) Tactical Outlook: Taking Off?", "News_Source": "SMARTKARMA", "News_Content": "Dashboard\nDiscussions\nWatchlists\nCollections\nTools\nMore\n𝛼SK\nor Search\nSIGN UP\nSIGN IN\nBullish\nBYD\nWatchlist\nBYD (1211 HK) Tactical Outlook: Taking Off?\nEquity Derivatives\n197 Views30 Jan 2026 05:39\nAs indicated in previous insight at the end of December, BYD (1211 HK) seems to be bottoming and restarting its rally. Our short-term target is 106.4. The rally could continue after a small pullback.\nWHAT IS COVERED IN THE FULL INSIGHT:\nIntroduction\nMarket Reversal Matrix Overview\nQuantChart Analysis\nWeekly Support and Resistance Levels\nProfit Targets and Reversal Probability\nNico Rosti\nFollow\nMessage\nSUMMARY(Sign Up to Access)\nTry Now\nBegin exploring Smartkarma's AI-augmented investing intelligence platform with a complimentary Preview Pass to:\nUnlock research summaries\nFollow top, independent analysts\nReceive personalised alerts\nAccess Analytics, Events and more\nJoin 55,000+ investors, including top global asset managers overseeing $13+ trillion.\nUpgrade later to our paid plans for full-access.\nSMARTKARMA PREVIEW PASS\nSign Up with LinkedIn\nor\nFirst Name\nLast name\nEmail\nSign Up with Email\nBy signing up, you agree to our\nTerms of Use and Privacy Policy.\nAlready have an account? Sign In Now\nFULL INSIGHT\n(Paid Plans Only, 2-minute read)\nRELATED INSIGHTS\nMore »\nBYD (1211 HK) Tactical Outlook: Taking Off?\nQuiddity Leaderboard HSTECH Mar26: Final Ranks; US$840mn One-Way\nHSTECH Index Rebalance Preview: Changes If Index Universe Is Expanded\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\nTRENDING COLLECTIONS\nMore »\nEquity Bottom-Up\nEvent-Driven\nUnpaywalled Insights\nIndex Rebalance\nSingapore Value-Up\nSmartkarma Company Primers\nJapan\nSouth Korea\nGold\nPhilippines\nTRENDING INSIGHTS\nMore »\nPrimer: Modern Times Group MTG (MTGB SS) - Feb 2026\nOverview #48 — Gradually, Then Suddenly\nMakino Milling Machine (6135 JP): Twin Headwinds as Chinese and US Approvals Secured\nSBS Transit (SBUS SP | BUY | TP:S$3.92): Bussing for Dividends\nWeekly Deals Digest (01 Feb) - Toyota Ind, Mandom, Eastroc, Montage, Muyuan, Shin Etsu, Kandenko\nTOP UNPAYWALLED INSIGHTS\nMore »\nCurator's Cut: Going Private, Getting Active & Reviewing Public Market Premieres\nOverview #48 — Gradually, Then Suddenly\nSlight Gain in Governance, ROE and Valuations in 2025 Suggest that Reforms Have yet to Spread Widely\nBangladesh: VEON’s Next Billion-Dollar Fintech Opportunity\nOverview #47 – Are We There Yet?\nDISCUSSIONS\n(Paid Plans Only)\nPrice Chart(Sign Up to Access)\nSmartkarma SmartScore\n3.6/5\nRelative to stocks in the same:\nCountry & Sector\nValue\n3\nDividend\n4\nGrowth\n5\nResilience\n3\nMomentum\n3\n1\n2\n3\n4\n5\nSentiment\nView SmartScore Screener »\nInsight Stream\nBYD (1211 HK) Tactical Outlook: Taking Off?\n30 Jan 2026\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\n30 Dec 2025\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\n16 Dec 2025\nRelated Entities\nBYD (1211 HK)\nExpand All\nCollapse All\nTop\nSOLUTIONS\nFor Institutional Investors and Financial Services\nFor Corporate IR and Strategy\nFor Private Wealth Intermediaries\nPricing\nHow Smartkarma Compares\nABOUT\nWho We Are\nCareers\nFAQs\nResearch Provider Solutions\nSyndicate your Publications\nLEGAL\nCompliance\nTerms of Use\nPrivacy Policy\nPress Kit\nRSS Feeds\nCONTACT\nRequest a Free Trial\nAvail a Transition Account\nGuest Posts on Smartkarma\nOther Enquiries\nJoin TL;DR Community\nFree Weekly Newsletters\nDOWNLOAD\nCopyright © 2022 Smartkarma Innovations Pte Ltd. All Rights Reserved. v3.63.2", "Content_Length": 3536, "Word_Count": 547, "Image_URLs": ["https://www.smartkarma.com/_next/image?url=https%3A%2F%2Fstatic-prod.smartkarma.com%2Faccounts%2Fprofile_photos%2F000%2F049%2F555%2Fsmall%2Fdata%3F1685106429&w=96&q=75"], "News_URL": "https://www.smartkarma.com/insights/byd-1211-hk-tactical-outlook-taking-off?utm_medium=feed&utm_source=RSS", "Scrape_Time_Sec": 2.9893453121185303}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-01-24T15:22:57+00:00", "News_Date_Formatted": "2026-01-24 15:22:57 (GMT+0)", "Week_Num": 2, "News_Title": "TENCENT STOCK SLIPS INTO WEEKEND AS 0700.HK LAGS TECH GAUGE — WHAT TO WATCH BEFORE MONDAY", "News_Source": "TS2", "News_Content": "24 JANUARY 2026\nHKG:0700.HK·INVESTING·MARKET ANALYSIS·STOCK MARKET·TECHNOLOGY\n1 MIN READ\nTENCENT STOCK SLIPS INTO WEEKEND AS 0700.HK LAGS TECH GAUGE — WHAT TO WATCH BEFORE MONDAY\nBY KHADIJA SAEED\nHONG KONG, Jan 24, 2026, 23:10 HKT — Market closed.\nTencent slipped 0.4% to close at HK$595 on Friday, lagging behind the Hang Seng Tech index’s rise.\nAttention shifts to the Fed’s decision next week and crucial activity data out of China.\nTencent is gearing up for its annual results briefing, set for mid-March.\nTencent Holdings Ltd shares dipped on Friday, pushing the Hong Kong-listed tech giant into the new week under pressure, even as the broader sector showed strength. (Yahoo Finance)\nThat’s crucial since global tech sentiment has been carrying much of the market’s weight lately. The coming days will put that to the test, with U.S. rate signals on deck and a crowded calendar of major tech earnings that could ripple into Asia. (Reuters)\nHong Kong markets remain closed Saturday. They reopen Monday.\nTencent ended Friday at HK$595, fluctuating between HK$595 and HK$602 during the session, with roughly 19.2 million shares traded, according to data. (Yahoo Finance)\nThe Hang Seng TECH Index climbed 0.6% today, keeping Chinese internet stocks under the spotlight as investors selectively bought in. (Investing)\nRate expectations linger quietly. The Federal Reserve’s upcoming policy meeting is set for Jan. 27-28, with investors watching closely for any shifts in tone from Chair Jerome Powell. (Federal Reserve)\nTencent, famous for WeChat and its vast gaming and advertising operations, is betting on artificial intelligence to fuel growth, boosting investments in computing power along the way.\nTencent president Martin Lau flagged chip shortages as a key bottleneck during a November earnings call, saying AI chip scarcity is capping cloud growth. He added that if supply weren’t an issue, “our cloud revenue should be growing more.” (Reuters)\nChina’s official manufacturing PMI is set for release on Jan. 31. Investors watch this figure closely as a snapshot of factory output and the broader domestic economy. (FXStreet)\nThe risk scenario is clear: weak China data, a fresh jump in global yields, or stricter restrictions on advanced chips could reignite selling in China tech stocks, which are already pricey. A stumble in ad spending or delays in game releases would only deepen the pressure.\nTencent is set to release its 2025 fourth-quarter and full-year results on March 18, as listed in its investor calendar. (Tencent)\nTraders are zeroing in on the Fed’s Jan. 28 decision and Powell’s press conference — an event that could shift risk appetite far beyond just Wall Street.\nKHADIJA SAEED\nLATEST POSTS\nA dedicated markets reporter, she covers stocks, macroeconomics, and major business developments with a sharp eye for detail and accuracy.\nSTOCK MARKET TODAY\nSimplex Holdings (TSE:4373) Seen Trading Below Fair Value Despite Premium P/E\nFebruary 1, 2026, 9:59 AM EST. Simplex Holdings (TSE:4373) reported strong revenue and profit growth for the nine months ending December 31, 2025. The company implemented a four-for-one stock split and launched a significant share buyback program. Its price-to-earnings (P/E) ratio stands at 20.7x, above the peer average but below its own fair P/E of 24.6x, implying some upside potential. Earnings growth has outpaced the industry with a 56.6% increase over the past year and raised guidance for the future. However, recent short-term stock price gains have slowed, with 30- and 90-day returns of 8.75% and 10.79%, respectively. The market appears to price in robust growth, but questions remain about risks to revenue and net income growth. Investors should watch how Simplex compares with tech and AI peers in Japan's IT sector.\nLATEST ARTICLES\nMicrosoft stock price in focus after AI spending jolt: what to watch before Monday’s open\n1 FEBRUARY 2026\nGOOG stock price: What to watch before Alphabet’s Feb. 4 earnings after Wall Street’s Friday slide\n1 FEBRUARY 2026\nPREVIOUS STORY\nBroadcom stock dips to $320 as Intel shock hits chips; Fed week and VMware dispute loom\nNEXT STORY\nBerkshire Hathaway stock price dips into weekend: BRK.B traders brace for Fed week and BNSF storm", "Content_Length": 4237, "Word_Count": 672, "Image_URLs": [], "News_URL": "https://ts2.tech/en/tencent-stock-slips-into-weekend-as-0700-hk-lags-tech-gauge-what-to-watch-before-monday/", "Scrape_Time_Sec": 4.135807991027832}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-02-01T23:07:46.130440+00:00", "News_Date_Formatted": "2026-02-01 23:07:46 (GMT+0)", "Week_Num": 1, "News_Title": "Alibaba Group Holding Limited (9988.HK) Latest Stock News & Headlines - Yahoo Finance", "News_Source": "YAHOO", "News_Content": "Summary\nNews\nChart\nConversations\nStatistics\nHistorical Data\nProfile\nFinancials\nAnalysis\nOptions\nHolders\nHKSE - Delayed Quote\n•\nHKD\nAlibaba Group Holding Limited (9988.HK)\nFollow\nGet top stock picks\n169.200\n-4.100\n(-2.37%)\nAt close: January 30 at 4:08:02 PM GMT+8\nAll\nNews\nEarnings Calls\nPress Releases\nSEC Filings\nAlibaba’s Expanding AI Ecosystem And What It May Mean For BABA Investors\nSimply Wall St.\n•\n23h ago\nBABA\n-2.70%\nBABAF\n+1.92%\nAlready Up Over 50% - These 2 AI Chip Stocks Are Just Getting Started\nZacks\n•\n1d ago\nTSM\n-2.45%\nTSMWF\n0.00%\nBABA\n-2.70%\nDiscover Two 'Strong Buy' Stocks Each Month\nSeeking Alpha . Ad\nUndo\nAlibaba Backed Moonshot AI Upgrades Its Flagship Model, Claims to Outdo US Rival AI Models\nInsider Monkey\n•\n1d ago\nBABA\nBABAF\nNVDA\nChina Clears DeepSeek to Buy Nvidia H200\nGuruFocus.com\n•\n1d ago\nNVDA\nBABA\nTCEHY\nIs It Worth Investing in Alibaba (BABA) Based on Wall Street's Bullish Views?\nZacks\n•\n2d ago\nBABA\nBABAF\nIn China, the most cutting-edge AI is stepping into everyday life\nPR Newswire\n•\n2d ago\nBABA\nChina conditionally approves DeepSeek to buy Nvidia's H200 chips - sources\nReuters Videos\n•\n2d ago\nNVDA\nBABA\nTCEHY\nChina clears DeepSeek to buy Nvidia H200 chips\nGuruFocus.com\n•\n2d ago\nNVDA\nBABA\nTCEHY\n2025年黃金大漲！聰明人早就進場了\nIC Markets . Ad\nUndo\nAlibaba’s Robovan Spinoff Adds Automation Angle To Long Term BABA Story\nSimply Wall St.\n•\n2d ago\nBABA\nBABAF\nExclusive-China conditionally approves DeepSeek to buy Nvidia's H200 chips - sources\nReuters\n•\n2d ago\nNVDA\nBABA\nTCEHY\nChina conditionally approves DeepSeek to buy Nvidia's H200 chips, sources say\nReuters\n•\n2d ago\nNVDA\nBABA\nTCEHY\nNVIDIA at 41x Forward Earnings: Buy, Hold, or Cash Out?\nZacks\n•\n2d ago\nNVDA\nBABA\nBABAF\nDow Jones AI Giant Nvidia Set To Hit New Buy Point After This Bullish Move\nInvestor's Business Daily\n•\n2d ago\nNVDA\n^DJI\nAMD\nAlibaba to merge driverless unit with China's Zelos in $2B deal\nGuruFocus.com\n•\n2d ago\nBABA\nBABAF\nBuy the Dip: These Big Dividends Have Gotten Way Too Cheap\nSeeking Alpha . Ad\nUndo\nAlibaba Reshapes Logistics With $2 Billion Robovan Deal\nGuruFocus.com\n•\n2d ago\nBABA\nBABAF\nBABA's Margins Suffer From Stiff Competition: Time to Sell the Stock?\nZacks\n•\n2d ago\nBABA\nBABAF\nByteDance and Alibaba to release new AI models for Lunar New Year - Information\nInvesting.com\n•\n2d ago\nBABA\nBABAF\nAlibaba's logistics arm to buy stake in Chinese robovan developer Zelostech\nReuters\n•\n3d ago\nBABA\nChina’s H200 Approval Adds New Layer To Nvidia Valuation Debate\nSimply Wall St.\n•\n3d ago\nNVDA\nBABA\nTCEHY\nAlibaba Teams Up With Zelos on $2 Billion Robovan Business\nThe Wall Street Journal\n•\n3d ago\nBABA\nBABAF\n《天堂：經典版》事前預約火熱進行中\n天堂：經典版 . Ad\nUndo\nPerformance Overview\nReturn 9988.HK HANG SENG INDEX (^HSI)\nYTD +18.65% +6.85%\n1-Year +91.91% +35.41%\n3-Year +56.25% +24.09%\nCopyright © 2026 Yahoo. All rights reserved.\nWhat's trending\nDow Jones\nS&P 500\nDAX Index\nNvidia\nTesla\nDJT\nTariffs\nExplore more\nMortgages\nCredit Cards\nSectors\nCrypto Heatmap\nFinancial News\nAbout\nData Disclaimer\nHelp\nFeedback\nSitemap\nLicensing\nWhat's New\nAbout Our Ads\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard\nU.S. markets closed\nUS\nEurope\nAsia\nCryptocurrencies\nRates\nCommodities\nCurrencies\nS&P 500\n6,939.03\n-29.98\n(-0.43%)\nDow 30\n48,892.47\n-179.09\n(-0.36%)\nNasdaq\n23,461.82\n-223.30\n(-0.94%)\nRussell 2000\n2,626.55\n-28.23\n(-1.06%)\nVIX\n17.01\n+0.13\n(+0.77%)\nGold\n5,067.50\n-287.30\n(-5.37%)\nTrending tickers\nBTC-USD\nBitcoin USD\n77,881.92\n-3,305.70\n(-4.07%)\nETH-USD\nEthereum USD\n2,355.62\n-172.35\n(-6.82%)\nXRP-USD\nXRP USD\n1.61\n-0.02\n(-1.50%)\nSOL-USD\nSolana USD\n102.57\n-6.26\n(-5.75%)\nBTC-CAD\nBitcoin CAD\n106,110.22\n-4,503.85\n(-4.07%)\nPortfolio\nSign in to access your portfolio\nSign in\nTop gainers\nPHOE\nPhoenix Asia Holdings Limited\n133.12\n+120.99\n(+997.44%)\nTCGL\nTechCreate Group Ltd.\n172.84\n+69.50\n(+67.25%)\nRHI\nRobert Half Inc.\n34.61\n+7.53\n(+27.83%)\nDECK\nDeckers Outdoor Corporation\n119.34\n+19.47\n(+19.50%)\nVZ\nVerizon Communications Inc.\n44.52\n+4.71\n(+11.82%)\nTop losers\nPFSI\nPennyMac Financial Services, Inc.\n99.92\n-49.43\n(-33.10%)\nPSLV\nSprott Physical Silver Trust\n26.41\n-9.89\n(-27.24%)\nU\nUnity Software Inc.\n29.10\n-9.28\n(-24.19%)\nNG\nNovaGold Resources Inc.\n8.73\n-2.27\n(-20.64%)\nCVCO\nCavco Industries, Inc.\n492.02\n-125.48\n(-20.32%)\nMost active\nHBAN\nHuntington Bancshares Incorporated\n17.48\n+0.19\n(+1.10%)\nNVDA\nNVIDIA Corporation\n191.13\n-1.38\n(-0.72%)\nPLUG\nPlug Power Inc.\n2.1150\n-0.2250\n(-9.62%)\nSOFI\nSoFi Technologies, Inc.\n22.81\n-1.55\n(-6.36%)\nINTC\nIntel Corporation\n46.47\n-2.19\n(-4.50%)\nEarnings events\nUpcoming\nFEB\n02\nDIS\nThe Walt Disney Company\nFEB\n03\nPLTR\nPalantir Technologies Inc.\nMRK\nMerck & Co., Inc.\nPEP\nPepsiCo, Inc.\nPFE\nPfizer Inc.\nEdit your Dock\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 4666, "Word_Count": 747, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/cv/apiv2/finance/article/fallback_thumb/opt/Investing.png"], "News_URL": "https://finance.yahoo.com/quote/9988.HK/news/", "Scrape_Time_Sec": 12.793890237808228}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-02-01T23:07:46.130440+00:00", "News_Date_Formatted": "2026-02-01 23:07:46 (GMT+0)", "Week_Num": 1, "News_Title": "Alibaba Group Holding Limited (9988.HK) stock price, news, quote and history - Yahoo Finance", "News_Source": "YAHOO", "News_Content": "Summary\nNews\nChart\nStatistics\nHistorical data\nProfile\nFinancials\nAnalysis\nOptions\nHolders\nHKSE - Delayed Quote\n•\nHKD\nAlibaba Group Holding Limited (9988.HK)\nFollow\nAdd holdings\n169.200\n-4.100\n(-2.37%)\nAt close: 30 January at 4:08:02 pm GMT+8\nAll\nNews\nPress releases\nSEC filings\nAlibaba’s Expanding AI Ecosystem And What It May Mean For BABA Investors\nSimply Wall St.\n•\n23 hr ago\nAlready Up Over 50% - These 2 AI Chip Stocks Are Just Getting Started\nZacks\n•\n1 day ago\nAlibaba Backed Moonshot AI Upgrades Its Flagship Model, Claims to Outdo US Rival AI Models\nInsider Monkey\n•\n1 day ago\nChina Clears DeepSeek to Buy Nvidia H200\nGuruFocus.com\n•\n1 day ago\nIs It Worth Investing in Alibaba (BABA) Based on Wall Street's Bullish Views?\nZacks\n•\n2 days ago\nChina conditionally approves DeepSeek to buy Nvidia's H200 chips - sources\nReuters Videos\n•\n2 days ago\nChina clears DeepSeek to buy Nvidia H200 chips\nGuruFocus.com\n•\n2 days ago\nAlibaba’s Robovan Spinoff Adds Automation Angle To Long Term BABA Story\nSimply Wall St.\n•\n2 days ago\nExclusive-China conditionally approves DeepSeek to buy Nvidia's H200 chips - sources\nReuters\n•\n2 days ago\nChina conditionally approves DeepSeek to buy Nvidia's H200 chips, sources say\nReuters\n•\n2 days ago\nNVIDIA at 41x Forward Earnings: Buy, Hold, or Cash Out?\nZacks\n•\n2 days ago\nAlibaba to merge driverless unit with China's Zelos in $2B deal\nGuruFocus.com\n•\n2 days ago\nAlibaba Reshapes Logistics With $2 Billion Robovan Deal\nGuruFocus.com\n•\n2 days ago\nBABA's Margins Suffer From Stiff Competition: Time to Sell the Stock?\nZacks\n•\n2 days ago\nAlibaba's logistics arm to buy stake in Chinese robovan developer Zelostech\nReuters\n•\n3 days ago\nChina’s H200 Approval Adds New Layer To Nvidia Valuation Debate\nSimply Wall St.\n•\n3 days ago\nAlibaba Chip Approval And Orbital AI Push Reshape Long Term Thesis\nSimply Wall St.\n•\n3 days ago\nNvidia CEO says Chinese govt yet to approve H200 imports\nThe Edge Singapore\n•\n3 days ago\nNvidia Stock Gains. How China and OpenAI News Could Break It Out of Its Rut.\nBarrons.com\n•\n4 days ago\nInvestors Heavily Search Alibaba Group Holding Limited (BABA): Here is What You Need to Know\nZacks\n•\n4 days ago\nPerformance overview\nReturn 9988.HK HANG SENG INDEX (^HSI)\nYTD +18.65% +6.85%\n1-year +91.91% +35.41%\n3-year +56.25% +24.09%\nCopyright © 2026 Yahoo. All rights reserved.\nWhat's trending\nStraits Times Index\nNikkei\nHang Seng\nFTSE 100\nBitcoin USD\nTSLA\nSingapore markets closed\nSingapore\nUS\nEurope\nAsia\nCryptocurrencies\nRates\nCommodities\nCurrencies\nStraits Times Index\n4,905.13\n-24.90\n(-0.51%)\nNikkei\n53,322.85\n-52.75\n(-0.10%)\nHang Seng\n27,387.11\n-580.99\n(-2.08%)\nFTSE 100\n10,209.12\n+37.36\n(+0.37%)\nBitcoin USD\n77,881.92\n-3,305.70\n(-4.07%)\nFTSE Bursa Malaysia\n1,740.88\n-15.61\n(-0.89%)\nTrending tickers\nGC=F\nGold Apr 26\n5,067.50\n-287.30\n(-5.37%)\nD05.SI\nDBS Group Holdings Ltd\n59.20\n-0.59\n(-0.99%)\nU11.SI\nUnited Overseas Bank Limited\n38.27\n-0.38\n(-0.98%)\nZ74.SI\nSingapore Telecommunications Limited\n4.5900\n+0.0200\n(+0.44%)\nSE\nSea Limited\n116.49\n-5.34\n(-4.38%)\nPortfolio\nSign in to access your portfolio\nSign in\nTop gainers\n1D3.SI\nAutagco Ltd.\n0.0020\n+0.0010\n(+100.00%)\n594.SI\nCapAllianz Holdings Limited\n0.0020\n+0.0010\n(+100.00%)\n541.SI\nAbundance International Limited\n0.0280\n+0.0070\n(+33.33%)\nC76.SI\nCreative Technology Ltd\n0.7500\n+0.1350\n(+21.95%)\nIBKD.SI\ni BBCA ID SDR 1to2\n1.3300\n+0.2000\n(+17.70%)\nTop losers\n5CF.SI\nOKP Holdings Limited\n0.8400\n-0.5800\n(-40.85%)\nE6R.SI\nLe tree Holdings Limited\n0.0030\n-0.0010\n(-25.00%)\nV3M.SI\nMetech International Limited\n0.0330\n-0.0070\n(-17.50%)\n40N.SI\nVersalink Holdings Limited\n0.0540\n-0.0100\n(-15.63%)\n1F1.SI\nY Ventures Group Ltd.\n0.0070\n-0.0010\n(-12.50%)\nMost active\n584.SI\nAJJ Medtech Holdings Limited\n0.0090\n+0.0010\n(+12.50%)\nA31.SI\nAddvalue Technologies Ltd\n0.0710\n-0.0010\n(-1.39%)\n5WH.SI\nRex International Holding Limited\n0.1550\n-0.0050\n(-3.12%)\nY92.SI\nThai Beverage Public Company Limited\n0.4800\n0.0000\n(0.00%)\nG13.SI\nGenting Singapore Limited\n0.7350\n+0.0050\n(+0.68%)\nEarnings events\nEdit your Dock\nTerms\nand\nPrivacy Policy\nPrivacy dashboard\nAd Terms\nFeedback", "Content_Length": 4058, "Word_Count": 637, "Image_URLs": [], "News_URL": "https://sg.finance.yahoo.com/quote/9988.HK/latest-news/", "Scrape_Time_Sec": 10.537745237350464}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-01-22T21:11:45+00:00", "News_Date_Formatted": "2026-01-22 21:11:45 (GMT+0)", "Week_Num": 2, "News_Title": "Stock market today: Dow, S&P 500, Nasdaq rise for second day in a row as Greenland drama fades", "News_Source": "YAHOO", "News_Content": "Stock market today: Dow, S&P 500, Nasdaq rise for second day in a row as Greenland drama fades\nRian Howlett\nand\nKaren Friar\nUpdated January 23, 2026 2 min read\nIn this article:\nStockStory Top Pick\nGE\n+2.69%\nMETA\n-2.95%\n^DJI\n-0.36%\n^IXIC\n-0.94%\n^GSPC\n-0.43%\nUS stocks rose on Thursday as investors breathed a continued sigh of relief that President Trump called off his threatened tariffs on European allies over his pursuit of Greenland.\nThe tech-heavy Nasdaq Composite (^IXIC) led the advance, rising nearly 0.9% as Tesla (TSLA) shares surged over robotaxi optimism. The blue-chip Dow Jones Industrial Average (^DJI) gained roughly 0.6%. Meanwhile, the benchmark S&P 500 (^GSPC) added 0.5% on the heels of Wall Street's sharp rally on Wednesday.\nGold (GC=F) also crossed $4,900 per ounce for the first time on Thursday, extending a string of record highs since the start of the year.\nNasdaq GIDS - Delayed Quote\n•\nUSD\nNASDAQ Composite (^IXIC)\nFollow\nView Quote Details\n23,461.82\n-223.30\n(-0.94%)\nAt close: January 30 at 5:15:59 PM EST\n^IXIC\n^DJI\n^GSPC\nAdvanced Chart\nStocks continued climbing after Trump hit pause on the 10% tariffs planned for eight NATO members in February, soothing the concerns that weighed on Wall Street earlier in the week. But investors remain on alert, as the EU and the US are still at odds over who will control Greenland.\nTrump said he had drawn up a \"framework of a future deal\" with NATO's leader for the Arctic island, which the US wants to purchase. But Denmark's prime minister stressed Thursday that the sovereignty of its territory is not up for discussion.\nBeyond trade and geopolitics, investors are bracing for Intel (INTC) to lead out Big Tech earnings when it reports quarterly results after the bell on Thursday. AI spending by the likes of Meta (META) and a global memory shortage will be in focus as the chipmaker attempts a turnaround. Procter & Gamble (PG) and GE Aerospace (GE) are among the crowd of companies also on the earnings docket.\nRead more: Live coverage of corporate earnings\nMeanwhile, a shutdown-delayed report on the Federal Reserve's preferred inflation gauge, the PCE price index, showed that consumer prices rose at a 2.8% annual pace in November. That inflation data, coupled with initial jobless claims, which increased only marginally, kept the Fed on course to hold rates steady at its next policy meeting.\nIn another economic reading, the US economy grew at the fastest pace in two years through the third quarter of 2025. GDP grew at an annual pace of 4.4% for the quarter in an upgrade from the government's first estimate.\nEven so, unemployment benefits claims ticked up to 200,000 for the week ended Jan. 17, up just slightly from the previous week's 199,000 filings, according to Labor Department data.\nLIVE COVERAGE IS OVER 22 updates\nFri, January 23, 2026 at 5:05 AM GMT+8\nInes Ferré\nStocks rise for second day in a row, gold crosses $4,900\nStocks rose for a second day in a row as the threat of an escalation over President Trump's pursuit of Greenland faded.\nThe S&P 500 (^GSPC) gained 0.5%, while the Dow Jones Industrial Average (^DJI) increased 0.6%.\nTesla (TSLA) shares took the tech-heavy Nasdaq Composite (^IXIC) higher after CEO Elon Musk said the company started robotaxi rides with no safety monitor present in Austin, a long-awaited move.\nThe move higher in stocks comes a day after President Trump announced a \"framework\" for a future deal for Greenland, and abandoned the threat of fresh tariffs against European nations.\nGold (GC=F) touched a fresh record high, surpassing $4,900 for the first time and extending momentum in the precious metals trade.\nCOMEX - Delayed Quote\n•\nUSD\nGold Apr 26 (GC=F)\nFollow\nView Quote Details\n5,067.50\n-287.30\n(-5.37%)\nAs of January 30 at 10:24:58 AM EST. Market Open.\nAdvanced Chart\nFri, January 23, 2026 at 4:02 AM GMT+8\nInes Ferré\nTesla stock pops as Elon Musk posts video claiming no safety monitor in Austin robotaxi\nTesla (TSLA) CEO Elon Musk said the company started robotaxi rides with no safety monitor present in the cars in Austin, a long awaited move. This comes after Waymo announced another expansion of its robotaxi service in the US, hammering home its lead in the autonomous space - for now.\nMusk also claimed on Thursday that he expects the company’s self driving service to get EU and China approval soon.\nTesla stock popped on the news in midday trade, up over 3%.\nNasdaqGS - Nasdaq Real Time Price\n•\nUSD\nTesla, Inc. (TSLA)\nFollow\nView Quote Details\n430.41\n+13.84\n(+3.32%)\nAt close: January 30 at 4:00:02 PM EST\n429.63\n-0.78\n(-0.18%)\nAfter hours: January 30 at 7:59:58 PM EST\nAdvanced Chart\nRead more here.\nFri, January 23, 2026 at 3:40 AM GMT+8\nInes Ferré\nAnalysts say a stock market double is a pipe dream without a rate-spiking GDP boom\nYahoo Finance's Francisco Velasquez reports:\nPresident Trump's call that the S&P 500 (^GSPC) will see another massive rally is starting to look fuzzy.\n\"If you get double the stock market, it really will reflect the ", "Content_Length": 28976, "Word_Count": 4754, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-for-second-day-in-a-row-as-greenland-drama-fades-210027669.html", "Scrape_Time_Sec": 6.683113098144531}
