{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-28T00:00:00+00:00", "News_Date_Formatted": "2026-01-28 00:00:00 (GMT+0)", "Week_Num": 1, "News_Title": "BYD (SEHK:1211) Valuation Check As P/E Premium Contrasts With Cash Flow Upside Signals", "News_Source": "SIMPLYWALL", "News_Content": "Hong Kong\n/Auto\n/SEHK:1211\nBYD (SEHK:1211) Valuation Check As P/E Premium Contrasts With Cash Flow Upside Signals\nSimply Wall St\nJanuary 28, 2026\nRecent share performance and business scale\nWithout a clear single news catalyst, you might be looking at BYD (SEHK:1211) simply because its recent share performance and business size stand out among Hong Kong listed auto and battery groups.\nOver the past month, BYD shares have returned about 5.9%, while the past 3 months show a modest 1.3% decline. On a 1 year view, the total return figure provided is 14.2%.\nThe company reports revenue of CN¥841.1b and net income of CN¥38.3b. This reflects a large-scale operation across automobiles, batteries and related services. Annual revenue growth is given as 10.8%, with net income growth at 16.3%.\nAt the last close of HK$102.80, some valuation metrics in the data suggest a potential gap between market price and certain fair value estimates. However, these approaches depend heavily on the assumptions behind each model.\nSee our latest analysis for BYD.\nRecent trading points to rebuilding momentum, with a 1 day share price return of 4.6% and a 7 day share price return of 3.8%, set against a 1 year total shareholder return of 14.2% that reflects steadier long term gains.\nIf BYD has you thinking more broadly about the auto space, it could be a good time to see what else is on the move among auto manufacturers.\nSo with BYD trading at HK$102.80 alongside fair value and price target estimates that sit higher, is the current share price a genuine gap you can exploit, or is the market already factoring in future growth?\nPrice to earnings of 21.7x: Is it justified?\nOn the latest numbers, BYD trades on a P/E of 21.7x, while our fair value work points to a lower P/E of 13.8x and the shares sit below some cash flow based estimates such as the SWS DCF model fair value of HK$136 versus the last close at HK$102.80.\nThe P/E ratio compares the current share price with earnings per share and is a common way for investors to judge how much they are paying for each unit of profit. For a large auto and battery group like BYD, a higher P/E can reflect expectations for further earnings progress as well as the breadth of its businesses across vehicles, batteries and related services.\nHere, the 21.7x P/E sits above both the Asian auto industry average of 18.2x and a peer average of 8.3x. This suggests the market is assigning BYD a richer earnings tag than many regional and peer names. Compared with the estimated fair P/E of 13.8x, the gap is also wide. This highlights a level that the market could move towards if sentiment or earnings expectations change.\nExplore the SWS fair ratio for BYD\nResult: Price to earnings of 21.7x (OVERVALUED)\nHowever, you still need to watch for earnings expectations resetting if sentiment toward higher P/E auto names cools or if analyst price targets are revised lower.\nFind out about the key risks to this BYD narrative.\nAnother view: Cash flow says something different\nIf you put the earnings multiple to one side and look at our SWS DCF model, you get a different message. On this view, BYD at HK$102.80 sits about 24.4% below an estimated fair value of HK$136, which points to potential upside rather than stretch.\nThat gap matters because it shows how sensitive conclusions can be to the tool you use, and to the assumptions built into it. If profits or cash flows play out differently, could this apparent cushion shrink or widen from here?\nLook into how the SWS DCF model arrives at its fair value.\n1211 Discounted Cash Flow as at Jan 2026\nSimply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (check out BYD for example). We show the entire calculation in full. You can track the result in your watchlist or portfolio and be alerted when this changes, or use our stock screener to discover 876 undervalued stocks based on their cash flows. If you save a screener we even alert you when new companies match - so you never miss a potential opportunity.\nBuild Your Own BYD Narrative\nIf this view does not quite match your own read of the numbers, you can test the assumptions yourself and shape a personalised thesis in just a few minutes with Do it your way.\nA great starting point for your BYD research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\nLooking for more investment ideas?\nIf you stop with just one stock, you risk missing other opportunities that better suit your goals, so put a few minutes aside and scan fresh ideas now.\nSpot potential bargains early by checking out these 876 undervalued stocks based on cash flows that stand out on cash flow metrics and pricing.\nRide powerful tech trends by reviewing these 24 AI penny stocks that are tied to artificial intelligence themes.\nExplore income-focused ideas by scanning these 13 dividend stocks with yields > 3% that offer yields above 3%.\nThis article by Simply Wall St is general in ", "Content_Length": 6908, "Word_Count": 1154, "Image_URLs": ["https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/dcf", "https://images.ctfassets.net/n07nr2koi959/220TWz80MMu5IKd31MX2Mh/5baf073475c70362f71c7471b9e72a3c/portrait.jpg?fit=thumb&w=64&h=64", "https://images.ctfassets.net/n07nr2koi959/51SSiWSLQ6bnbhvLt2LrUO/204581c61a830f0e0500f0816d54ddf6/IMG_8661.jpg?fit=thumb&w=64&h=64", "https://media.simplywall.st/news/1721008721705-Timo-profile-picutre.jpg", "https://media.simplywall.st/news/1732588370521-bullish.png"], "News_URL": "https://simplywall.st/stocks/hk/automobiles/hkg-1211/byd-shares/news/byd-sehk1211-valuation-check-as-pe-premium-contrasts-with-ca/amp", "Scrape_Time_Sec": 2.7914764881134033}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-29T21:39:04.007000+00:00", "News_Date_Formatted": "2026-01-29 21:39:04 (GMT+0)", "Week_Num": 1, "News_Title": "BYD (1211 HK) Tactical Outlook: Taking Off?", "News_Source": "SMARTKARMA", "News_Content": "Dashboard\nDiscussions\nWatchlists\nCollections\nTools\nMore\n𝛼SK\nor Search\nSIGN UP\nSIGN IN\nBullish\nBYD\nWatchlist\nBYD (1211 HK) Tactical Outlook: Taking Off?\nEquity Derivatives\n192 Views30 Jan 2026 05:39\nAs indicated in previous insight at the end of December, BYD (1211 HK) seems to be bottoming and restarting its rally. Our short-term target is 106.4. The rally could continue after a small pullback.\nWHAT IS COVERED IN THE FULL INSIGHT:\nIntroduction\nMarket Reversal Matrix Overview\nQuantChart Analysis\nWeekly Support and Resistance Levels\nProfit Targets and Reversal Probability\nNico Rosti\nFollow\nMessage\nSUMMARY(Sign Up to Access)\nTry Now\nBegin exploring Smartkarma's AI-augmented investing intelligence platform with a complimentary Preview Pass to:\nUnlock research summaries\nFollow top, independent analysts\nReceive personalised alerts\nAccess Analytics, Events and more\nJoin 55,000+ investors, including top global asset managers overseeing $13+ trillion.\nUpgrade later to our paid plans for full-access.\nSMARTKARMA PREVIEW PASS\nSign Up with LinkedIn\nor\nFirst Name\nLast name\nEmail\nSign Up with Email\nBy signing up, you agree to our\nTerms of Use and Privacy Policy.\nAlready have an account? Sign In Now\nFULL INSIGHT\n(Paid Plans Only, 2-minute read)\nRELATED INSIGHTS\nMore »\nBYD (1211 HK) Tactical Outlook: Taking Off?\nQuiddity Leaderboard HSTECH Mar26: Final Ranks; US$840mn One-Way\nHSTECH Index Rebalance Preview: Changes If Index Universe Is Expanded\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\nTRENDING COLLECTIONS\nMore »\nEquity Bottom-Up\nEvent-Driven\nUnpaywalled Insights\nIndex Rebalance\nSingapore Value-Up\nSmartkarma Company Primers\nJapan\nSouth Korea\nGold\nPhilippines\nTRENDING INSIGHTS\nMore »\nPrimer: Modern Times Group MTG (MTGB SS) - Feb 2026\nOverview #48 — Gradually, Then Suddenly\nMakino Milling Machine (6135 JP): Twin Headwinds as Chinese and US Approvals Secured\nSBS Transit (SBUS SP | BUY | TP:S$3.92): Bussing for Dividends\nWeekly Deals Digest (01 Feb) - Toyota Ind, Mandom, Eastroc, Montage, Muyuan, Shin Etsu, Kandenko\nTOP UNPAYWALLED INSIGHTS\nMore »\nCurator's Cut: Going Private, Getting Active & Reviewing Public Market Premieres\nOverview #48 — Gradually, Then Suddenly\nSlight Gain in Governance, ROE and Valuations in 2025 Suggest that Reforms Have yet to Spread Widely\nBangladesh: VEON’s Next Billion-Dollar Fintech Opportunity\nOverview #47 – Are We There Yet?\nDISCUSSIONS\n(Paid Plans Only)\nPrice Chart(Sign Up to Access)\nSmartkarma SmartScore\n3.6/5\nRelative to stocks in the same:\nCountry & Sector\nValue\n3\nDividend\n4\nGrowth\n5\nResilience\n3\nMomentum\n3\n1\n2\n3\n4\n5\nSentiment\nView SmartScore Screener »\nInsight Stream\nBYD (1211 HK) Tactical Outlook: Taking Off?\n30 Jan 2026\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\n30 Dec 2025\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\n16 Dec 2025\nRelated Entities\nBYD (1211 HK)\nExpand All\nCollapse All\nTop\nSOLUTIONS\nFor Institutional Investors and Financial Services\nFor Corporate IR and Strategy\nFor Private Wealth Intermediaries\nPricing\nHow Smartkarma Compares\nABOUT\nWho We Are\nCareers\nFAQs\nResearch Provider Solutions\nSyndicate your Publications\nLEGAL\nCompliance\nTerms of Use\nPrivacy Policy\nPress Kit\nRSS Feeds\nCONTACT\nRequest a Free Trial\nAvail a Transition Account\nGuest Posts on Smartkarma\nOther Enquiries\nJoin TL;DR Community\nFree Weekly Newsletters\nDOWNLOAD\nCopyright © 2022 Smartkarma Innovations Pte Ltd. All Rights Reserved. v3.63.2", "Content_Length": 3536, "Word_Count": 547, "Image_URLs": ["https://www.smartkarma.com/_next/image?url=https%3A%2F%2Fstatic-prod.smartkarma.com%2Faccounts%2Fprofile_photos%2F000%2F049%2F555%2Fsmall%2Fdata%3F1685106429&w=96&q=75"], "News_URL": "https://www.smartkarma.com/insights/byd-1211-hk-tactical-outlook-taking-off?utm_medium=feed&utm_source=RSS", "Scrape_Time_Sec": 2.6876487731933594}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-19T06:38:06+00:00", "News_Date_Formatted": "2026-01-19 06:38:06 (GMT+0)", "Week_Num": 3, "News_Title": "Tesla poised to be early winner as Canada opens door to Chinese-made EVs", "News_Source": "YAHOO", "News_Content": "Tesla poised to be early winner as Canada opens door to Chinese-made EVs\nReuters\nJanuary 19, 2026 3 min read\nIn this article:\nTSLA\n+3.32%\nPSNY\n-8.02%\nBYDDF\n-2.94%\nNIO\n-1.47%\nGELHY\n-3.49%\nBEIJING/SHANGHAI, Jan 19 (Reuters) - Tesla (TSLA) is poised to be one of the first automakers to benefit from Canada's move to remove 100% tariffs on Chinese-made EVs, thanks to its early efforts to ship cars from its Shanghai plant there and its established Canadian sales network, experts say.\nUnder the deal announced last Friday, Canada will allow up to 49,000 vehicles to be imported annually ‌from China with a tariff of 6.1% on most-favoured nation terms. Canadian Prime Minister Mark Carney said the quota could rise to reach 70,000 vehicles within five years.\nHowever, under one clause ‌in the agreement, half of the quota will be reserved for vehicles under 35,000 CAD ($25,189). Tesla model prices are all above that number.\nWhile many Chinese automakers will be keen to seize the opportunity as they expand exports, Tesla has an advantage as it in 2023 already equipped its Shanghai plant, its biggest and most cost-efficient factory globally, to build and export a Canada-specific version of its Model Y.\nA Tesla China-made Model 3 vehicle owner sits inside a car during a delivery event at Tesla's Shanghai factory in China January 7, 2020. REUTERS/Aly Song · REUTERS / Reuters\nThe U.S. automaker had that same year started shipping the car ⁠from Shanghai to Canada, boosting Canadian imports of automobiles ‌from China to its largest port, Vancouver, by 460% year over year to 44,356 in 2023.\nBut it was forced to stop in 2024 and switched to shipping from its U.S. and Berlin factories after Ottawa imposed 100% tariffs, citing ‍a wish to counter what they called China's intentional state-directed policy of overcapacity.\nNow, it ships Model Ys produced in Berlin to Canada, but more variants such as cheaper Model 3s are mostly built in China.\n\"This new agreement could allow resumption of those exports rather quickly,\" said Sam Fiorani, vice president of research firm AutoForecast Solutions.\nNasdaqGS - Nasdaq Real Time Price\n•\nUSD\nTesla, Inc. (TSLA)\nFollow\nView Quote Details\n430.41\n+13.84\n(+3.32%)\nAt close: January 30 at 4:00:02 PM EST\n429.63\n-0.78\n(-0.18%)\nAfter hours: January 30 at 7:59:58 PM EST\nAdvanced Chart\nTesla has an existing network of 39 stores in Canada, whereas Chinese rivals such as BYD and Nio do not yet have a sales presence ‌there, and it can also likely move faster with marketing plans as it only has four core models, far fewer than its Chinese competitors.\n\"Tesla indeed has an advantage with its offering of a few models, versions and simple production lines so that it can be flexible to sell cars produced in any country in any markets to achieve the best cost efficiency,\" said Yale Zhang, managing director at Shanghai-based consultancy AutoForesight.\nTesla did not immediately respond to a Reuters' request for comment.\nOther brands that exported cars made in China to Canada before the tariffs included Volvo and Polestar, which are both ⁠owned by China's automaking group Geely.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3181, "Word_Count": 529, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/cv/apiv2/finance/newsletter/yfmb_v2.png"], "News_URL": "https://finance.yahoo.com/news/tesla-poised-early-winner-canada-063806461.html", "Scrape_Time_Sec": 17.78971791267395}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-12T05:10:06+00:00", "News_Date_Formatted": "2026-01-12 05:10:06 (GMT+0)", "Week_Num": 3, "News_Title": "After winning global EV crown, BYD faces new challenge with profitability test", "News_Source": "THEBAMBOOW", "News_Content": "After winning global EV crown, BYD faces new challenge with profitability test\nJanuary 12, 2026\n1211.HK\n97.75\n(0.0%)\n002594.SHE\n90.89\n(0.0%)\nFollow\nChina’s EV giant overtook Tesla in unit sales last year, but margin pressure, overseas risks and a controversial financing model raise questions on whether it can still deliver shareholder value\nKey Takeaways:\nBYD’s global sales surge has not translated into higher profitability, as the company faces pressures from an ongoing price war at home and falling profits per vehicle\nThe unwinding of the leading EV maker’s supplier‑financing scheme and rising overseas challenges threaten to lift its debt ratio and dampen its expansion\n   By Xia Fei\nChinese electric carmaker BYD Co. Ltd. (1211.HK; 002594.SZ), whose name stands for “Build Your Dreams,” may have just achieved one such vision: overtaking Elon Musk’s Tesla (TSLA.US) as the world’s biggest seller of electric vehicles (EVs). But that vision may be coming at a cost, quite literally, as BYD’s dream puts its profitability on a dangerously downward trajectory that sometimes comes with such aggressive expansion.\nThe Shenzhen-based company basked in the global spotlight earlier this month when it revealed that it sold 2.26 million EVs globally in 2025, driven by 145% year-on-year growth abroad. By comparison, Tesla’s battery-powered car deliveries fell 8.6% to 1.6 million last year, the largest annual drop in its history.\nThat resounding trading of places looks like a sweeping victory for BYD. Within China, where domestic brands already reign, Tesla’s sales fell for the first time by more than 5% to around 620,000 vehicles — the first decline since its Shanghai gigafactory opened in 2020. BYD also outpaced Tesla in sales both in Britain and Germany, a sign that Chinese brands are starting to make headway into more affluent markets.\nSuch stark contrast marks a powerful riposte for Wang Chuanfu, a low-profile chemist who founded BYD as a battery maker in 1995, against Musk, who mocked the Chinese company as a rival more than a decade ago. Beyond car making, BYD has also invested heavily in energy storage and smart driving systems, moves that could help offset margin pressure amid a worsening price war that began in China and is rapidly being exported abroad by Chinese EV brands.\nBYD’s triumph owes in no small part to its heavy presence at the lower end of the market. Its Seagull models start at around just $8,000, and already include the company’s own “God’s Eye” self-driving system. That’s miles ahead of Tesla, whose entry-level Model 3 starts at $35,000 and has only gained partial approval to operate assisted driving in China.\nBut investors should think twice before jumping on the BYD bandwagon. Despite its triumph in scaling up rapidly, a much tougher battle for BYD is just starting: how to translate its huge volumes into higher profits.\nIn last year’s third quarter, BYD reported its net profit slumped by 32.6% to 7.8 billion yuan ($1.1 billion), representing its steepest fall in over four years. Revenue also fell for the first time in over five years to 195 billion yuan, a sharp reversal from its strong double-digit growth in 2023 and 2024.\nBy some measures, BYD’s profitability is still competitive with Tesla. Its gross margin was 17.9% in last year’s third quarter, roughly equal to Tesla’s 18%. But a Morgan Stanley report showed BYD’s per-vehicle profit fell to just 4,800 yuan in last year’s second quarter, down from 8,000 yuan the previous quarter — a fraction of Tesla’s roughly $6,000 per vehicle in 2024.\nChallenge of staying profitable\nCutthroat competition in China, where rivals race to sell cars on thin margins, and profits remain elusive for most companies, threatens to further compress BYD’s profitability. Higher vehicle purchase taxes, reduced government subsidies for lower-end EVs and ongoing competition will likely mean a more brutal year for BYD and other Chinese car brands ahead.\nAt the same time, China’s EV market is showing signs of slowing sharply after several years of rapid growth. Analysts at S&P Global predict China’s car sales – roughly half of which now come from new energy vehicles (NEVs) – will fall in China in 2026, leaving BYD and its peers little choice but to subsidize consumers further, squeezing margins again.\nAs pressures mount at home, BYD is racing to localize production on a mass scale in Southeast Asia, Latin America and Europe, partly to sidestep tariffs and quicken delivery cycles. But building plants overseas is now a far more complex undertaking, especially as governments in countries from Brazil to Mexico scrutinize BYD’s plans to build local factories, and China itself worries about transferring cutting-edge technologies to those markets.\nAnother overlooked uncertainty for the world’s new EV king comes from government pressure that has forced the company to quietly dismantle a supply chain financing scheme that long helped to power its relentless expansion.\nDubbed Dilian, BY", "Content_Length": 9598, "Word_Count": 1535, "Image_URLs": [], "News_URL": "https://thebambooworks.com/after-winning-global-ev-crown-byd-faces-new-challenge-with-profitability-test/", "Scrape_Time_Sec": 3.8120267391204834}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-09T18:15:24+00:00", "News_Date_Formatted": "2026-01-09 18:15:24 (GMT+0)", "Week_Num": 4, "News_Title": "Is BYD (SEHK:1211) Price Missing The Mark After Recent EV Demand Headlines", "News_Source": "YAHOO", "News_Content": "Is BYD (SEHK:1211) Price Missing The Mark After Recent EV Demand Headlines\nSimply Wall St\nJanuary 10, 2026 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nWondering whether BYD’s current share price actually lines up with its underlying worth, or if the market is missing something you can use to your advantage.\nBYD shares closed at HK$94.55, with a 7 day return of a 4.3% decline and a 30 day return of a 3.3% decline, while the 1 year return stands at 14.1% and the 3 year and 5 year returns are 26.9% and 19.2% respectively.\nRecent news around electric vehicle demand, competition among global automakers, and policy support for new energy vehicles has kept investor attention on companies like BYD. These themes help frame how the market is currently thinking about growth potential and risk for the stock.\nBYD records a valuation score of 1 out of 6, which suggests only one of six valuation checks signals the shares as undervalued. Next, we will look at what different valuation approaches say about that, before finishing with a way to think about value that goes beyond the usual ratios.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow, or DCF, model projects a company’s future cash flows and then discounts them back to today’s value to estimate what the business might be worth right now.\nFor BYD, the model used is a 2 Stage Free Cash Flow to Equity approach, working in CN¥. The latest twelve month free cash flow is a cash outflow of CN¥29.1b, so the model relies on future projections. Analysts provide estimates for several years, and Simply Wall St then extrapolates further to build a 10 year path. By 2035, projected free cash flow is CN¥101.3b, with discounted values provided for each year along the way.\nBringing all those projected cash flows back to today gives an estimated intrinsic value of CN¥115.23 per share, compared with the current share price of HK$94.55. On this basis, the DCF suggests BYD trades at about a 17.9% discount, which indicates that the shares are undervalued relative to these cash flow assumptions.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 17.9%. Track this in your watchlist or portfolio, or discover 877 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable business like BYD, the P/E ratio is a useful way to relate what you pay for each share to the earnings the company generates per share. It gives you a quick sense of how much of those earnings the market is currently willing to pay for.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 2899, "Word_Count": 501, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/byd-sehk-1211-price-missing-181524639.html", "Scrape_Time_Sec": 3.42537260055542}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-06T16:06:27+00:00", "News_Date_Formatted": "2026-01-06 16:06:27 (GMT+0)", "Week_Num": 4, "News_Title": "How Surpassing Tesla In Global EV Sales At BYD (SEHK:1211) Has Changed Its Investment Story", "News_Source": "YAHOO", "News_Content": "How Surpassing Tesla In Global EV Sales At BYD (SEHK:1211) Has Changed Its Investment Story\nSimply Wall St\nJanuary 7, 2026 3 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nTSLA\n+3.32%\nBYD Company Limited has reported unaudited 2025 figures showing full-year vehicle sales and production rising versus 2024, even as December volumes eased, while the group also reshaped its UK leadership and continued building out its dealer network.\nThese results confirm that BYD has overtaken Tesla as the world’s largest seller of battery electric vehicles, underscoring how its global expansion is progressing despite slower growth and intense price competition at home.\nWe’ll now examine how BYD surpassing Tesla in global battery electric vehicle sales reframes the company’s investment narrative and future positioning.\nAI is about to change healthcare. These 29 stocks are working on everything from early diagnostics to drug discovery. The best part - they are all under $10b in market cap - there's still time to get in early.\nWhat Is BYD's Investment Narrative?\nFor BYD, the crux of the investment case is whether you believe it can turn its new global scale in battery electric vehicles into durable profitability, despite slower growth and fierce price pressure at home. The latest unaudited 2025 figures show full-year sales and production still up year on year, but with a weaker December and a trimmed sales target, which keeps near term demand and pricing firmly in focus as key catalysts. BYD overtaking Tesla as the largest BEV seller repositions the story toward global execution quality, product breadth and export momentum, while the UK leadership reshuffle and dealer build-out underline how seriously management is treating Europe as a growth offset to China. That said, the softer exit to 2025 may increase investor attention on margins and capital discipline.\nHowever, one risk in particular may matter more than the headline EV sales win. BYD's shares have been on the rise but are still potentially undervalued by 14%. Find out what it's worth.\nExploring Other Perspectives\nSEHK:1211 1-Year Stock Price Chart\nInvestors in the Simply Wall St Community have 24 fair value views on BYD, stretching from HK$114.83 to a very large HK$449.47. That spread sits against recent concerns about decelerating unit growth and China price pressure, which could influence how sustainably the company’s new BEV leadership position translates into future financial performance.\nExplore 24 other fair value estimates on BYD - why the stock might be worth just HK$114.83!\nBuild Your Own BYD Narrative\nDisagree with this assessment? Create your own narrative in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your BYD research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\nOur free BYD research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate BYD's overall financial health at a glance.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3160, "Word_Count": 500, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/surpassing-tesla-global-ev-sales-160627276.html", "Scrape_Time_Sec": 4.553876638412476}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-04T23:02:21.777885+00:00", "News_Date_Formatted": "2026-01-04 23:02:21 (GMT+0)", "Week_Num": 5, "News_Title": "Yamaha Motor Co., Ltd. (7272.T) Stock Price, News, Quote & History - Yahoo Finance", "News_Source": "YAHOO", "News_Content": "Summary\nNews\nChart\nConversations\nStatistics\nHistorical Data\nProfile\nFinancials\nAnalysis\nOptions\nHolders\nTokyo - Delayed Quote\n•\nJPY\nYamaha Motor Co., Ltd. (7272.T)\nFollow\nGet top stock picks\n1,163.50\n+13.00\n(+1.13%)\nAt close: January 30 at 3:30:00 PM GMT+9\n1D\n5D\n1M\n6M\nYTD\n1Y\n5Y\nAll\nKey Events\nMountain\nAdvanced Chart\nPrevious Close\n1,150.50\nOpen\n1,164.00\nBid\n1,163.00 x --\nAsk\n1,167.00 x --\nDay's Range\n1,153.00 - 1,169.50\n52 Week Range\n962.80 - 1,288.00\nVolume\n6,670,700\nAvg. Volume\n7,162,593\nMarket Cap (intraday)\n1.128T\nBeta (5Y Monthly)\n0.39\nPE Ratio (TTM)\n23.25\nEPS (TTM)\n50.05\nEarnings Date\nFeb 13, 2026\nForward Dividend & Yield\n50.00 (4.35%)\nEx-Dividend Date\nDec 29, 2025\n1y Target Est\n1,116.67\nYamaha Motor Co., Ltd. Overview Auto Manufacturers / Consumer Cyclical\nRecent News: 7272.T\nView More\nAll\nNews\nEarnings Calls\nPress Releases\nSEC Filings\nInfinitForm Bridges the Design-to-Manufacturing Gap with AI Generative Engineering\nGlobeNewswire\n•\n4d ago\nMagnesium Automotive Parts Global Market Report 2025-2029 and 2034 Featuring Prominent Players - ThyssenKrupp, Yamaha Motor, Buhler, and Georg Fischer\nGlobeNewswire\n•\n25d ago\nBRP Inc. (DOO) Recognizes The ACCC’s Ruling Against Selling Its Telwater Division\nInsider Monkey\n•\n29d ago\nBRP Acknowledges ACCC Decision on the Sale of its Telwater Business to Yamaha Motor Australia\nCNW Group\n•\n1mo ago\nIs Yamaha Motor’s Lab Automation Push With Nikon a Meaningful Strategic Shift for TSE:7272?\nSimply Wall St.\n•\n1mo ago\nIs Yamaha Motor Still Attractive After Stock Slide and Push Into Next Generation Mobility?\nSimply Wall St.\n•\n1mo ago\nNikon Instruments and Yamaha Motor Announce Strategic Collaboration\nPR Newswire\n•\n1mo ago\nYamaha Motor Launches Two New Electric Scooter Models for India\nBusiness Wire\n•\n2mo ago\nEurope $30+ Bn Motorcycles and Scooters Market Opportunities and Forecasts to 2034: Market Accelerates with R&D Investments by Leading Brands Including Triumph, KTM, Piaggio, and BMW Motorrad\nGlobeNewswire\n•\n2mo ago\nIntroducing the Yamaha Booth at the Japan Mobility Show 2025 - Exhibiting 16 Models, Including 6 World Premiere Models, Under the Theme of \"Feel. Move.\"\nBusiness Wire\n•\n2mo ago\nYamaha Motor (TSE:7272): Is the Current Share Price a Fair Reflection of Value?\nSimply Wall St.\n•\n2mo ago\nDiscover Two 'Strong Buy' Stocks Each Month\nSeeking Alpha . Ad\nPerformance Overview: 7272.T\nTrailing total returns as of 1/30/2026, which may include dividends or other distributions. Benchmark is\nNikkei 225 (^N225)\n.\nYTD Return\n7272.T\n0.34%\nNikkei 225 (^N225)\n5.93%\n1-Year Return\n7272.T\n6.62%\nNikkei 225 (^N225)\n34.95%\n3-Year Return\n7272.T\n23.57%\nNikkei 225 (^N225)\n94.37%\n5-Year Return\n7272.T\n84.96%\nNikkei 225 (^N225)\n92.76%\nEarnings Trends: 7272.T\nView More\nEarnings Per Share (GAAP)\nQ3 FY25\nEstimate\n+26.96\nActual\n-9.96\n  Revenue vs. Earnings\nAnnual\nQuarterly\nQ3 FY25\nRevenue\n632.45B\nEarnings\n--\nQ4\nFY24\nQ1\nFY25\nQ2\nFY25\nQ3\nFY25\n0\n200B\n400B\n600B\n  Analyst Insights: 7272.T\nView More\nAnalyst Price Targets\n1,000.00\nLow\n1,116.67\nAverage\n1,163.50\nCurrent\n1,400.00\nHigh\n  Analyst Recommendations\nStrong Buy\nBuy\nHold\nUnderperform\nSell\n  Statistics: 7272.T\nView More\nValuation Measures\nAs of 1/29/2026\nMarket Cap\n1.12T\nEnterprise Value\n1.67T\nTrailing P/E\n22.98\nForward P/E\n--\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n0.45\nPrice/Book (mrq)\n1.01\nEnterprise Value/Revenue\n0.67\nEnterprise Value/EBITDA\n8.00\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n0.61%\nReturn on Assets (ttm)\n2.17%\nReturn on Equity (ttm)\n2.33%\nRevenue (ttm)\n2.51T\nNet Income Avi to Common (ttm)\n15.39B\nDiluted EPS (ttm)\n50.05\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n378.61B\nTotal Debt/Equity (mrq)\n84.30%\nLevered Free Cash Flow (ttm)\n-6.79B\nCompare To: 7272.T\nCompare\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\n7272.T\nYamaha Motor Co., Ltd.\n1,163.50\n+1.13%\nMkt Cap\nJPY 1.128T\nIndustry\nAuto Manufacturers\n7267.T\nHonda Motor Co., Ltd.\n1,555.00\n+1.47%\nMkt Cap\nJPY 6.053T\nIndustry\nAuto Manufacturers\nHNDAF\nHonda Motor Co., Ltd.\n9.90\n-3.79%\nMkt Cap\n38.536B\nIndustry\nAuto Manufacturers\n7261.T\nMazda Motor Corporation\n1,186.50\n+4.49%\nMkt Cap\nJPY 748.421B\nIndustry\nAuto Manufacturers\n7203.T\nToyota Motor Corporation\n3,504.00\n+1.62%\nMkt Cap\nJPY 45.669T\nIndustry\nAuto Manufacturers\n7201.T\nNissan Motor Co., Ltd.\n377.30\n+3.20%\nMkt Cap\nJPY 1.319T\nIndustry\nAuto Manufacturers\nMBG.DE\nMercedes-Benz Group AG\n57.48\n+0.31%\nMkt Cap\nEUR 50.861B\nIndustry\nAuto Manufacturers\nSTLAM.MI\nStellantis N.V.\n8.24\n+1.45%\nMkt Cap\nEUR 23.797B\nIndustry\nAuto Manufacturers\nHMC\nHonda Motor Co., Ltd.\n30.33\n+0.17%\nMkt Cap\n39.421B\nIndustry\nAuto Manufacturers\n1211.HK\nBYD Company Limited\n97.750\n-3.98%\nMkt Cap\nHKD 891.206B\nIndustry\nAuto Manufacturers\nRACE\nFerrari N.V.\n333.17\n-1.58%\nMkt Cap\n59.018B\nIndustry\nAuto Manufacturers\nPeople Also Watch\n7269.T\nSuzuki Motor Corporation\n2,106.50\n+0.86%\n  7267.T\nHonda Motor Co., Ltd.\n1,555.00\n+1.47%\n  7202.T\nIsuzu Motors Limited\n2,485.00\n+1.33%\n  7270.T\nSubaru Corporation\n3,327.0", "Content_Length": 6958, "Word_Count": 1045, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/quote/7272.T/", "Scrape_Time_Sec": 11.480902910232544}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-04T23:02:21.777885+00:00", "News_Date_Formatted": "2026-01-04 23:02:21 (GMT+0)", "Week_Num": 5, "News_Title": "First Look: Futures Climb, FTSE 10,000, BYD Tops Tesla", "News_Source": "GURUFOCUS", "News_Content": "GURUFOCUS.COM\nLatest News\nUSA\nSemiconductors\nNVDA\nFirst Look: Futures Climb, FTSE 10,000, BYD Tops Tesla\nGuruFocus News\n01/02/2026 20:38\nStock News\nU.S. futures rise on first trading day: Tech leaders Nvidia (NVDA, Financial), Palantir (PLTR, Financial), Apple (AAPL, Financial), Alphabet (GOOGL, Financial), and Microsoft (MSFT, Financial) advanced premarket as S&P 500 and Nasdaq-100 futures gained, with the tech ETF (XLK, Financial) also higher. Source: CNBC, Yahoo Finance.\nFTSE 100 briefly tops 10,000: London’s blue-chip index crossed 10,000 for the first time as semis rallied (ASML (ASML, Financial), TSMC (TSM, Financial)) and Orsted (CPH:ORSTED, Financial) rose on legal action in the U.S. wind market; gains cooled later. Source: CNBC, BBC.\nBYD set to overtake Tesla in annual EV sales: BYD (HKG:1211, Financial) reported 2025 battery EV sales of ~2.26M, positioning it ahead of Tesla (TSLA, Financial), amid strong China competition; peers XPeng (XPEV, Financial), NIO (NIO, Financial), Li Auto (LI, Financial) and Xiaomi (HKG:1810, Financial) also grew. Source: BBC, CNBC.\nGold and silver notch best year since 1979: Safe‑haven demand and a weaker dollar powered outsized 2025 gains, with gold and silver ETFs (GLD, SLV) seeing heavy inflows into year‑end. Source: NBC News.\nOrsted challenges U.S. halt of Revolution Wind: Orsted (CPH:ORSTED) filed for an injunction against the U.S. lease suspension of its ~$5B offshore wind JV, saying the project is 87% complete. Source: CNBC, WJAR.\nStreet’s 2026 outlook: moderate gains: After a 2025 three‑peat, strategists see further S&P 500 advances led by AI beneficiaries like Nvidia (NVDA), Microsoft (MSFT), Apple (AAPL), Tesla (TSLA) and Palantir (PLTR), while warning on valuations and policy risks. Source: CNN Business, Business Insider.\nCrypto tax-reporting rules kick in: The U.K. and dozens of countries began CARF-aligned reporting, requiring exchanges (e.g., Coinbase (COIN, Financial)) to share user transaction data with tax authorities. Source: BBC, PYMNTS.\nDividend themes spotlighted: Income coverage highlighted high‑yield picks such as Verizon (VZ, Financial), AT&T (T, Financial), and Altria (MO, Financial), plus durable dividend names Johnson & Johnson (JNJ, Financial) and Walmart (WMT, Financial), reflecting investor focus on steady cash returns. Source: Yahoo Finance, Motley Fool.\nMemory crunch may lift device prices: Surging AI data‑center demand for DRAM/HBM is pressuring supply, with Micron (MU, Financial), Samsung (KRX:005930, Financial) and SK hynix (KRX:000660, Financial) benefiting as PC/smartphone OEMs face higher bill‑of‑materials costs. Source: BBC, Engadget.\nBuffett hands CEO role to Abel: Berkshire Hathaway (BRK.B, Financial) founder Warren Buffett (Trades, Portfolio) formally retired as CEO, saying the conglomerate is well‑positioned for the next century under Greg Abel, while remaining as chairman. Source: CNBC, NPR.\nStates, NYC roll out 2026 wage and labor changes: Nearly two dozen U.S. states raised minimum wages, while New York City expanded safe/sick time—moves affecting large employers across sectors including Walmart (WMT). Source: Dallas Morning News, CBS New York.\nHangzhou emerges as China’s physical‑AI hub: The city’s ecosystem—from giants like Alibaba (BABA, Financial) to robotics startups—advances embodied AI and open‑source models amid intense domestic competition. Source: CNBC, WebProNews.\nSprinkles Cupcakes shuts all stores: The 20‑year‑old gourmet cupcake chain announced an “orderly wind‑down,” closing U.S. shops and cupcake ATMs after a private‑equity sale in 2012. Source: ABC7, New York Post.\nTrump Media plans shareholder token: Trump Media & Technology Group (DJT, Financial) will distribute a new cryptocurrency to shareholders via Crypto.com, adding to its push into digital assets. Source: BBC, Al Jazeera.\nIRS details car-loan interest deduction for U.S.-built vehicles: Taxpayers who bought new cars assembled in the U.S. in 2025–2028 may deduct loan interest, potentially benefiting makers such as Ford (F, Financial), GM (GM, Financial), Tesla (TSLA) and Toyota (TM, Financial). Source: The Detroit News.\nDOE orders Colorado coal unit to keep running: The Energy Department directed Craig Station Unit 1—co‑owned in part by Xcel Energy (XEL, Financial)—to remain online past its retirement date, drawing cost and reliability pushback. Source: AP, CNN.\nSaving more tops 2026 personal‑finance content: Media launched “low‑buy” and 1% savings challenges with practical budgeting tips to rebuild cash buffers in a higher‑cost environment. Source: CNN Business, Yahoo Life.\nMortgage rates hit 2025 low into year‑end: Freddie Mac (FMCC, Financial) reported the average 30‑year fixed at 6.15%, aiding affordability and activity for lenders and originators such as Rocket Companies (RKT, Financial). Source: ABC News.\nHoliday trading hours: retailers mostly open: New Year’s Day saw many chains operating with adjusted hours—Target (TGT, Financial), Walmart (W", "Content_Length": 12297, "Word_Count": 1871, "Image_URLs": ["https://static.gurufocus.com/cdn-cgi/image/width=600,quality=100/1732800883252588544.png"], "News_URL": "https://www.gurufocus.com/news/4092221/first-look-futures-climb-ftse-10000-byd-tops-tesla", "Scrape_Time_Sec": 3.764956474304199}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-23T22:09:36+00:00", "News_Date_Formatted": "2025-12-23 22:09:36 (GMT+0)", "Week_Num": 6, "News_Title": "Is It Too Late To Consider BYD After Its Strong Multi Year Share Price Run?", "News_Source": "YAHOO", "News_Content": "Is It Too Late To Consider BYD After Its Strong Multi Year Share Price Run?\nSimply Wall St\nDecember 24, 2025 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nIf you are wondering whether BYD is still a smart buy after its big multiyear run, or if the easy money has already been made, you are not alone. That is exactly what this article will unpack.\nDespite some recent choppiness, with the stock down 1.5% over the last week and roughly flat over 30 days, BYD is still up 8.2% year to date and 3.1% over the past year, on top of a hefty 48.4% gain in three years and 49.9% in five.\nThese moves have come as BYD cements its position as a global EV and battery heavyweight, ramping exports and expanding its model lineup in key overseas markets. Investors have also been reacting to policy shifts in China and intensifying EV competition, which can quickly change how the market prices BYD's growth story.\nIn our framework, BYD scores just 1 out of 6 on undervaluation checks. That might sound underwhelming until you see how different valuation methods tell very different stories, and why the most useful way to think about fair value, which we will get to at the end, goes beyond a simple scorecard.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow model takes estimates of the cash a company can generate in the future and discounts those amounts back to what they are worth today, to arrive at an intrinsic value per share.\nFor BYD, the model uses a 2 Stage Free Cash Flow to Equity framework in CN¥. The latest twelve months show negative free cash flow of about CN¥29.1 billion, reflecting heavy investment and working capital swings. Analysts then expect free cash flow to turn positive and grow rapidly, with Simply Wall St extrapolating those forecasts so that by 2035 BYD could be generating around CN¥101.3 billion in free cash flow.\nAfter discounting this stream of cash flows back to today, the model arrives at an intrinsic value of roughly HK$111.24 per share. Compared with the current market price, this implies the stock is about 16.3% below this DCF-derived estimate of intrinsic value, indicating a potential valuation gap based on the model’s assumptions.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 16.3%. Track this in your watchlist or portfolio, or discover 909 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Dec 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable company like BYD, the price to earnings ratio is a straightforward way to gauge how much investors are willing to pay today for each dollar of current earnings. In general, stronger and more reliable earnings growth, and lower perceived risk, justify a higher PE multiple, while slower growth or higher uncertainty usually call for a lower, more conservative multiple.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3156, "Word_Count": 542, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/too-consider-byd-strong-multi-220936883.html", "Scrape_Time_Sec": 3.9180972576141357}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-21T23:02:21.777885+00:00", "News_Date_Formatted": "2025-12-21 23:02:21 (GMT+0)", "Week_Num": 7, "News_Title": "BYD Company Limited (1211.HK) Analyst Ratings, Estimates & Forecasts - Yahoo Finance", "News_Source": "YAHOO", "News_Content": "Summary\nNews\nChart\nConversations\nStatistics\nHistorical Data\nProfile\nFinancials\nAnalysis\nOptions\nHolders\nHKSE - Delayed Quote\n•\nHKD\nBYD Company Limited (1211.HK)\nFollow\nGet top stock picks\n97.750\n-4.050\n(-3.98%)\nAt close: January 30 at 4:08:02 PM GMT+8\nEarnings Trends: 1211.HK\nEarnings Per Share\nGAAP\nNormalized\nQ4 FY24\nEstimate\n+1.57\nActual\n+1.43\nRevenue vs. Earnings\nAnnual\nQuarterly\nQ3 FY25\nRevenue\n194.98B\nEarnings\n--\nQ4\nFY24\nQ1\nFY25\nQ2\nFY25\nQ3\nFY25\n0\n50B\n100B\n150B\n200B\n250B\nEarnings Estimate\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nNo. of Analysts 2 1 9 10\nAvg. Estimate 1.28 0.22 3.9 5.18\nLow Estimate 1.17 0.22 3.22 4.46\nHigh Estimate 1.39 0.22 4.59 5.92\nYear Ago EPS 1.72 1.04 4.24 3.9\nRevenue Estimate\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nNo. of Analysts 3 1 27 29\nAvg. Estimate 256.25B 158.97B 854.68B 1.01T\nLow Estimate 239.99B 158.97B 765.28B 877.37B\nHigh Estimate 284.75B 158.97B 988.08B 1.17T\nYear Ago Sales 274.85B 170.36B 777.1B 854.68B\nSales Growth (year/est) -6.77% -6.69% 9.98% 17.90%\nEarnings History\nCurrency in CNY 12/31/2024 3/31/2025 9/30/2025\nEPS Est. 1.57 0.85 1.17\nEPS Actual 1.43 1.04 0.85\nDifference -0.15 0.19 -0.32\nSurprise % -9.36% 22.35% -27.35%\nEPS Trend\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nCurrent Estimate 1.28 0.22 3.9 5.18\n7 Days Ago 1.34 0.3 3.9 5.17\n30 Days Ago 1.34 0.3 3.92 5.24\n60 Days Ago 1.39 0 3.95 5.23\n90 Days Ago 1.55 0 4.47 5.78\nEPS Revisions\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nUp Last 7 Days -- 1 -- 1\nUp Last 30 Days -- -- -- --\nDown Last 7 Days 1 -- 1 --\nDown Last 30 Days 1 -- 1 1\nGrowth Estimates\nSymbol Current Qtr. Next Qtr. Current Year Next Year\n1211.HK -- -- -7.88% 32.69%\nS&P 500 10.49% 10.30% 15.58% 15.26%\nRelated Tickers\n0175.HK\nGeely Automobile Holdings Limited\n16.090\n-4.23%\n  9868.HK\nXPeng Inc.\n71.650\n-1.71%\n  9866.HK\nNIO Inc.\n38.620\n+3.65%\n  XPEV\nXPeng Inc.\n17.98\n-3.31%\n  2015.HK\nLi Auto Inc.\n65.950\n-2.58%\n  VOW3.DE\nVolkswagen AG\n102.50\n-1.01%\n  9973.HK\nChery Automobile Co., Ltd.\n28.380\n+0.35%\n  2333.HK\nGreat Wall Motor Company Limited\n13.250\n-2.21%\n  LI\nLi Auto Inc.\n16.63\n-3.65%\n  7203.T\nToyota Motor Corporation\n3,504.00\n+1.62%\n  Copyright © 2026 Yahoo. All rights reserved.\nWhat's trending\nDow Jones\nS&P 500\nDAX Index\nNvidia\nTesla\nDJT\nTariffs\nExplore more\nMortgages\nCredit Cards\nSectors\nCrypto Heatmap\nFinancial News\nAbout\nData Disclaimer\nHelp\nFeedback\nSitemap\nLicensing\nWhat's New\nAbout Our Ads\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard\nU.S. markets closed\nUS\nEurope\nAsia\nCryptocurrencies\nRates\nCommodities\nCurrencies\nS&P 500\n6,939.03\n-29.98\n(-0.43%)\nDow 30\n48,892.47\n-179.09\n(-0.36%)\nNasdaq\n23,461.82\n-223.30\n(-0.94%)\nRussell 2000\n2,626.55\n-28.23\n(-1.06%)\nVIX\n17.01\n+0.13\n(+0.77%)\nGold\n5,067.50\n-287.30\n(-5.37%)\nTrending tickers\nBTC-USD\nBitcoin USD\n78,104.60\n-3,258.99\n(-4.01%)\nETH-USD\nEthereum USD\n2,366.85\n-161.22\n(-6.38%)\nXRP-USD\nXRP USD\n1.62\n-0.02\n(-1.24%)\nSOL-USD\nSolana USD\n102.83\n-6.20\n(-5.68%)\nBTC-CAD\nBitcoin CAD\n106,413.62\n-4,440.21\n(-4.01%)\nPortfolio\nSign in to access your portfolio\nSign in\nRecently viewed\n7272.T\nYamaha Motor Co., Ltd.\n1,163.50\n+13.00\n(+1.13%)\nTop gainers\nPHOE\nPhoenix Asia Holdings Limited\n133.12\n+120.99\n(+997.44%)\nTCGL\nTechCreate Group Ltd.\n172.84\n+69.50\n(+67.25%)\nRHI\nRobert Half Inc.\n34.61\n+7.53\n(+27.83%)\nDECK\nDeckers Outdoor Corporation\n119.34\n+19.47\n(+19.50%)\nVZ\nVerizon Communications Inc.\n44.52\n+4.71\n(+11.82%)\nTop losers\nPFSI\nPennyMac Financial Services, Inc.\n99.92\n-49.43\n(-33.10%)\nPSLV\nSprott Physical Silver Trust\n26.41\n-9.89\n(-27.24%)\nU\nUnity Software Inc.\n29.10\n-9.28\n(-24.19%)\nNG\nNovaGold Resources Inc.\n8.73\n-2.27\n(-20.64%)\nCVCO\nCavco Industries, Inc.\n492.02\n-125.48\n(-20.32%)\nMost active\nHBAN\nHuntington Bancshares Incorporated\n17.48\n+0.19\n(+1.10%)\nNVDA\nNVIDIA Corporation\n191.13\n-1.38\n(-0.72%)\nPLUG\nPlug Power Inc.\n2.1150\n-0.2250\n(-9.62%)\nSOFI\nSoFi Technologies, Inc.\n22.81\n-1.55\n(-6.36%)\nINTC\nIntel Corporation\n46.47\n-2.19\n(-4.50%)\nEarnings events\nUpcoming\nFEB\n02\nDIS\nThe Walt Disney Company\nFEB\n03\nPLTR\nPalantir Technologies Inc.\nMRK\nMerck & Co., Inc.\nPEP\nPepsiCo, Inc.\nPFE\nPfizer Inc.\nEdit your Dock\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 4320, "Word_Count": 684, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/quote/1211.HK/analysis/", "Scrape_Time_Sec": 3.63496994972229}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-21T23:02:21.777885+00:00", "News_Date_Formatted": "2025-12-21 23:02:21 (GMT+0)", "Week_Num": 7, "News_Title": "iShares MSCI China ETF (MCHI)", "News_Source": "STOCKANALY", "News_Content": "iShares MSCI China ETF (MCHI)\nNASDAQ: MCHI · Real-Time Price · USD\nFull Chart\nWatchlist\nCompare\n62.40 -1.83 (-2.85%)\nAt close: Jan 30, 2026, 4:00 PM EST\n62.41 +0.01 (0.02%)\nAfter-hours:\nJan 30, 2026, 7:58 PM EST\nOverview\nHoldings\nDividends\nHistory\nChart\n1 Day\n5 Days\n1 Month\nYTD\n1 Year\n5 Years\nMax\n-2.85%\n(1D)\nAssets $8.13B\nExpense Ratio 0.59%\nPE Ratio 14.64\nShares Out 126.60M\nDividend (ttm) $1.27\nDividend Yield 2.04%\nEx-Dividend Date Dec 16, 2025\nPayout Frequency Semi-Annual\nPayout Ratio 29.82%\nVolume 4,691,144\nOpen 63.10\nPrevious Close 64.23\nDay's Range 61.96 - 63.30\n52-Week Low 44.71\n52-Week High 67.37\nBeta 0.31\nHoldings 570\nInception Date Mar 29, 2011\nAbout MCHI\nFund Home Page\nThe iShares MSCI China ETF (MCHI) is an exchange-traded fund that is based on the MSCI China index, a market-cap-weighted index of investable Chinese shares MCHI was launched on Mar 29, 2011 and is issued by BlackRock.\nAsset Class\nEquity\nCategory\nChina Region\nRegion\nAsia-Pacific\nStock Exchange\nNASDAQ\nTicker Symbol\nMCHI\nETF Provider\nBlackRock\nIndex Tracked\nMSCI China\nTop 10 Holdings\n46.72% of assets\nName Symbol Weight\nTencent Holdings Limited 0700 16.78%\nAlibaba Group Holding Limited 9988 12.54%\nChina Construction Bank Corporation 0939 3.30%\nXiaomi Corporation 1810 2.65%\nPDD Holdings Inc. PDD 2.40%\nMeituan 3690 2.07%\nPing An Insurance (Group) Company of China, Ltd. 2318 2.07%\nIndustrial and Commercial Bank of China Limited 1398 1.82%\nBYD Company Limited 1211 1.58%\nNetEase, Inc. 9999 1.52%\nView More Holdings\nDividend History\nEx-Dividend Amount Pay Date\nDec 16, 2025 $0.73501 Dec 19, 2025\nJun 16, 2025 $0.53556 Jun 20, 2025\nDec 17, 2024 $0.89107 Dec 20, 2024\nJun 11, 2024 $0.19055 Jun 17, 2024\nDec 20, 2023 $0.99413 Dec 27, 2023\nJun 7, 2023 $0.42919 Jun 13, 2023\nFull Dividend History\nPerformance\nMCHI had a total return of 32.20% in the past year, including dividends. Since the fund's inception, the average annual return has been 3.37%.\nChart\n3.36%\n3.88%\n32.20%\n-4.49%\n6.68%\n3.37%\n1 Month\nYTD\n1 Year\n5 Years\n10 Years\nInception\n0%\n+10%\n+20%\n+30%\nEnd of interactive chart.\nNews\nAll\nVideos\nConversation\n'Very constructive' on Asia in 2026, with Chinese stocks tipped for 20% gains: Goldman Sachs\nKevin Sneader, President of APAC ex‑Japan at Goldman Sachs, speaks with CNBC's Emily Tan on the sidelines of the 19th Asian Financial Forum. He points to investor appetite for AI driving flows into As...\nOther symbols:\nBABA\nBIDU\nFXI\nJD\nKWEB\nPDD\n4 days ago - CNBC International TV\nForeign Stocks Extend Lead Over U.S. Shares In 2026\nGlobal stocks are still outperforming US shares so far in 2026, extending last year's winning run. Using a set of ETFs through yesterday's close (Jan. 21), all the major equity regions of the world ar...\nOther symbols:\nAAXJ\nAFK\nCEE\nEWJ\nILF\nSPY\nVEA\n9 days ago - Seeking Alpha\nChina Reports Robust Economic Growth, Thanks to Resilient Exports\nA surge in exports powered China's growth last year, defying expectations that a trade war with the U.S. would hobble the world's second-biggest economy. China's gross domestic product expanded 5% las...\nOther symbols:\nFXI\nKWEB\n13 days ago - WSJ\nChina fourth-quarter growth slows to 4.5%, weakest in nearly three years as consumption misses forecasts\nGDP grew 4.5% in the October to December period. Full-year economic output came in at 5%, meeting the official target of around 5%.\nOther symbols:\nFXI\nKWEB\n13 days ago - CNBC\nChina's Marks Record $1.2 Trillion Trade Surplus in 2025 Despite U.S. Tariffs\nChina posted a record trade surplus for 2025, as fresh data showed the world's second-largest economy remained resilient despite facing steep tariffs from the Trump administration.\nOther symbols:\nFXI\nKWEB\n18 days ago - WSJ\nMorgan Stanley sees 'year of stabilization' for China markets after strong 2025\nMorgan Stanley's Laura Wang says China equities are entering a phase of stabilization after a strong 2025, with future gains driven more by earnings growth than valuation expansion. She highlights AI,...\nOther symbols:\nFXI\nKWEB\n22 days ago - CNBC International TV\nChina Sees Consumer Inflation Edge Up as Deflation Lingers\nChina's consumer inflation picked up modestly in December, while factory-gate prices remained in contraction.\nOther symbols:\nFXI\nKWEB\n23 days ago - WSJ\nChina's Consumer Inflation Edges Up\nChina's consumer inflation continued to pick up mildly in December but factory-gate prices remained in contraction, capping off another year dogged by persistent deflationary pressures amid weak domes...\nOther symbols:\nFXI\nKWEB\n23 days ago - WSJ\nChina consumer inflation hits fastest pace since February 2023, in line with expectations\nConsumer prices rose 0.8% from a year earlier, its highest level since February 2023. Factory-gate prices dipped 1.9% in December from a year ago, better than the forecast 2% decline.\nOther symbols:\nFXI\nKWEB\n23 days ago - CNBC\nChinese Stock Charts Reach a Turning Point. What to Watch.\nAlibaba, NetEase, and hotel operator H World Group are seeing bullish technical indicators.\nOt", "Content_Length": 16471, "Word_Count": 2677, "Image_URLs": ["https://cdn.snapi.dev/images/v1/i/a/b/gen38-2484310-3487060.jpg", "https://cdn.snapi.dev/images/v1/f/p/w/rewed-2869303-3480589.jpg", "https://cdn.snapi.dev/images/v1/l/t/v/2gfre32-2666988-3480588.jpg", "https://cdn.snapi.dev/images/v1/9/e/v/2gfre32-2666988-3473777.jpg", "https://cdn.snapi.dev/images/v1/f/p/5/22ddew-2650953-3466795.jpg", "https://cdn.snapi.dev/images/v1/f/2/g/nkw2-2521076-3466752.jpg", "https://cdn.snapi.dev/images/v1/o/r/o/rewed-2869303-3466744.jpg", "https://cdn.snapi.dev/images/v1/7/q/l/2gfre32-2666988-3465459.jpg", "https://cdn.snapi.dev/images/v1/j/a/b/hgtr43ed-2704191-3455332.jpg", "https://cdn.snapi.dev/images/v1/r/l/c/fe2ef-2695161-3455324.jpg"], "News_URL": "https://stockanalysis.com/etf/mchi/", "Scrape_Time_Sec": 6.091278791427612}
