{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-01-24T15:22:57+00:00", "News_Date_Formatted": "2026-01-24 15:22:57 (GMT+0)", "Period_Num": 1, "News_Title": "TENCENT STOCK SLIPS INTO WEEKEND AS 0700.HK LAGS TECH GAUGE — WHAT TO WATCH BEFORE MONDAY", "News_Source": "TS2", "News_Content": "24 JANUARY 2026\nHKG:0700.HK·INVESTING·MARKET ANALYSIS·STOCK MARKET·TECHNOLOGY\n1 MIN READ\nTENCENT STOCK SLIPS INTO WEEKEND AS 0700.HK LAGS TECH GAUGE — WHAT TO WATCH BEFORE MONDAY\nBY KHADIJA SAEED\nHONG KONG, Jan 24, 2026, 23:10 HKT — Market closed.\nTencent slipped 0.4% to close at HK$595 on Friday, lagging behind the Hang Seng Tech index’s rise.\nAttention shifts to the Fed’s decision next week and crucial activity data out of China.\nTencent is gearing up for its annual results briefing, set for mid-March.\nTencent Holdings Ltd shares dipped on Friday, pushing the Hong Kong-listed tech giant into the new week under pressure, even as the broader sector showed strength. (Yahoo Finance)\nThat’s crucial since global tech sentiment has been carrying much of the market’s weight lately. The coming days will put that to the test, with U.S. rate signals on deck and a crowded calendar of major tech earnings that could ripple into Asia. (Reuters)\nHong Kong markets remain closed Saturday. They reopen Monday.\nTencent ended Friday at HK$595, fluctuating between HK$595 and HK$602 during the session, with roughly 19.2 million shares traded, according to data. (Yahoo Finance)\nThe Hang Seng TECH Index climbed 0.6% today, keeping Chinese internet stocks under the spotlight as investors selectively bought in. (Investing)\nRate expectations linger quietly. The Federal Reserve’s upcoming policy meeting is set for Jan. 27-28, with investors watching closely for any shifts in tone from Chair Jerome Powell. (Federal Reserve)\nTencent, famous for WeChat and its vast gaming and advertising operations, is betting on artificial intelligence to fuel growth, boosting investments in computing power along the way.\nTencent president Martin Lau flagged chip shortages as a key bottleneck during a November earnings call, saying AI chip scarcity is capping cloud growth. He added that if supply weren’t an issue, “our cloud revenue should be growing more.” (Reuters)\nChina’s official manufacturing PMI is set for release on Jan. 31. Investors watch this figure closely as a snapshot of factory output and the broader domestic economy. (FXStreet)\nThe risk scenario is clear: weak China data, a fresh jump in global yields, or stricter restrictions on advanced chips could reignite selling in China tech stocks, which are already pricey. A stumble in ad spending or delays in game releases would only deepen the pressure.\nTencent is set to release its 2025 fourth-quarter and full-year results on March 18, as listed in its investor calendar. (Tencent)\nTraders are zeroing in on the Fed’s Jan. 28 decision and Powell’s press conference — an event that could shift risk appetite far beyond just Wall Street.\nKHADIJA SAEED\nLATEST POSTS\nA dedicated markets reporter, she covers stocks, macroeconomics, and major business developments with a sharp eye for detail and accuracy.\nSTOCK MARKET TODAY\nSimplex Holdings (TSE:4373) Seen Trading Below Fair Value Despite Premium P/E\nFebruary 1, 2026, 9:59 AM EST. Simplex Holdings (TSE:4373) reported strong revenue and profit growth for the nine months ending December 31, 2025. The company implemented a four-for-one stock split and launched a significant share buyback program. Its price-to-earnings (P/E) ratio stands at 20.7x, above the peer average but below its own fair P/E of 24.6x, implying some upside potential. Earnings growth has outpaced the industry with a 56.6% increase over the past year and raised guidance for the future. However, recent short-term stock price gains have slowed, with 30- and 90-day returns of 8.75% and 10.79%, respectively. The market appears to price in robust growth, but questions remain about risks to revenue and net income growth. Investors should watch how Simplex compares with tech and AI peers in Japan's IT sector.\nLATEST ARTICLES\nMicrosoft stock price in focus after AI spending jolt: what to watch before Monday’s open\n1 FEBRUARY 2026\nGOOG stock price: What to watch before Alphabet’s Feb. 4 earnings after Wall Street’s Friday slide\n1 FEBRUARY 2026\nPREVIOUS STORY\nBroadcom stock dips to $320 as Intel shock hits chips; Fed week and VMware dispute loom\nNEXT STORY\nBerkshire Hathaway stock price dips into weekend: BRK.B traders brace for Fed week and BNSF storm", "Content_Length": 4237, "Word_Count": 672, "Image_URLs": [], "News_URL": "https://ts2.tech/en/tencent-stock-slips-into-weekend-as-0700-hk-lags-tech-gauge-what-to-watch-before-monday/", "Scrape_Time_Sec": 1.4866580963134766}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-01-18T03:09:04+00:00", "News_Date_Formatted": "2026-01-18 03:09:04 (GMT+0)", "Period_Num": 2, "News_Title": "Is Tencent Holdings (SEHK:700) Offering Value After Its 64% One Year Share Price Gain", "News_Source": "YAHOO", "News_Content": "Is Tencent Holdings (SEHK:700) Offering Value After Its 64% One Year Share Price Gain\nSimply Wall St\nJanuary 18, 2026 6 min read\nIn this article:\nTCEHY\n-1.94%\nTCTZF\n+2.09%\nTrack your investments for FREE with Simply Wall St, the portfolio command center trusted by over 7 million individual investors worldwide.\nIf you are wondering whether Tencent Holdings is still offering value at its current price, this article will walk you through what the numbers are really saying about the stock.\nThe shares last closed at HK$617.5, with returns of 1.1% over 7 days, 2.1% over 30 days, a 0.9% decline year to date, and 64.0% over the past year, plus 61.5% over 3 years and 0.1% over 5 years.\nRecent coverage has focused on Tencent's role as a major Hong Kong listed media and technology name and how sentiment toward large China exposed platforms has shifted over time. This context helps frame why investors are paying close attention to Tencent's share price moves and what they might mean for risk and opportunity.\nOn our checks, Tencent scores a 5 out of 6 valuation score. This suggests it screens as undervalued on most of the methods we use. Next we will break down those approaches and then finish with a way to think about valuation that goes beyond the usual ratios.\nFind out why Tencent Holdings's 64.0% return over the last year is lagging behind its peers.\nApproach 1: Tencent Holdings Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow model takes the cash Tencent Holdings is expected to generate in the future, then discounts those amounts back to what they are worth today to estimate an intrinsic value per share.\nOn this approach, Tencent starts from last twelve month free cash flow of about CN¥201.2b. Analysts provide forecasts for several years, and Simply Wall St then extends those estimates further. By 2029, projected free cash flow is CN¥403.7b, with intermediate years such as 2026 and 2027 sitting in the CN¥258.7b to CN¥310.1b range. Later years gradually increase toward the mid CN¥500b level by 2035 based on extrapolated assumptions.\nWhen all these projected cash flows are discounted back and combined using a 2 Stage Free Cash Flow to Equity model, the resulting intrinsic value comes out at HK$897.25 per share. Against the recent share price of HK$617.50, this implies the stock screens as around 31.2% undervalued on this method.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Tencent Holdings is undervalued by 31.2%. Track this in your watchlist or portfolio, or discover 872 more undervalued stocks based on cash flows.\n700 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Tencent Holdings.\nApproach 2: Tencent Holdings Price vs Earnings\nFor a profitable company like Tencent, the P/E ratio is a straightforward way to see what investors are paying for each unit of current earnings. It helps you compare the share price with the earnings that are already in place, without getting lost in more complex models.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3131, "Word_Count": 524, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/am5gubQQMDmRYsiXmIL0Tw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/ec3ec22e89e38a052fa5ef3554d706b9", "https://s.yimg.com/ny/api/res/1.2/2swpW_oPax1dS0x4tgVqCg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/4c0b685d94c99c21c494bdc657d65c9a", "https://s.yimg.com/ny/api/res/1.2/sWz1SFLzrz6pPtUbuvVx_w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/3748f7748ce18afae2f86ee319f59a4b"], "News_URL": "https://finance.yahoo.com/news/tencent-holdings-sehk-700-offering-030904899.html", "Scrape_Time_Sec": 3.9311232566833496}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-01-16T11:00:11+00:00", "News_Date_Formatted": "2026-01-16 11:00:11 (GMT+0)", "Period_Num": 2, "News_Title": "'Real nightmare scenario': How Nvidia's China struggles could hurt its competitive edge", "News_Source": "AOL", "News_Content": "'Real nightmare scenario': How Nvidia's China struggles could hurt its competitive edge\nLAURA BRATTON\nJan 16, 2026\n0\nNvidia's (NVDA) China business continues to face geopolitical hurdles, which could pose longer-term competitive risks for the AI chipmaker.\nOngoing US-China tensions have upended Nvidia’s sales in what was one of its largest markets. In the company’s most recent quarter, revenue from China, which includes Hong Kong, dropped 45% from a year ago to about $3 billion, according to Bloomberg data.\nAnd while the Trump administration green-lighted the sale of Nvidia’s H200 chip to China this week, albeit with a 25% tax,Reuters reported that China is barring imports of the GPUs except in special cases.\nSo far, Nvidia's dominant position in the chip market doesn't appear to have suffered much after the company initially lost access to the Chinese AI market in 2025. It became the first company with a $5 trillion valuation last fall. Despite a decline in China sales, its third quarter revenue overall soared more than 60% during the period to about $57 billion.\nBut over the long term, the Chinese commercial sector’s development and use of domestic chips could narrow Nvidia’s lead on the global stage, Wall Street analysts told Yahoo Finance.\nThey said Nvidia's dominance in AI software could suffer if Chinese tech developers begin making advances in open source alternatives, which would hurt its leadership in hardware as well.\n“That's the real nightmare scenario,” Seaport analyst Jay Goldberg said.\nNvidia’s software edge\nMuch of Nvidia’s competitive edge comes from its software stack. Developers using its AI systems rely on the company’s CUDA platform, which includes a library of proprietary tools that lets them program its GPUs efficiently and reinforces the company’s dominance in the chip market.\nAs companies build on CUDA, the cost of switching to a new software platform becomes disadvantageous, and they end up sticking with Nvidia’s offerings, which are only available if developers are programming on Nvidia's GPUs. Hence, the preference for Nvidia's software is key to maintaining its lead in the hardware space.\nRead more: Are we in an AI bubble? How to protect your portfolio if your AI investments turn against you.\nNvidia founder and CEO Jensen Huang speaks at the annual Consumer Electronics Show (CES) in Las Vegas, on Jan. 6. (Patrick T. Fallon / AFP via Getty Images) (PATRICK T. FALLON via Getty Images)\nWhile China’s chip suppliers — from tech giants Huawei and Alibaba (BABA) to newly public players such as Moore Threads and MetaX — lag Nvidia in the performance capabilities of their chips, there’s a risk that the country’s AI developers, forced to use those inferior, domestically-produced chips, will build their own open-source software. Open-source AI software is typically written to run on many different types of chips.\nAdvertisement\nAnd if that software becomes more widely adopted globally, it would erode Nvidia’s strategic advantage.\n“It’s increasingly about the software and the models [for Nvidia],” TECHnalysis chief analyst Bob O’Donnell said. “The bigger concern I think, ultimately, in China is going to be whether or not CUDA gets replaced, more so than the chips themselves.”\nSeaport's Goldberg also stressed the significance of a scenario in which open-source tools from China gain more relevance.\n“You'll start to have open-source software tools coming out of China that do not rely on Nvidia's key competitive barrier, CUDA … And so companies outside of China will start to look at those and use those,” Goldberg added.\n“That creates a big hole in Nvidia's competitive barrier,” he said.\nWhile China hawks argue that trade restrictions on Nvidia's chips are crucial to national security, Nvidia has taken the position that losing access to China would weaken the United States' broader competitive position as developers in China begin to find new ways to innovate on AI with fewer resources, as evidenced by DeepSeek's advances in early 2025.\n\"As I have long said, China is nanoseconds behind America in AI,\" CEO Jensen Huang said in a statement posted on X in November. \"It's vital that America wins by racing ahead and winning developers worldwide.\"\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nSign up for Yahoo Finance's Week in Tech newsletter. (yahoofinance)\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance", "Content_Length": 4662, "Word_Count": 740, "Image_URLs": ["https://s.aolcdn.com/images/dims?format=jpg&quality=80&thumbnail=140%2C120&image_uri=https%3A%2F%2Fmedia.zenfs.com%2Fen%2Faol_people_articles_471%2F5164cb25b182483cfd84718471589ccc&client=76f99bdb8f78cd44cc0b&signature=ff0395252b7a6f56d6806a869db2d7dca50c421e", "https://s.aolcdn.com/images/dims?format=jpg&quality=80&thumbnail=140%2C120&image_uri=https%3A%2F%2Fmedia.zenfs.com%2Fen%2Faol_allrecipes_articles_781%2Feaf83cabe8f70336e955dab907f88e55&client=76f99bdb8f78cd44cc0b&signature=31e1942d9d2c199dfc5a0af706519e7360b5d1b8", "https://s.aolcdn.com/images/dims?format=jpg&quality=80&thumbnail=140%2C120&image_uri=https%3A%2F%2Fmedia.zenfs.com%2Fen%2Faol_southern_living_articles_226%2F0d553251dc3f1d9eeeba45dbcbaa2997&client=76f99bdb8f78cd44cc0b&signature=5ee7132ce9045347ec1fda94a65ac34ffdfca4e0", "https://s.aolcdn.com/images/dims?format=jpg&quality=80&thumbnail=140%2C120&image_uri=https%3A%2F%2Fmedia.zenfs.com%2Fen%2Faol_people_articles_471%2F35014a12175d6a0e72e95853dd178594&client=76f99bdb8f78cd44cc0b&signature=85a15dc1bce2f07185465955782da6507dc6cb4c", "https://s.aolcdn.com/images/dims?format=jpg&quality=80&thumbnail=140%2C120&image_uri=https%3A%2F%2Fmedia.zenfs.com%2Fen%2Faol_cnn_articles_945%2Fcb3232f7f9d90e66fcd0450dd1ec9b39&client=76f99bdb8f78cd44cc0b&signature=daab781d9a0422dd58decd740acaca7f41e7b978"], "News_URL": "https://www.aol.com/finance/real-nightmare-scenario-nvidias-china-110011697.html", "Scrape_Time_Sec": 7.640388250350952}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-01-22T21:11:45+00:00", "News_Date_Formatted": "2026-01-22 21:11:45 (GMT+0)", "Period_Num": 1, "News_Title": "Stock market today: Dow, S&P 500, Nasdaq rise for second day in a row as Greenland drama fades", "News_Source": "YAHOO", "News_Content": "Stock market today: Dow, S&P 500, Nasdaq rise for second day in a row as Greenland drama fades\nRian Howlett\nand\nKaren Friar\nUpdated January 23, 2026 2 min read\nIn this article:\nStockStory Top Pick\nGE\n+2.69%\nMETA\n-2.95%\n^DJI\n-0.36%\n^IXIC\n-0.94%\n^GSPC\n-0.43%\nUS stocks rose on Thursday as investors breathed a continued sigh of relief that President Trump called off his threatened tariffs on European allies over his pursuit of Greenland.\nThe tech-heavy Nasdaq Composite (^IXIC) led the advance, rising nearly 0.9% as Tesla (TSLA) shares surged over robotaxi optimism. The blue-chip Dow Jones Industrial Average (^DJI) gained roughly 0.6%. Meanwhile, the benchmark S&P 500 (^GSPC) added 0.5% on the heels of Wall Street's sharp rally on Wednesday.\nGold (GC=F) also crossed $4,900 per ounce for the first time on Thursday, extending a string of record highs since the start of the year.\nNasdaq GIDS - Delayed Quote\n•\nUSD\nNASDAQ Composite (^IXIC)\nFollow\nView Quote Details\n23,461.82\n-223.30\n(-0.94%)\nAt close: January 30 at 5:15:59 PM EST\n^IXIC\n^DJI\n^GSPC\nAdvanced Chart\nStocks continued climbing after Trump hit pause on the 10% tariffs planned for eight NATO members in February, soothing the concerns that weighed on Wall Street earlier in the week. But investors remain on alert, as the EU and the US are still at odds over who will control Greenland.\nTrump said he had drawn up a \"framework of a future deal\" with NATO's leader for the Arctic island, which the US wants to purchase. But Denmark's prime minister stressed Thursday that the sovereignty of its territory is not up for discussion.\nBeyond trade and geopolitics, investors are bracing for Intel (INTC) to lead out Big Tech earnings when it reports quarterly results after the bell on Thursday. AI spending by the likes of Meta (META) and a global memory shortage will be in focus as the chipmaker attempts a turnaround. Procter & Gamble (PG) and GE Aerospace (GE) are among the crowd of companies also on the earnings docket.\nRead more: Live coverage of corporate earnings\nMeanwhile, a shutdown-delayed report on the Federal Reserve's preferred inflation gauge, the PCE price index, showed that consumer prices rose at a 2.8% annual pace in November. That inflation data, coupled with initial jobless claims, which increased only marginally, kept the Fed on course to hold rates steady at its next policy meeting.\nIn another economic reading, the US economy grew at the fastest pace in two years through the third quarter of 2025. GDP grew at an annual pace of 4.4% for the quarter in an upgrade from the government's first estimate.\nEven so, unemployment benefits claims ticked up to 200,000 for the week ended Jan. 17, up just slightly from the previous week's 199,000 filings, according to Labor Department data.\nLIVE COVERAGE IS OVER 22 updates\nFri, January 23, 2026 at 5:05 AM GMT+8\nInes Ferré\nStocks rise for second day in a row, gold crosses $4,900\nStocks rose for a second day in a row as the threat of an escalation over President Trump's pursuit of Greenland faded.\nThe S&P 500 (^GSPC) gained 0.5%, while the Dow Jones Industrial Average (^DJI) increased 0.6%.\nTesla (TSLA) shares took the tech-heavy Nasdaq Composite (^IXIC) higher after CEO Elon Musk said the company started robotaxi rides with no safety monitor present in Austin, a long-awaited move.\nThe move higher in stocks comes a day after President Trump announced a \"framework\" for a future deal for Greenland, and abandoned the threat of fresh tariffs against European nations.\nGold (GC=F) touched a fresh record high, surpassing $4,900 for the first time and extending momentum in the precious metals trade.\nCOMEX - Delayed Quote\n•\nUSD\nGold Apr 26 (GC=F)\nFollow\nView Quote Details\n5,067.50\n-287.30\n(-5.37%)\nAs of January 30 at 10:24:58 AM EST. Market Open.\nAdvanced Chart\nFri, January 23, 2026 at 4:02 AM GMT+8\nInes Ferré\nTesla stock pops as Elon Musk posts video claiming no safety monitor in Austin robotaxi\nTesla (TSLA) CEO Elon Musk said the company started robotaxi rides with no safety monitor present in the cars in Austin, a long awaited move. This comes after Waymo announced another expansion of its robotaxi service in the US, hammering home its lead in the autonomous space - for now.\nMusk also claimed on Thursday that he expects the company’s self driving service to get EU and China approval soon.\nTesla stock popped on the news in midday trade, up over 3%.\nNasdaqGS - Nasdaq Real Time Price\n•\nUSD\nTesla, Inc. (TSLA)\nFollow\nView Quote Details\n430.41\n+13.84\n(+3.32%)\nAt close: January 30 at 4:00:02 PM EST\n429.63\n-0.78\n(-0.18%)\nAfter hours: January 30 at 7:59:58 PM EST\nAdvanced Chart\nRead more here.\nFri, January 23, 2026 at 3:40 AM GMT+8\nInes Ferré\nAnalysts say a stock market double is a pipe dream without a rate-spiking GDP boom\nYahoo Finance's Francisco Velasquez reports:\nPresident Trump's call that the S&P 500 (^GSPC) will see another massive rally is starting to look fuzzy.\n\"If you get double the stock market, it really will reflect the ", "Content_Length": 28976, "Word_Count": 4754, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-for-second-day-in-a-row-as-greenland-drama-fades-210027669.html", "Scrape_Time_Sec": 11.049036741256714}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-01-17T23:24:11.354600+00:00", "News_Date_Formatted": "2026-01-17 23:24:11 (GMT+0)", "Period_Num": 2, "News_Title": "PDD Holdings Inc. (PDD) stock price, news, quote and history - Yahoo Finance", "News_Source": "YAHOO", "News_Content": "Summary\nNews\nChart\nStatistics\nHistorical data\nProfile\nFinancials\nAnalysis\nOptions\nHolders\nNasdaqGS - Nasdaq Real Time Price\n•\nUSD\nPDD Holdings Inc. (PDD)\nFollow\nAdd holdings\n101.05\n-1.65\n(-1.61%)\nAt close: 30 January at 4:00:01 pm GMT-5\n101.37\n+0.32\n(+0.32%)\nAfter hours: 30 January at 7:59:35 pm GMT-5\n1D\n5D\n1M\n6M\nYTD\n1Y\n5Y\nAll\nKey events\nMountain\nAdvanced chart\nLoading chart for PDD\nPrevious close\n102.70\nOpen\n102.47\nBid\n87.98 x 100\nAsk\n115.40 x 100\nDay's range\n101.03 - 102.76\n52-week range\n87.11 - 139.41\nVolume\n6,633,439\nAvg. Volume\n8,627,842\nMarket cap (intra-day)\n143.455B\nBeta (5Y monthly)\n0.01\nPE ratio (TTM)\n10.36\nEPS (TTM)\n9.75\nEarnings date\n18 Nov 2025\nForward dividend & yield\n--\nEx-dividend date\n--\n1y target est\n147.95\nPDD Holdings Inc. Overview Internet Retail / Consumer Cyclical\nRecent news: PDD\nView more\nAll\nNews\nPress releases\nSEC filings\nIs PDD Holdings (PDD) Pricing Reflect Its Role In Global E Commerce Trends\nSimply Wall St.\n•\n23 hr ago\nCiti Lowers PT on PDD Holdings to $142, Keeps Neutral Rating Ahead of Q4 2025 Earnings\nInsider Monkey\n•\n1 day ago\nChina Internet Regulation Poses New Risks for PDD Holdings (PDD)\nInsider Monkey\n•\n2 days ago\nPDD Holdings Inc. Sponsored ADR (PDD) Registers a Bigger Fall Than the Market: Important Facts to Note\nZacks\n•\n3 days ago\nIs PDD Holdings (PDD) One of the Most Profitable Cheap Stocks to Invest In?\nInsider Monkey\n•\n3 days ago\nPDD Holdings (PDD) Facing Regulatory Challenges, Here’s What You Need To Know\nInsider Monkey\n•\n6 days ago\nPDD Holdings (NASDAQ:PDD) shareholders have endured a 36% loss from investing in the stock five years ago\nSimply Wall St.\n•\n8 days ago\nPDD Shares Rise After Shanghai Tax Authority Issues Small Fine\nGuruFocus.com\n•\n10 days ago\nPDD Stock Pops After Smaller-Than-Expected China Tax Fine\nGuruFocus.com\n•\n11 days ago\nCan PDD (PDD) Turn Its Billion-Dollar Supermarket Bet Into Lasting Competitive Advantage?\nSimply Wall St.\n•\n16 days ago\nAssessing PDD Holdings (PDD) Valuation After Recent Share Price Weakness\nSimply Wall St.\n•\n16 days ago\nPerformance overview: PDD\nTrailing total returns as of 01/02/2026, which may include dividends or other distributions. Benchmark is\nMSCI WORLD (^990100-USD-STRD)\n.\nYTD return\nPDD\n11.23%\nMSCI WORLD (^990100-USD-STRD)\n2.19%\n1-year return\nPDD\n9.70%\nMSCI WORLD (^990100-USD-STRD)\n18.01%\n3-year return\nPDD\n3.13%\nMSCI WORLD (^990100-USD-STRD)\n61.13%\n5-year return\nPDD\n39.02%\nMSCI WORLD (^990100-USD-STRD)\n67.82%\nEarnings trends: PDD\nView more\nEarnings per share\nGAAP\nNormalised\nQ3 FY25\nEstimate\n+16.57\nActual\n+21.08\n  Revenue vs. Earnings\nAnnual\nQuarterly\nQ3 FY25\nRevenue\n108.28B\nEarnings\n31.38B\nQ4\nFY24\nQ1\nFY25\nQ2\nFY25\nQ3\nFY25\n0\n20B\n40B\n60B\n80B\n100B\n  Analyst insights: PDD\nView more\nAnalysts' price targets\n118.11\n147.95\nAverage\n101.05\nCurrent\n202.71\nHigh\n  Analyst recommendations\nStrong buy\nBuy\nHold\nUnderperform\nSell\n  Latest rating\nDate\n06/01/2026\nAnalyst\nFreedom Capital Markets\nRating action\nMaintains\nRating\nBuy\nPrice action\nRaises\nPrice target\n140 -> 170\n  Statistics: PDD\nView more\nValuation measures\nAs of 29/01/2026\nMarket cap\n145.80B\nEnterprise value\n86.40B\nTrailing P/E\n10.36\nForward P/E\n8.17\nPEG ratio (5-yr expected)\n1.09\nPrice/sales (ttm)\n2.53\nPrice/book (mrq)\n2.59\nEnterprise value/revenue\n1.44\nEnterprise value/EBITDA\n5.15\nFinancial highlights\nProfitability and income statement\nProfit margin\n24.44%\nReturn on assets (ttm)\n10.70%\nReturn on equity (ttm)\n30.53%\nRevenue (ttm)\n418.54B\nNet income avi to common (ttm)\n102.27B\nDiluted EPS (ttm)\n9.75\nBalance sheet and cash flow\nTotal cash (mrq)\n423.77B\nTotal debt/equity (mrq)\n2.73%\nLevered free cash flow (ttm)\n87.45B\nCompare to: PDD\nCompare\nSelect to analyse similar companies using key performance metrics; select up to four stocks.\nPDD\nPDD Holdings Inc.\n101.05\n-1.61%\nMkt cap\n143.455B\nIndustry\nInternet Retail\nJD\nJD.com, Inc.\n28.48\n-2.03%\nMkt cap\n42.02B\nIndustry\nInternet Retail\nBABA\nAlibaba Group Holding Limited\n169.56\n-2.70%\nMkt cap\n404.795B\nIndustry\nInternet Retail\nSE\nSea Limited\n116.49\n-4.38%\nMkt cap\n68.964B\nIndustry\nInternet Retail\n9988.HK\nAlibaba Group Holding Limited\n169.200\n-2.37%\nMkt cap\nHKD 3.231T\nIndustry\nInternet Retail\n9618.HK\nJD.com, Inc.\n112.400\n-1.92%\nMkt cap\nHKD 346.902B\nIndustry\nInternet Retail\nMELI\nMercadoLibre, Inc.\n2,147.79\n-3.17%\nMkt cap\n108.887B\nIndustry\nInternet Retail\nCPNG\nCoupang, Inc.\n20.16\n+0.85%\nMkt cap\n36.825B\nIndustry\nInternet Retail\nETSY\nEtsy, Inc.\n52.96\n-3.53%\nMkt cap\n5.249B\nIndustry\nInternet Retail\n3690.HK\nMeituan\n97.200\n-1.42%\nMkt cap\nHKD 593.588B\nIndustry\nInternet Retail\nDASH\nDoorDash, Inc.\n204.62\n-1.47%\nMkt cap\n88.191B\nIndustry\nInternet Retail\nPeople also watch\nJD\nJD.com, Inc.\n28.48\n-2.03%\n  BILI\nBilibili Inc.\n34.04\n-3.95%\n  TCEHY\nTencent Holdings Limited\n77.80\n-1.94%\n  BIDU\nBaidu, Inc.\n153.18\n-2.75%\n  LI\nLi Auto Inc.\n16.63\n-3.65%\n  Copyright © 2026 Yahoo. All rights reserved.\nWhat's trending\nStraits Times Index\nNikkei\nHang Seng\nFTSE 100\nBitcoin USD\nTSLA\nSingapore markets closed\nSingapore\nUS\nEurope\nAsia\nCryptocurrencies\nRates\nCommodities\nCurr", "Content_Length": 6607, "Word_Count": 1004, "Image_URLs": ["https://s.yimg.com/uu/api/res/1.2/2oJWdLIMNsTYSEj03rOCsQ--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/simply_wall_st__316/f6c14537c0beea11607d8ec4c0aa1ba9.cf.webp", "https://s.yimg.com/uu/api/res/1.2/tBP4cUoBcAJ6spfc.Jfghg--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/insidermonkey.com/e52765a80aeb2acd0228845e915d4014.cf.webp", "https://s.yimg.com/uu/api/res/1.2/lM1EP0JArerAtEEsrnPPFw--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/insidermonkey.com/47be962cc8f92f3e216b86894966883e.cf.webp", "https://s.yimg.com/uu/api/res/1.2/.DKVuA0XvgbF8emaKjOd9g--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/zacks.com/a41b81fe729c761f3f94f42ff348f70c.cf.webp", "https://s.yimg.com/uu/api/res/1.2/XtcO0mjQ4bQnXwxuSCrkIw--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/insidermonkey.com/f4f53796b363b584a6e7bbde40599dc0.cf.webp", "https://s.yimg.com/uu/api/res/1.2/gtSM3Ez5Bp42GUA9UQ4ctg--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/insidermonkey.com/d8388374fca298e56a451b3ddd0d83e2.cf.webp", "https://s.yimg.com/uu/api/res/1.2/Y5x_0DrorfphyYEkj21GYA--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/us.finance.gurufocus/cbdfec544d469f13bc2b6056a3f86d8b.cf.webp", "https://s.yimg.com/uu/api/res/1.2/yD05Mkg2TeATAOmM6ujrUQ--~B/Zmk9ZmlsbDtoPTYzO3B5b2ZmPTA7dz04NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/us.finance.gurufocus/345307866a0a6e2567a8981d1fb7ec5c.cf.webp"], "News_URL": "https://sg.finance.yahoo.com/quote/PDD/", "Scrape_Time_Sec": 5.206727981567383}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-01-15T04:27:59+00:00", "News_Date_Formatted": "2026-01-15 04:27:59 (GMT+0)", "Period_Num": 2, "News_Title": "Alibaba Takes Major Step to Link Shopping to Main AI App", "News_Source": "YAHOO", "News_Content": "Alibaba Takes Major Step to Link Shopping to Main AI App\nLuz Ding\nJanuary 15, 2026 4 min read\nIn this article:\nStockStory Top Pick\nNVDA\n-0.72%\nMETA\n-2.95%\nMSFT\n-0.74%\nBABA\n-2.70%\nBABAF\n+1.92%\n(Bloomberg) — Alibaba Group Holding Ltd. (BABA, 9988.HK) plans to link its flagship online shopping and travel services to its AI app, taking its biggest step yet to build Qwen into its one-stop artificial intelligence platform for consumers.\nChina’s online retail leader aims to connect Taobao, Alipay, travel service Fliggy and Amap to the Qwen app starting Thursday. The idea is to eventually help Qwen’s 100 million users shop, book travel and pay for services via a single platform with the help of AI. The newly integrated functions are now available for public testing in China.\nMost Read from Bloomberg\nWhy the Renovation of Federal Reserve Headquarters Costs $2.5 Billion\nE-Bike Boosters Ask: Is It All Downhill From Here?\nHochul Eyes Jamaica Station Revamp and Subway Link Across Harlem\nFormer New York City Housing Liaison Charged With Taking Bribes\nThe Latest Brand of Tech City Dreams: Virtual Residents\nThe ambitious undertaking underscores how companies from Amazon.com Inc. (AMZN) to Meta Platforms Inc. (META) are exploring agentic AI, where artificial intelligence helps people perform actual tasks. Companies like Alibaba and Tencent Holdings Ltd. (0700.HK, TCEHY), which already operate “super apps” with hundreds of different services, are considered to have an initial advantage in that sphere.\nAlibaba, which also operates a Netflix-like streaming service and one of China’s biggest meal delivery platforms, launched Qwen in November as a major step into consumer-facing AI services. It plans to build Qwen into an all-around personal assistant by gradually integrating individual services under the Alibaba umbrella. The company also launched an invite-only “task assistant” feature designed to conduct more complicated tasks, such as making phone calls to restaurants or building web applications.\nA livestreaming session by Dong Dong, a virtual idol promoting the Beijing 2022 Winter Olympics, is seen on Alibaba's e-commerce app Taobao. REUTERS/Florence Lo/Illustration · REUTERS / Reuters\nIn doing so, it’s seeking to answer global concerns about the money-making potential of AI. Investors are worried in particular about the hundreds of billions of dollars flowing into Nvidia-powered data centers around the world, given persistent uncertainty about demand for AI services in future.\nAlibaba’s shares fell as much as 3.5% in Hong Kong, after rising nearly 20% over the past four trading days. “This dip is simply profit-taking, a textbook ‘sell the fact’ after the rally, not a verdict on Qwen app’s latest update,” said Steven Leung, executive director at UOB Kay Hian Hong Kong.\nNYSE - Nasdaq Real Time Price\n•\nUSD\nAlibaba Group Holding Limited (BABA)\nFollow\nView Quote Details\n169.56\n-4.71\n(-2.70%)\nAt close: January 30 at 3:59:56 PM EST\n169.65\n+0.09\n(+0.05%)\nAfter hours: January 30 at 7:59:52 PM EST\nAdvanced Chart\nAlibaba is emphasizing the extent of its ambition by hooking Qwen up with Taobao: the service that launched the company into e-commerce decades ago and remains its main Chinese shopping showcase.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3297, "Word_Count": 517, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/.lNUWF2FIZ2ABlWXjoMWLQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYxMDtjZj13ZWJw/https://media.zenfs.com/en/bloomberg_holding_pen_162/480a275959a01bd5649965dbcbf71461"], "News_URL": "https://finance.yahoo.com/news/alibaba-takes-major-step-shopping-042759890.html", "Scrape_Time_Sec": 4.099337100982666}
