{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-28T00:00:00+00:00", "News_Date_Formatted": "2026-01-28 00:00:00 (GMT+0)", "Week_Num": 1, "News_Title": "BYD (SEHK:1211) Valuation Check As P/E Premium Contrasts With Cash Flow Upside Signals", "News_Source": "SIMPLYWALL", "News_Content": "Hong Kong\n/Auto\n/SEHK:1211\nBYD (SEHK:1211) Valuation Check As P/E Premium Contrasts With Cash Flow Upside Signals\nSimply Wall St\nJanuary 28, 2026\nRecent share performance and business scale\nWithout a clear single news catalyst, you might be looking at BYD (SEHK:1211) simply because its recent share performance and business size stand out among Hong Kong listed auto and battery groups.\nOver the past month, BYD shares have returned about 5.9%, while the past 3 months show a modest 1.3% decline. On a 1 year view, the total return figure provided is 14.2%.\nThe company reports revenue of CN¥841.1b and net income of CN¥38.3b. This reflects a large-scale operation across automobiles, batteries and related services. Annual revenue growth is given as 10.8%, with net income growth at 16.3%.\nAt the last close of HK$102.80, some valuation metrics in the data suggest a potential gap between market price and certain fair value estimates. However, these approaches depend heavily on the assumptions behind each model.\nSee our latest analysis for BYD.\nRecent trading points to rebuilding momentum, with a 1 day share price return of 4.6% and a 7 day share price return of 3.8%, set against a 1 year total shareholder return of 14.2% that reflects steadier long term gains.\nIf BYD has you thinking more broadly about the auto space, it could be a good time to see what else is on the move among auto manufacturers.\nSo with BYD trading at HK$102.80 alongside fair value and price target estimates that sit higher, is the current share price a genuine gap you can exploit, or is the market already factoring in future growth?\nPrice to earnings of 21.7x: Is it justified?\nOn the latest numbers, BYD trades on a P/E of 21.7x, while our fair value work points to a lower P/E of 13.8x and the shares sit below some cash flow based estimates such as the SWS DCF model fair value of HK$136 versus the last close at HK$102.80.\nThe P/E ratio compares the current share price with earnings per share and is a common way for investors to judge how much they are paying for each unit of profit. For a large auto and battery group like BYD, a higher P/E can reflect expectations for further earnings progress as well as the breadth of its businesses across vehicles, batteries and related services.\nHere, the 21.7x P/E sits above both the Asian auto industry average of 18.2x and a peer average of 8.3x. This suggests the market is assigning BYD a richer earnings tag than many regional and peer names. Compared with the estimated fair P/E of 13.8x, the gap is also wide. This highlights a level that the market could move towards if sentiment or earnings expectations change.\nExplore the SWS fair ratio for BYD\nResult: Price to earnings of 21.7x (OVERVALUED)\nHowever, you still need to watch for earnings expectations resetting if sentiment toward higher P/E auto names cools or if analyst price targets are revised lower.\nFind out about the key risks to this BYD narrative.\nAnother view: Cash flow says something different\nIf you put the earnings multiple to one side and look at our SWS DCF model, you get a different message. On this view, BYD at HK$102.80 sits about 24.4% below an estimated fair value of HK$136, which points to potential upside rather than stretch.\nThat gap matters because it shows how sensitive conclusions can be to the tool you use, and to the assumptions built into it. If profits or cash flows play out differently, could this apparent cushion shrink or widen from here?\nLook into how the SWS DCF model arrives at its fair value.\n1211 Discounted Cash Flow as at Jan 2026\nSimply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (check out BYD for example). We show the entire calculation in full. You can track the result in your watchlist or portfolio and be alerted when this changes, or use our stock screener to discover 876 undervalued stocks based on their cash flows. If you save a screener we even alert you when new companies match - so you never miss a potential opportunity.\nBuild Your Own BYD Narrative\nIf this view does not quite match your own read of the numbers, you can test the assumptions yourself and shape a personalised thesis in just a few minutes with Do it your way.\nA great starting point for your BYD research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\nLooking for more investment ideas?\nIf you stop with just one stock, you risk missing other opportunities that better suit your goals, so put a few minutes aside and scan fresh ideas now.\nSpot potential bargains early by checking out these 876 undervalued stocks based on cash flows that stand out on cash flow metrics and pricing.\nRide powerful tech trends by reviewing these 24 AI penny stocks that are tied to artificial intelligence themes.\nExplore income-focused ideas by scanning these 13 dividend stocks with yields > 3% that offer yields above 3%.\nThis article by Simply Wall St is general in ", "Content_Length": 6908, "Word_Count": 1154, "Image_URLs": ["https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/dcf", "https://images.ctfassets.net/n07nr2koi959/220TWz80MMu5IKd31MX2Mh/5baf073475c70362f71c7471b9e72a3c/portrait.jpg?fit=thumb&w=64&h=64", "https://images.ctfassets.net/n07nr2koi959/51SSiWSLQ6bnbhvLt2LrUO/204581c61a830f0e0500f0816d54ddf6/IMG_8661.jpg?fit=thumb&w=64&h=64", "https://media.simplywall.st/news/1721008721705-Timo-profile-picutre.jpg", "https://media.simplywall.st/news/1732588370521-bullish.png"], "News_URL": "https://simplywall.st/stocks/hk/automobiles/hkg-1211/byd-shares/news/byd-sehk1211-valuation-check-as-pe-premium-contrasts-with-ca/amp", "Scrape_Time_Sec": 2.454080104827881}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-29T21:39:04.007000+00:00", "News_Date_Formatted": "2026-01-29 21:39:04 (GMT+0)", "Week_Num": 1, "News_Title": "BYD (1211 HK) Tactical Outlook: Taking Off?", "News_Source": "SMARTKARMA", "News_Content": "Dashboard\nDiscussions\nWatchlists\nCollections\nTools\nMore\n𝛼SK\nor Search\nSIGN UP\nSIGN IN\nBullish\nBYD\nWatchlist\nBYD (1211 HK) Tactical Outlook: Taking Off?\nEquity Derivatives\n190 Views30 Jan 2026 05:39\nAs indicated in previous insight at the end of December, BYD (1211 HK) seems to be bottoming and restarting its rally. Our short-term target is 106.4. The rally could continue after a small pullback.\nWHAT IS COVERED IN THE FULL INSIGHT:\nIntroduction\nMarket Reversal Matrix Overview\nQuantChart Analysis\nWeekly Support and Resistance Levels\nProfit Targets and Reversal Probability\nNico Rosti\nFollow\nMessage\nSUMMARY(Sign Up to Access)\nTry Now\nBegin exploring Smartkarma's AI-augmented investing intelligence platform with a complimentary Preview Pass to:\nUnlock research summaries\nFollow top, independent analysts\nReceive personalised alerts\nAccess Analytics, Events and more\nJoin 55,000+ investors, including top global asset managers overseeing $13+ trillion.\nUpgrade later to our paid plans for full-access.\nSMARTKARMA PREVIEW PASS\nSign Up with LinkedIn\nor\nFirst Name\nLast name\nEmail\nSign Up with Email\nBy signing up, you agree to our\nTerms of Use and Privacy Policy.\nAlready have an account? Sign In Now\nFULL INSIGHT\n(Paid Plans Only, 2-minute read)\nRELATED INSIGHTS\nMore »\nBYD (1211 HK) Tactical Outlook: Taking Off?\nQuiddity Leaderboard HSTECH Mar26: Final Ranks; US$840mn One-Way\nHSTECH Index Rebalance Preview: Changes If Index Universe Is Expanded\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\nTRENDING COLLECTIONS\nMore »\nEquity Bottom-Up\nEvent-Driven\nIndex Rebalance\nUnpaywalled Insights\nSingapore Value-Up\nSouth Korea\nJapan\nSmartkarma Company Primers\nGold\nPhilippines\nTRENDING INSIGHTS\nMore »\nPrimer: Modern Times Group MTG (MTGB SS) - Feb 2026\nOverview #48 — Gradually, Then Suddenly\nWeekly Deals Digest (01 Feb) - Toyota Ind, Mandom, Eastroc, Montage, Muyuan, Shin Etsu, Kandenko\nSBS Transit (SBUS SP | BUY | TP:S$3.92): Bussing for Dividends\nMakino Milling Machine (6135 JP): Twin Headwinds as Chinese and US Approvals Secured\nTOP UNPAYWALLED INSIGHTS\nMore »\nCurator's Cut: Going Private, Getting Active & Reviewing Public Market Premieres\nOverview #48 — Gradually, Then Suddenly\nSlight Gain in Governance, ROE and Valuations in 2025 Suggest that Reforms Have yet to Spread Widely\nBangladesh: VEON’s Next Billion-Dollar Fintech Opportunity\nOverview #47 – Are We There Yet?\nDISCUSSIONS\n(Paid Plans Only)\nPrice Chart(Sign Up to Access)\nSmartkarma SmartScore\n3.6/5\nRelative to stocks in the same:\nCountry & Sector\nValue\n3\nDividend\n4\nGrowth\n5\nResilience\n3\nMomentum\n3\n1\n2\n3\n4\n5\nSentiment\nView SmartScore Screener »\nInsight Stream\nBYD (1211 HK) Tactical Outlook: Taking Off?\n30 Jan 2026\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\n30 Dec 2025\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\n16 Dec 2025\nRelated Entities\nBYD (1211 HK)\nExpand All\nCollapse All\nTop\nSOLUTIONS\nFor Institutional Investors and Financial Services\nFor Corporate IR and Strategy\nFor Private Wealth Intermediaries\nPricing\nHow Smartkarma Compares\nABOUT\nWho We Are\nCareers\nFAQs\nResearch Provider Solutions\nSyndicate your Publications\nLEGAL\nCompliance\nTerms of Use\nPrivacy Policy\nPress Kit\nRSS Feeds\nCONTACT\nRequest a Free Trial\nAvail a Transition Account\nGuest Posts on Smartkarma\nOther Enquiries\nJoin TL;DR Community\nFree Weekly Newsletters\nDOWNLOAD\nCopyright © 2022 Smartkarma Innovations Pte Ltd. All Rights Reserved. v3.63.2", "Content_Length": 3536, "Word_Count": 547, "Image_URLs": ["https://www.smartkarma.com/_next/image?url=https%3A%2F%2Fstatic-prod.smartkarma.com%2Faccounts%2Fprofile_photos%2F000%2F049%2F555%2Fsmall%2Fdata%3F1685106429&w=96&q=75"], "News_URL": "https://www.smartkarma.com/insights/byd-1211-hk-tactical-outlook-taking-off?utm_medium=feed&utm_source=RSS", "Scrape_Time_Sec": 3.94058895111084}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-22T00:00:00+00:00", "News_Date_Formatted": "2026-01-22 00:00:00 (GMT+0)", "Week_Num": 2, "News_Title": "BYD Argentina Shipment Highlights Policy Driven Growth And Investor Watchpoints", "News_Source": "SIMPLYWALL", "News_Content": "Hong Kong/Auto/SEHK:1211\nBYD Argentina Shipment Highlights Policy Driven Growth And Investor Watchpoints\nJanuary 22, 2026\nSimply Wall St\nReviewed by Bailey Pemberton\nShare\nCopy Link\nBYD has shipped over 5,800 electric and hybrid vehicles to Argentina under newly relaxed trade rules.\nThe shipment is enabled by tariff free quotas for electric vehicles introduced by the Milei administration.\nThis move expands BYD's presence in Latin America and adds pressure on Western and Japanese competitors.\nFor investors tracking BYD (SEHK:1211), this Argentina move comes with the stock trading at HK$99.05 and a 3 year return of 35.4%. Over 1 year, the shares are up 8.6%, with a 5.7% return over 30 days. Together, those medium term and shorter term figures provide context for how the market has been pricing BYD's global push.\nThe tariff free window in Argentina lowers one hurdle for BYD's export plans and may influence how other Latin American markets think about electric vehicle trade policy. As you assess BYD, this type of policy driven opening can be a useful reference point for how sensitive expansion efforts may be to government decisions in key regions.\nStay updated on the most important news stories for BYD by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on BYD.\nSEHK:1211 1-Year Stock Price Chart\nWhy BYD could be great value\nShipping over 5,800 vehicles into Argentina under tariff free quotas suggests that BYD is leaning into markets where policy is currently supportive. For you as an investor, this points to management using its export capacity and cost position to build volume outside China, in a region where Western and Japanese brands have traditionally had a strong foothold.\nAdvertisement\nDiscover more\nVehicles\nvehicles\nvehicle\nBYD narrative watch: how this Argentina move fits the story\nThis development supports an existing narrative of BYD as a cost leader that competes on accessible pricing rather than premium margins, and investors focused on that angle may see Latin America as a logical extension of that approach. At the same time, the push into Argentina adds another example for those tracking how BYD balances volume growth with efforts to build higher end brands and software features.\nRisks and rewards to keep in mind\nAccess to tariff free quotas in Argentina can support export volumes and improve factory utilization.\nBYD has been gaining attention globally for undercutting rivals on price, which may help it win share in price sensitive markets.\nThe company has a high level of non cash earnings, which analysts flag as a key risk when assessing earnings quality.\nReliance on favorable trade policy in specific countries can leave export driven growth exposed if those rules change.\nWhat to watch next\nFrom here, it is worth watching whether this Argentina opening turns into repeat orders, local partnerships or broader Latin American adoption, as that would say more about the durability of BYD's international push than a single shipment. You can keep an eye on how different investors interpret moves like this by checking out the evolving community narratives in our community section.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nValuation is complex, but we're here to simplify it.\nDiscover if BYD might be undervalued or overvalued with our detailed analysis, featuring fair value estimates, potential risks, dividends, insider trades, and its financial condition.\nAccess Free Analysis\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\nAbout SEHK:1211\nBYD\nEngages in automobiles and batteries business in the People’s Republic of China, Hong Kong, Macau, Taiwan, and internationally.\nExcellent balance sheet with moderate growth potential.\nSee The Free Research Report\nSimilar Companies\nNasdaqGS:TSLA\nTesla\nKOSE:A005930\nSamsung Electronics\nMarket Insights\nHow to invest when commodity prices get messy ⚖️\nRichard Bowman\nWhy Didn’t Oil React to Venezuela? 🇻🇪\nStella Ong\nWhich Markets Will Sink or Swim in 2026? 🌍\nRichard Bowman\nAdvertisement\nDiscover more\nSimply Wall\nCar\nVehicle\nWeekly Picks\nJolt_Communications on Myseum · 9 days ago\nThe Future of Social Sharing Is Private and People Are Ready\nFair Value:\nUS$7.95\n75.3% undervalued\n6\nusers have followed this narrative\n0\nusers have commented on this narrative\n0\nusers have liked t", "Content_Length": 8341, "Word_Count": 1348, "Image_URLs": ["https://images.ctfassets.net/n07nr2koi959/6YVpCWgrk0c9DenG6UgW8m/d79e37d527c71a95e08b9ce1071ba986/Image_from_iOS.jpg?fit=thumb&w=64&h=64", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/quote-price", "https://images.ctfassets.net/n07nr2koi959/220TWz80MMu5IKd31MX2Mh/5baf073475c70362f71c7471b9e72a3c/portrait.jpg?fit=thumb&w=64&h=64", "https://images.ctfassets.net/n07nr2koi959/51SSiWSLQ6bnbhvLt2LrUO/204581c61a830f0e0500f0816d54ddf6/IMG_8661.jpg?fit=thumb&w=64&h=64", "https://media.simplywall.st/news/1721008721705-Timo-profile-picutre.jpg", "https://media.simplywall.st/news/1732588370521-bullish.png", "https://media.simplywall.st/news/1732588370134-santa.png", "https://images.simplywall.st/asset/user/6236d9ff.1744096362358.09df9a35fe37bf47.jpg"], "News_URL": "https://simplywall.st/stocks/hk/automobiles/hkg-1211/byd-shares/news/byd-argentina-shipment-highlights-policy-driven-growth-and-i", "Scrape_Time_Sec": 2.826763391494751}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-21T04:19:08+00:00", "News_Date_Formatted": "2026-01-21 04:19:08 (GMT+0)", "Week_Num": 2, "News_Title": "China prunes export incentives, as BYD takes global NEV crown", "News_Source": "THEBAMBOOW", "News_Content": "China prunes export incentives, as BYD takes global NEV crown\nJanuary 21, 2026\n1211.HK\nFollow\n“Once companies start resorting to special accounting and financial tricks, you have to wonder, is there something else that we haven’t seen yet.”\nRene Vanguestaine\nKey takeaways:\nBeijing’s decision to scrap or lower export tax rebates for solar and battery makers is likely a move to boost government revenue and force industry consolidation\nBYD has surpassed Tesla in unit sales volume but faces scrutiny over high debt ratios disguised by complex financial instruments\nBy Doug Young and Rene Vanguestaine\nIn the fast-moving world of China’s new energy sector, two major narratives have collided this month: a significant pullback in state support for some exporters and a changing of the guard at the top of the global sales charts for new energy vehicles (NEVs). On the policy front, Beijing has announced major tweaks to its value-added tax refunds for exports, specifically targeting solar products and electric vehicle (EV) batteries. Simultaneously, domestic giant BYD(1211.HK) has officially overtaken Tesla (TSLA.US) to become the world’s top NEV seller. Both stories signal maturing markets where government guardrails are shifting, and financial transparency is becoming paramount.\nWe begin with the policy reversal, which has dominated headlines. China has completely scrapped export tax rebates for solar energy products and lowered the rate for EV batteries to 6% from the previous 9%. The State Council cited a desire to “restore rational pricing” and reduce trade frictions. However, we believe one must read between the lines when decoding government communication.\nHistorically, China has not been particularly concerned with the impact of its manufacturers on foreign markets, where cheap prices have often eliminated competition in sectors ranging from solar panels to EVs. We suspect the primary motivation here is domestic. The Chinese government is seeking to boost tax revenues — or at least reduce expenses — by cutting off incentives that are no longer necessary. With Chinese companies manufacturing roughly 80% of the world’s solar panels, the industry is robust enough to survive without this specific lifeline.\nFurthermore, this move appears to be an effort to end the “irrational price competition” that has plagued the sector. For months, manufacturers have engaged in cutthroat price wars, often selling products at a loss. By removing these rebates, Beijing may be forcing companies to raise prices and return to profitability, thereby stabilizing employment and tax revenue. While this might conveniently address some complaints from Europe and the U.S. regarding unfair competition, we remain skeptical that it will fully appease Western governments, as other local and provincial subsidies still likely remain in place.\nA volume victory with accounting caveats\nTurning to the corporate battlefield, BYD reached a historic milestone in 2025, selling 2.26 million NEVs to beat Tesla’s 1.6 million. This victory was driven by a staggering 145% growth in overseas sales for BYD, while Tesla saw an 8.6% overall sales decline. However, we think investors should look past the headline numbers to understand the nuance of this achievement.\nBYD’s success is built squarely on the lower end of the market, offering price points — such as $8,000 vehicles — that Western competitors can’t match due to production costs. This is a different business strategy compared to Tesla’s focus on the mid- to upper-end of the market. But of greater concern to us is the financial engineering underpinning BYD’s rise.\nWhile the company reports being profitable, it has relied on an internal “IOU system” to delay payments to suppliers, sometimes for up to eight or nine months. If these financial instruments are factored in, BYD’s debt ratio balloons to nearly 100%, significantly higher than the reported 71%. We note that Warren Buffett’s Berkshire Hathaway, a long-time backer, sold its remaining stake last year. Given Buffett’s penchant for scrutinizing financial filings, his exit suggests he may have spotted these risks early.\nIt is telling that the Chinese government has ordered BYD to dismantle this IOU system, granting it a two-year window to clean up the mess — a timeline that suggests fears of what a sudden correction might trigger. This brings us back to the core concern: when companies create their own financial instruments to manage their balance sheets too aggressively, it destroys investor trust.\nHistory offers grim precedents, from Enron and Wirecard to the more recent collapse of Evergrande. In all these cases, the initial lack of transparency was a precursor to deeper structural failures. If BYD is indeed hiding the true state of its financial health behind these payment delays, the risk to investors is substantial. For those who do not have an appetite for such uncertainty, we believe the prudent move is to stay away and wait to see how this accounti", "Content_Length": 7550, "Word_Count": 1176, "Image_URLs": [], "News_URL": "https://thebambooworks.com/china-prunes-export-incentives-as-byd-takes-global-nev-crown-solar/", "Scrape_Time_Sec": 4.184819936752319}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-17T20:23:03+00:00", "News_Date_Formatted": "2026-01-17 20:23:03 (GMT+0)", "Week_Num": 3, "News_Title": "1211.HK Stock Today: January 17 BYD Rises on Ford Battery Talks", "News_Source": "MEYKA", "News_Content": "1211.HK Stock Today: January 17 BYD Rises on Ford Battery Talks\nGlobal Market Insights\n01/17/2026 8:23 PM\nby\nHuzaifa Zahoor\n5 mins read\nSummarize This Article Using AI\n1211.HK\n$97.75\n-3.98\nTable of Contents\nShares rise in Hong Kong on Ford battery talks\nWhat a Ford supply deal could mean\nWhy it matters for investors in Germany\nValuation, ratings, and key dates\nFinal Thoughts\nFAQs\nDisclaimer\nBYD stock moved higher today as reports of Ford battery talks lifted sentiment around hybrid battery supply. Shares of 1211.HK traded firmer in Hong Kong, with investors eyeing confirmation, regional scope outside the United States, and margin effects for BYD’s battery unit. For investors in Germany, the story matters because European demand for hybrids is steady and supply partnerships can shape cost curves. We outline price action, fundamentals, technicals, and the next catalysts to watch.\nShares rise in Hong Kong on Ford battery talks\nBYD’s Hong Kong line traded between HK$98.95 and HK$101.60 after opening at HK$101.00. The last price was HK$99.20, up 0.10% day on day and about 4.97% over five days. Volume was 20.6 million versus a 21.5 million average, signaling interest roughly in line with norms as headlines on Ford battery talks drove attention to Hong Kong shares.\nRSI at 45 signals neutral momentum, while the MACD histogram turned slightly positive. ADX at 12 points to a weak trend. Price sits near the upper Bollinger Band at 99.48, with ATR of 2.76 implying moderate daily swings. Keltner resistance is near 101.69. Traders will watch 96.16 as a support pivot and 101.60 to 102.00 as the immediate resistance zone.\nWhat a Ford supply deal could mean\nSupplying hybrid packs would expand BYD’s external battery revenue and improve factory utilization. Hybrids use smaller packs than full EVs, yet ship in large volumes, which can stabilize orders. BYD’s gross margin is 17.6% and net margin 4.55%. Any deal would likely be price sensitive, so margin uplift depends on scale, chemistry choice, and logistics terms negotiated with Ford.\nReports suggest talks are ongoing and could focus on markets outside the United States. Investors want clarity on model coverage, start dates, and regions. For now, headlines are supportive but not definitive. See coverage at Investing.com and electrive.net. Confirmation, pricing, and volume commitments are the key share price catalysts.\nWhy it matters for investors in Germany\nHybrids remain popular in Europe as buyers seek lower fuel use without full charging dependence. If Ford sources packs from BYD for hybrid models sold in Europe, component scale could lower costs and support availability. That would strengthen the narrative around BYD stock as a supplier benefiting from steady hybrid demand alongside its own vehicle sales.\nGerman investors typically trade in euro while the primary line is in Hong Kong dollars. This adds FX risk and a time zone gap. Consider order types around Hong Kong hours, check broker access to the Hong Kong listing, and track liquidity. Taxes and fees vary by broker, so compare total costs before building positions in BYD stock.\nValuation, ratings, and key dates\nBYD trades at a TTM P/E near 20.7, price-to-sales of about 0.97, and price-to-book of 3.36. Dividend yield is roughly 1.46%. Return on equity stands at 17.5% with an interest coverage ratio near 19.7, indicating solid financing capacity. These metrics frame BYD stock as a growth-at-reasonable-multiple story within autos and battery supply.\nMeyka’s quantitative grade is B+ with a Buy suggestion, while the composite recommendation shows Neutral as of 16 January 2026. Next catalyst is earnings on 26 March 2026, where guidance and battery unit commentary matter. Watch for updates on Ford talks, regional scope, pricing, and hybrid volume assumptions, which can steer 2026 margin expectations.\nFinal Thoughts\nBYD stock is gaining on reports of Ford battery talks, with intraday strength, neutral-to-improving momentum, and resistance just above HK$101. A supply agreement for hybrid packs could broaden external revenue and improve utilization, though pricing will drive margin outcomes. For German investors, the angle is clear: hybrids in Europe are steady, and scale partnerships can shape cost and availability. Focus on confirmation, regions covered, start dates, and per-pack economics. Monitor technical levels around 96 and 102, plus earnings on 26 March for guidance on the battery business. Size positions thoughtfully, account for FX and trading hours, and reassess if headlines fail to convert into contracted volumes.\nFAQs\nIs the Ford deal with BYD confirmed?\nNo. Media reports indicate ongoing talks, not a signed agreement. Investors should watch for official announcements detailing which hybrid models, regions outside the United States, start dates, and pricing. Confirmation with volume commitments would be the next major catalyst for BYD stock and could shift analyst expectations.\nHow could a Ford deal affect BYD’s m", "Content_Length": 6254, "Word_Count": 979, "Image_URLs": ["https://meyka.com/_next/image/?url=https%3A%2F%2Fflagcdn.com%2Fw80%2Fus.png&w=128&q=60", "https://meyka.com/_next/image/?url=%2Fandroid-chrome-192x192.png&w=64&q=50"], "News_URL": "https://meyka.com/blog/1211hk-stock-today-january-17-byd-rises-on-ford-battery-talks-1701/", "Scrape_Time_Sec": 3.0249176025390625}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-15T00:00:00+00:00", "News_Date_Formatted": "2026-01-15 00:00:00 (GMT+0)", "Week_Num": 3, "News_Title": "Is BYD (SEHK:1211) Still Attractive After Recent Share Price Gains?", "News_Source": "SIMPLYWALL", "News_Content": "Hong Kong/Auto/SEHK:1211\nIs BYD (SEHK:1211) Still Attractive After Recent Share Price Gains?\nSimply Wall St\nReviewed by Bailey Pemberton\nJanuary 15, 2026\nShare\nCopy Link\nIf you are trying to work out whether BYD at HK$97.60 is a bargain or already fully priced, the starting point is to understand how its current share price lines up against a few different valuation checks.\nThe stock has returned 2.4% over the last week, 1.7% over the last month, with a year to date decline of 1.2% and a 14.4% return over the last year. This naturally raises questions about what is already priced in and what might still be on the table.\nRecent coverage around the electric vehicle and battery sector more broadly has kept attention on BYD, especially as investors compare established players with newer peers in the space. This backdrop helps frame the recent price moves and explains why sentiment around the stock can shift quickly.\nRight now, BYD has a valuation score of 2 out of 6, meaning it screens as undervalued on 2 of 6 checks. In the next sections we will look at how different valuation approaches arrive at that, before circling back to an even more practical way to think about the company’s value.\nBYD scores just 2/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nAdvertisement\nDiscover more\nNYSE\nSimply Wall Street\nNew York Stock Exchange\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow, or DCF, model estimates what a company might be worth by projecting its future cash flows and then discounting them back to today’s value. It is essentially asking what all those future CN¥ coming in are worth in today’s money.\nFor BYD, the model used is a 2 Stage Free Cash Flow to Equity approach. The latest twelve month free cash flow is a loss of about CN¥29.1b, so the starting point is currently negative. Analysts provide forecasts for several years, and Simply Wall St then extrapolates beyond that. The ten year projections range from about CN¥61.2b in 2026 to CN¥124.8b in 2035, all expressed in future CN¥ terms before discounting.\nWhen all those projected cash flows are discounted back, the estimated intrinsic value comes out at CN¥135.37 per share. Compared with the current share price of HK$97.60, this DCF output implies the stock trades at a 27.9% discount to that intrinsic value, which screens as undervalued on this model.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 27.9%. Track this in your watchlist or portfolio, or discover 882 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable business, the P/E ratio is a useful way to think about value because it connects what you pay for each share with the earnings that support that price. As a rule of thumb, higher growth and lower perceived risk can justify a higher “normal” P/E, while slower growth or higher risk usually point to a lower one.\nBYD currently trades on a P/E of 20.74x. That sits above the Auto industry average of 18.62x and also above the average of its peer group at 8.67x, so on simple comparisons the shares look more expensive than many alternatives.\nSimply Wall St’s Fair Ratio for BYD is 13.89x. This is a proprietary estimate of what a reasonable P/E could be, based on factors such as the company’s earnings profile, industry, profit margins, market cap and risk characteristics. Because it adjusts for these company specific inputs, the Fair Ratio can be more informative than a plain comparison with industry or peer averages.\nComparing the current P/E of 20.74x with the Fair Ratio of 13.89x suggests BYD is trading above this model derived range.\nResult: OVERVALUED\nSEHK:1211 P/E Ratio as at Jan 2026\nP/E ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1441 companies where insiders are betting big on explosive growth.\nUpgrade Your Decision Making: Choose your BYD Narrative\nEarlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple way for you to put a clear story behind the numbers such as your fair value, and your expectations for BYD’s future revenue, earnings and margins.\nA Narrative is your own view of what BYD is, where it could go, and what that might mean in financial terms. It then connects that story to a forecast and finally to a fair value per share.\nOn Simply Wall St, Narratives sit in the Community page and are designed to be easy to use. They help you compare a Fair Value with the current price so you can decide for yourself whether BYD looks attractive or stretched on your assumptions.\nBecause Narratives update when new information such as news or earnings is added, your view of BYD can stay aligned with what is happening. For example, one investo", "Content_Length": 10453, "Word_Count": 1759, "Image_URLs": ["https://images.ctfassets.net/n07nr2koi959/6YVpCWgrk0c9DenG6UgW8m/d79e37d527c71a95e08b9ce1071ba986/Image_from_iOS.jpg?fit=thumb&w=64&h=64", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/dcf", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/pe-multiple-vs-industry", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/quote-price", "https://images.ctfassets.net/n07nr2koi959/51SSiWSLQ6bnbhvLt2LrUO/204581c61a830f0e0500f0816d54ddf6/IMG_8661.jpg?fit=thumb&w=64&h=64", "https://images.ctfassets.net/n07nr2koi959/220TWz80MMu5IKd31MX2Mh/5baf073475c70362f71c7471b9e72a3c/portrait.jpg?fit=thumb&w=64&h=64", "https://images.simplywall.st/asset/user/6ce83970.1752699810283.a08a5c2e44846abf.jpg", "https://media.simplywall.st/news/1732588370490-glasses.png", "https://images.simplywall.st/asset/user/aca53c9c.1768832792248.f9784f2d751d6315.png", "https://media.simplywall.st/news/1732588370521-bullish.png"], "News_URL": "https://simplywall.st/stocks/hk/automobiles/hkg-1211/byd-shares/news/is-byd-sehk1211-still-attractive-after-recent-share-price-ga", "Scrape_Time_Sec": 1.8851563930511475}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-11T22:55:15.564370+00:00", "News_Date_Formatted": "2026-01-11 22:55:15 (GMT+0)", "Week_Num": 4, "News_Title": "Hang Seng Index drops on Wednesday", "News_Source": "THESTANDAR", "News_Content": "News\nComment\nBusiness & Innovation\nProperty\nRacing\nEducation\nArts & Lifestyle\nEntertainment\nMore\nePaper\nBUSINESS & INNOVATION\nMARKET\nHang Seng Index drops on Wednesday\nMARKET\n07-01-2026 16:47 HKT\nHong Kong stocks fell at the close on Wednesday. \nThe benchmark Hang Seng Index declined by 251 points, or 0.94 percent, to 26,710 points.\nThe market turnover also slid to HK$276 billion. \nThe Hang Seng Tech Index dropped by 1.5 percent to 5,738 points.\nShares of Alibaba (9988) and BYD (1211) both plunged over 3 percent.\nIn the mainland, the Shanghai Stock Exchange Composite Index was flat at 4,085 points and the Shenzhen Stock Exchange Component Index was also muted at 14,030 points.\n stocks\nHong Kong\nHang Seng Index\nHSI\nDownload The Standard app to stay informed with news, updates, and significant events:\nhttps://www.thestandard.com.hk/appdownload\n  by Taboola\nYou May Like\n2025年黃金大漲！聰明人早就進場了\nIC Markets\n|\nSponsored\n了解更多\nPhilippine beauty queen found naked and dead at sea, surveillance footage reveals street kidnapping\nThey Were So Beautiful Before; Now Look At Them; Number 10 Will Shock You.\nGames Waka\n|\nSponsored\nTop News\nEx-chief secretary Rafael Hui dies at 77 due to health issues\nBREAKING NEWS\n40 mins ago\nRosanna Law anticipates over 50 million visitors in 2026, optimistic about Chinese New Year tourism\nHONG KONG NEWS\n7 hours ago\nHK to expand youth access to global internships and conferences, Alice Mak says\nHONG KONG NEWS\n4 hours ago\nHundreds flock to On King Street Park as cherry blossoms reach full bloom\nHONG KONG NEWS\n5 hours ago\nPolice probe over 70 new traffic-related frauds, with a claimant reporting 'neck injuries' 20 times\nHONG KONG NEWS\n8 hours ago\nMarius Hoiby, the 'almost royal' tarnishing Norway's crown\nWORLD NEWS\n7 hours ago\nRead More\nCathay Pacific HK-bound flight makes emergency return to Kaohsiung after suspected engine oil leak\nHONG KONG NEWS\n3 hours ago\nHong Kong's public finance, retail sales improving, Paul Chan says\nMARKET\n4 hours ago\nWall St slips after Trump picks Fed critic Warsh to succeed Powell\nMARKET\n30-01-2026 23:31 HKT\nUS stock index futures cut losses after Trump nominates Kevin Warsh as next Fed Chair\nMARKET\n30-01-2026 20:13 HKT\nOne in three HK citizens to be seniors by 2039, signaling senior living demand - report\nHK PROPERTIES\n30-01-2026 20:01 HKT\nHong Kong's potential new private home supply rises to 3-quarter high in December\nHK PROPERTIES\n30-01-2026 18:22 HKT\nHong Kong's government posts HK$43.9b surplus for nine months ended December\nMARKET\n30-01-2026 17:16 HKT\nHong Kong GDP expands 3.5pc in 2025, beats estimate\nMARKET\n30-01-2026 17:06 HKT\nHang Seng Index loses 580 points at close\nMARKET\n30-01-2026 16:35 HKT\nGovt backs media innovation as AI transforms Hong Kong journalism\nHONG KONG NEWS\n30-01-2026 13:24 HKT\nNew seatbelt law applies only to buses registered after Jan 25, says Doreen Kong\nHONG KONG NEWS\n30-01-2026 16:30 HKT\nGovt to suspend mandatory bus seatbelt rule due to legal flaw\nHONG KONG NEWS\n30-01-2026 18:00 HKT\nRobber had precise cash route Info; reporting victim arrested as accomplice in Sheung Wan 51m yen robbery\nHONG KONG NEWS\n31-01-2026 19:29 HKT\n2025 年最紓壓的農場遊戲！無需安裝\n東加：島嶼農場\n|\nSponsored\n立即播放\nMissing Hong Kong investment boss found in Pok Fu Lam Reservoir after four-day ordeal\n五年來黃金投資最佳時機，就是現在！\nIC Markets\n|\nSponsored\n了解更多\n20-year-old woman found on Cambodia streets after being lured by ‘high-paying job,’ Chinese embassy says\nBuy The Dip: 2 Of The Best Undervalued 8%-10% Yields I've Seen\nSeeking Alpha\n|\nSponsored\nRead More\nBrooklyn Beckham's wife reportedly receives $1m monthly allowance from billionaire father\nTop 10 Stocks for 2026\nSeeking Alpha\n|\nSponsored\nRead More\nTai Sang Bank chairman caught having an affair with Internet celebrity\n  by Taboola\nContact Us\nAbout Us\nTerms of Use\nPrivacy Policy Statement\nCopyright Policy & License\nEthics Statement\n|\nSubscriptions\nPrint Advertising\nDigital Advertising\nStreet Points\nCopyright © 2026 The Standard - A division of Sing Tao News Corporation Limited. All rights reserved.", "Content_Length": 4036, "Word_Count": 647, "Image_URLs": ["https://www.thestandard.com.hk/_next/static/media/more_arrow_bt.671f0812.png", "https://www.thestandard.com.hk/_next/static/media/Flippingbook.297281dc.png", "https://www.thestandard.com.hk/_next/static/media/Search_white.425b07fe.png", "https://www.thestandard.com.hk/_next/static/media/menu_youtube.454d42d0.png", "https://www.thestandard.com.hk/_next/static/media/menu_flipping_version.1237fa95.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_increase.f9ae48f6.png"], "News_URL": "https://www.thestandard.com.hk/market/article/320993/Hang-Seng-Index-drops-on-Wednesday", "Scrape_Time_Sec": 5.004093170166016}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-09T18:15:24+00:00", "News_Date_Formatted": "2026-01-09 18:15:24 (GMT+0)", "Week_Num": 4, "News_Title": "Is BYD (SEHK:1211) Price Missing The Mark After Recent EV Demand Headlines", "News_Source": "YAHOO", "News_Content": "Is BYD (SEHK:1211) Price Missing The Mark After Recent EV Demand Headlines\nSimply Wall St\nJanuary 10, 2026 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nWondering whether BYD’s current share price actually lines up with its underlying worth, or if the market is missing something you can use to your advantage.\nBYD shares closed at HK$94.55, with a 7 day return of a 4.3% decline and a 30 day return of a 3.3% decline, while the 1 year return stands at 14.1% and the 3 year and 5 year returns are 26.9% and 19.2% respectively.\nRecent news around electric vehicle demand, competition among global automakers, and policy support for new energy vehicles has kept investor attention on companies like BYD. These themes help frame how the market is currently thinking about growth potential and risk for the stock.\nBYD records a valuation score of 1 out of 6, which suggests only one of six valuation checks signals the shares as undervalued. Next, we will look at what different valuation approaches say about that, before finishing with a way to think about value that goes beyond the usual ratios.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow, or DCF, model projects a company’s future cash flows and then discounts them back to today’s value to estimate what the business might be worth right now.\nFor BYD, the model used is a 2 Stage Free Cash Flow to Equity approach, working in CN¥. The latest twelve month free cash flow is a cash outflow of CN¥29.1b, so the model relies on future projections. Analysts provide estimates for several years, and Simply Wall St then extrapolates further to build a 10 year path. By 2035, projected free cash flow is CN¥101.3b, with discounted values provided for each year along the way.\nBringing all those projected cash flows back to today gives an estimated intrinsic value of CN¥115.23 per share, compared with the current share price of HK$94.55. On this basis, the DCF suggests BYD trades at about a 17.9% discount, which indicates that the shares are undervalued relative to these cash flow assumptions.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 17.9%. Track this in your watchlist or portfolio, or discover 877 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable business like BYD, the P/E ratio is a useful way to relate what you pay for each share to the earnings the company generates per share. It gives you a quick sense of how much of those earnings the market is currently willing to pay for.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 2899, "Word_Count": 501, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/byd-sehk-1211-price-missing-181524639.html", "Scrape_Time_Sec": 4.138803243637085}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-03T18:12:56+00:00", "News_Date_Formatted": "2026-01-03 18:12:56 (GMT+0)", "Week_Num": 5, "News_Title": "1211.HK Stock Today: January 3 — BYD UK Dealer Surge, Undercuts Tesla", "News_Source": "MEYKA", "News_Content": "1211.HK Stock Today: January 3 — BYD UK Dealer Surge, Undercuts Tesla\nGlobal Market Insights\n01/03/2026 6:12 PM\nby\nDanny Kontos\n6 mins read\nSummarize This Article Using AI\n1211.HK\n$97.75\n-3.98\nTSLA\n$430.41\n3.32\nTable of Contents\nWhat BYD’s UK push means for investors\nStock check: BYD and Tesla\nImpact on the UK car market\nHow to think about BYD UK in a portfolio\nFinal Thoughts\nFAQs\nDisclaimer\nBYD UK is in focus as the brand scales fast, targets 125 franchised dealers, and prices the Seal about 20% below Tesla’s Model 3. This price-first plan meets a UK market where Chinese car sales UK neared 10% of 2025 registrations. Shares of 1211.HK may see sentiment support if UK volumes rise, while rival TSLA faces sharper price competition. With no UK tariffs on China-made EVs today, investors should watch dealer rollout pace, BYD Seal price updates, and monthly registrations for early proof of traction.\nWhat BYD’s UK push means for investors\nBYD dealers UK are set to grow, with the company targeting 125 franchised partners by the end of 2025, widening test-drive access and aftersales coverage. More doors should cut buyer friction and boost brand visibility across regions. For context on the dealer build-out and network strategy, see this recent analysis from Insurance Edge source.\nBYD Seal price positioning sits about 20% below the Tesla Model 3, depending on trim and incentives. That gap matters in PCP-led buying, where a lower list price usually means a lower monthly. The UK currently applies no specific tariffs on China-made EVs, which supports aggressive pricing and faster showroom momentum if supply remains steady and marketing stays focused.\nChinese car sales UK were forecast to reach one in ten new cars in 2025, highlighting rising acceptance and value-led demand. This creates a supportive backdrop for BYD UK as it scales dealers and trims. The Guardian’s report provides useful context on share gains and buyer patterns source.\nStock check: BYD and Tesla\nAs of the latest available data provided, 1211.HK traded at HK$98.75, near its 50-day average and below its 200-day average. The stock changes show 1-year up 9.57% and 6-month down 21.63%. It trades at about 0.97x sales, with RSI at 45 and ADX at 15 suggesting a weak trend. Next earnings are scheduled for 31 March 2026.\nThe latest TSLA print in our dataset was $438.07. Tesla’s price-to-sales sits near 14.85x, versus BYD’s sub-1x, reflecting very different growth and margin expectations. UK go-to-market strategies also differ, with BYD UK leaning on franchised dealers and Tesla’s direct model. Tesla’s next earnings are slated for 28 January 2026; Street ratings remain mixed with varied targets.\nCatalysts to monitor include UK monthly registration data, confirmation of BYD’s 125-dealer milestone, and Seal pricing or incentive changes. Watch 1211.HK results on 31 March 2026 for export mix and margin updates, and TSLA results on 28 January 2026 for pricing commentary. Dealer onboarding pace and marketing effectiveness will be early signals for unit momentum in Britain.\nImpact on the UK car market\nChinese brands reached roughly 10% of UK new-car sales in 2025, a threshold that can shift competitive pricing across segments. If BYD UK sustains lower prices with adequate supply, rivals may respond with discounts or finance support. That could widen consumer choice, compress margins for incumbents, and push faster tech adoption, especially in compact and midsize EVs.\nLower new-EV prices generally pressure residual values, which can reduce monthly PCP costs but weigh on used-EV pricing. BYD Seal price positioning may ripple through leasing assumptions and dealer stocking strategies. Lenders will watch default rates and resale curves, while consumers benefit from keener deals and broader trim availability across mainstream price points.\nA larger BYD UK footprint can lift service, parts, logistics, and charging-install work across Britain. Suppliers with flexible capacity and EV expertise should benefit. Key risks include a potential policy pivot on tariffs, currency swings, and any shipping or homologation delays. Execution on service quality is equally important for brand trust in a competitive consumer market.\nHow to think about BYD UK in a portfolio\nIf showroom coverage improves and awareness builds, UK deliveries could support BYD’s wider European volume mix in 2026. Strong network execution, stable batteries and shipping, plus consumer confidence would be upside drivers. A slower onboarding of dealers, or a faster response from rivals, would moderate the path. We see a balanced, execution-led scenario profile.\nTrack SMMT registration prints, retail lead volumes, dealer openings, and BYD Seal price updates across trims. Watch Tesla and legacy brands for financing offers or price moves. For shares, monitor 1211.HK technicals around the HK$96.5 middle Bollinger band and HK$100 upper band, and any revisions to 2026 volume guidance at upcoming results.\nKey risks include p", "Content_Length": 7610, "Word_Count": 1194, "Image_URLs": ["https://meyka.com/_next/image/?url=https%3A%2F%2Fflagcdn.com%2Fw80%2Fus.png&w=128&q=60", "https://meyka.com/_next/image/?url=%2Fandroid-chrome-192x192.png&w=64&q=50"], "News_URL": "https://meyka.com/blog/1211hk-stock-today-january-3-byd-uk-dealer-surge-undercuts-tesla-0301/", "Scrape_Time_Sec": 1.6230254173278809}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-04T22:55:15.564370+00:00", "News_Date_Formatted": "2026-01-04 22:55:15 (GMT+0)", "Week_Num": 5, "News_Title": "Hong Kong stocks climb at midday as tech and auto shares lead gains", "News_Source": "THESTANDAR", "News_Content": "News\nComment\nBusiness & Innovation\nProperty\nRacing\nEducation\nArts & Lifestyle\nEntertainment\nMore\nePaper\nBUSINESS & INNOVATION\nMARKET\nHong Kong stocks climb at midday as tech and auto shares lead gains\nMARKET\n29-12-2025 12:30 HKT\nHKEX. Singtao\n Hong Kong shares advanced at midday on Tuesday, led by gains in technology and auto stocks.\nThe benchmark Hang Seng Index rose 68 points, or 0.26 percent, to 25,887 by the midday break, with turnover reaching HK$126.4 billion. The China Enterprises Index gained 0.77 percent to 8,983, while the Hang Seng Tech Index climbed 1.6 percent to 5,587.\nTech stocks mostly traded higher. Alibaba (9988) edged up 0.34 percent to HK$146.50, Tencent (0700) added 0.08 percent to HK$603.50, and Meituan (3690) jumped 2.23 percent to HK$105.50. Xiaomi (1810) reversed earlier losses to rise 0.15 percent to HK$39.28. Kuaishou Technology (1024) advanced 1.55 percent, Baidu (9888) gained 1.59 percent, JD.com (9618) rose 0.98 percent, and NetEase (9999) outperformed with a 2.63 percent gain.\nAuto stocks rallied after China’s finance ministry said it would continue to allocate funds next year to support trade-in programs for consumer goods. BYD (1211) surged 5.93 percent to HK$99.15, making it the best-performing blue chip. Geely (0175) climbed 4.85 percent, while U.S.-listed electric vehicle makers NIO (9866), XPeng (9868) and Li Auto (2015) rose between about 3.7 percent and 6.3 percent.\nOn the mainland, China’s Shanghai Composite Index was up 0.31 percent at midday, while the Shenzhen Component Index was little changed, edging up 0.03 percent.\nThe yuan also strengthened, with China’s central bank setting the daily midpoint at 7.0331 per US dollar, 27 pips stronger than last Friday and the firmest level in nearly 15 months.\nDownload The Standard app to stay informed with news, updates, and significant events:\nhttps://www.thestandard.com.hk/appdownload\n  by Taboola\nYou May Like\n五年來黃金投資最佳時機，就是現在！\nIC Markets\n|\nSponsored\n了解更多\nHK TV report exposes shocking indecent behavior at Tsing Yi public staircase\nBuy the Dip: These Big Dividends Have Gotten Way Too Cheap\nSeeking Alpha\n|\nSponsored\nRead More\nTop News\nEx-chief secretary Rafael Hui dies at 77 due to health issues\nBREAKING NEWS\n40 mins ago\nRosanna Law anticipates over 50 million visitors in 2026, optimistic about Chinese New Year tourism\nHONG KONG NEWS\n7 hours ago\nHK to expand youth access to global internships and conferences, Alice Mak says\nHONG KONG NEWS\n4 hours ago\nHundreds flock to On King Street Park as cherry blossoms reach full bloom\nHONG KONG NEWS\n5 hours ago\nPolice probe over 70 new traffic-related frauds, with a claimant reporting 'neck injuries' 20 times\nHONG KONG NEWS\n8 hours ago\nMarius Hoiby, the 'almost royal' tarnishing Norway's crown\nWORLD NEWS\n7 hours ago\nRead More\nThree major telecom operators flag impact from VAT change\nMARKET\n3 hours ago\nHong Kong firms attract IPO listings despite accountant shortages\nMARKET\n3 hours ago\nTrump says Fed nominee Warsh could garner Democratic support\nMARKET\n4 hours ago\nHong Kong's public finance, retail sales improving, Paul Chan says\nMARKET\n4 hours ago\nMacau's gaming revenue increases 24 percent in January\nMARKET\n6 hours ago\nWall St slips after Trump picks Fed critic Warsh to succeed Powell\nMARKET\n30-01-2026 23:31 HKT\nUS producer prices accelerate in December on services\nMARKET\n30-01-2026 22:07 HKT\nPanama president says ports will operate without disruption after court ruling\nMARKET\n30-01-2026 21:02 HKT\nUS stock index futures cut losses after Trump nominates Kevin Warsh as next Fed Chair\nMARKET\n30-01-2026 20:13 HKT\nTrump picks former Fed official Warsh to run Fed\nMARKET\n30-01-2026 20:10 HKT\nNew seatbelt law applies only to buses registered after Jan 25, says Doreen Kong\nHONG KONG NEWS\n30-01-2026 16:30 HKT\nGovt to suspend mandatory bus seatbelt rule due to legal flaw\nHONG KONG NEWS\n30-01-2026 18:00 HKT\nRobber had precise cash route Info; reporting victim arrested as accomplice in Sheung Wan 51m yen robbery\nHONG KONG NEWS\n31-01-2026 19:29 HKT\nBuy The Dip: 2 Of The Best Undervalued 8%-10% Yields I've Seen\nSeeking Alpha\n|\nSponsored\nRead More\nTai Sang Bank chairman caught having an affair with Internet celebrity\n2025 年最紓壓的農場遊戲！無需安裝\n東加：島嶼農場\n|\nSponsored\n立即播放\nMissing Hong Kong investment boss found in Pok Fu Lam Reservoir after four-day ordeal\nLenovo Legion Pro 7i (16″, Gen 10) Intel® Core™ Ultra 9 275HX 處理器 (E 核心最高達 4.60 GHz P 核心最高達 5.40 GHz)/Windows 11 家用版 64\nLenovo HK\n|\nSponsored\n立即選購\nJustin Trudeau's ex-wife breaks silence on his romance with Katy Perry\n2025年黃金大漲！聰明人早就進場了\nIC Markets\n|\nSponsored\n了解更多\nGoal-hero Konate puts grief aside to help injury-hit Liverpool\n  by Taboola\nContact Us\nAbout Us\nTerms of Use\nPrivacy Policy Statement\nCopyright Policy & License\nEthics Statement\n|\nSubscriptions\nPrint Advertising\nDigital Advertising\nStreet Points\nCopyright © 2026 The Standard - A division of Sing Tao News Corporation Limited. All rights reserved.", "Content_Length": 4943, "Word_Count": 791, "Image_URLs": ["https://www.thestandard.com.hk/_next/static/media/more_arrow_bt.671f0812.png", "https://www.thestandard.com.hk/_next/static/media/Flippingbook.297281dc.png", "https://www.thestandard.com.hk/_next/static/media/Search_white.425b07fe.png", "https://www.thestandard.com.hk/_next/static/media/menu_youtube.454d42d0.png", "https://www.thestandard.com.hk/_next/static/media/menu_flipping_version.1237fa95.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_increase.f9ae48f6.png"], "News_URL": "https://www.thestandard.com.hk/market/article/320327/Hong-Kong-stocks-climb-at-midday-as-tech-and-auto-shares-lead-gains", "Scrape_Time_Sec": 2.4581711292266846}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-23T22:09:36+00:00", "News_Date_Formatted": "2025-12-23 22:09:36 (GMT+0)", "Week_Num": 6, "News_Title": "Is It Too Late To Consider BYD After Its Strong Multi Year Share Price Run?", "News_Source": "YAHOO", "News_Content": "Is It Too Late To Consider BYD After Its Strong Multi Year Share Price Run?\nSimply Wall St\nDecember 24, 2025 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nIf you are wondering whether BYD is still a smart buy after its big multiyear run, or if the easy money has already been made, you are not alone. That is exactly what this article will unpack.\nDespite some recent choppiness, with the stock down 1.5% over the last week and roughly flat over 30 days, BYD is still up 8.2% year to date and 3.1% over the past year, on top of a hefty 48.4% gain in three years and 49.9% in five.\nThese moves have come as BYD cements its position as a global EV and battery heavyweight, ramping exports and expanding its model lineup in key overseas markets. Investors have also been reacting to policy shifts in China and intensifying EV competition, which can quickly change how the market prices BYD's growth story.\nIn our framework, BYD scores just 1 out of 6 on undervaluation checks. That might sound underwhelming until you see how different valuation methods tell very different stories, and why the most useful way to think about fair value, which we will get to at the end, goes beyond a simple scorecard.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow model takes estimates of the cash a company can generate in the future and discounts those amounts back to what they are worth today, to arrive at an intrinsic value per share.\nFor BYD, the model uses a 2 Stage Free Cash Flow to Equity framework in CN¥. The latest twelve months show negative free cash flow of about CN¥29.1 billion, reflecting heavy investment and working capital swings. Analysts then expect free cash flow to turn positive and grow rapidly, with Simply Wall St extrapolating those forecasts so that by 2035 BYD could be generating around CN¥101.3 billion in free cash flow.\nAfter discounting this stream of cash flows back to today, the model arrives at an intrinsic value of roughly HK$111.24 per share. Compared with the current market price, this implies the stock is about 16.3% below this DCF-derived estimate of intrinsic value, indicating a potential valuation gap based on the model’s assumptions.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 16.3%. Track this in your watchlist or portfolio, or discover 909 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Dec 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable company like BYD, the price to earnings ratio is a straightforward way to gauge how much investors are willing to pay today for each dollar of current earnings. In general, stronger and more reliable earnings growth, and lower perceived risk, justify a higher PE multiple, while slower growth or higher uncertainty usually call for a lower, more conservative multiple.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3156, "Word_Count": 542, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/too-consider-byd-strong-multi-220936883.html", "Scrape_Time_Sec": 3.944291591644287}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-17T06:47:43+00:00", "News_Date_Formatted": "2025-12-17 06:47:43 (GMT+0)", "Week_Num": 7, "News_Title": "Hong Kong Tech Stock Investing in Singapore: Practical Guide", "News_Source": "SYFE", "News_Content": "Hong Kong Tech Stock Investing in Singapore: Practical Guide\nBy Syfe Singapore -\nDecember 17, 2025\nIf you’re a Singaporean investor, Hong Kong tech stocks can be a practical way to access China’s major internet, EV, and consumer-tech companies through a liquid, internationally connected exchange. But investing in Hong Kong tech stocks is not just about buying the biggest names. It is about choosing the right access route, and sizing risk so a volatile “tech sleeve” does not dominate your overall portfolio.\nIn this guide, you will learn what counts as Hong Kong tech stocks, how the Hang Seng TECH Index (HSTECH) works (and why it matters even if you stock-pick), and the main ways Singapore investors can buy Hong Kong tech exposure. You will also get a simple, repeatable framework for evaluating individual Hong Kong tech stocks—so you are not investing based on headlines alone.\nInvest in Hong Kong Tech Stocks with Syfe Brokerage\nWhether you’re looking at Hong Kong Tech stocks or Hang Seng Index related ETFs on HKEX/SGX, you can access them all in one place with Syfe Brokerage. Trade HKEX and SGX listed stocks and ETFs from a single platform, fund in SGD and auto-convert seamlessly when you need to.\nStay in control of your own decisions with a MAS-regulated service with transparent pricing—so you can build and manage your exposure more easily across markets.\nGet Started\nTable of Content\nWhy Hong Kong Tech Stocks Matter to Singapore Investors\nWhat Counts As Hong Kong Tech Stocks\nWhat Changed for Hong Kong Tech Stocks in 2024–2025\nUnderstanding The Hang Seng TECH Index Before Stock-picking\nWays to Get Hong Kong Tech Exposure\nKey Considerations for Singaporean Investors\nHow to Evaluate Individual Hong Kong Tech Stocks (A Simple Framework)\n5 Hong Kong Tech Stocks to Watch Going into 2026\nPortfolio Building for Singapore Investors\nQuick Takeaways\nConclusion\nFrequently Asked Questions (FAQs)\nResources & Further Reading\nWhy Hong Kong Tech Stocks Matter to Singapore Investors\nHong Kong as an “offshore China” access point\nFor many global investors, Hong Kong is one of the most practical gateways to China’s largest consumer and internet-platform businesses because many major China tech companies are listed in Hong Kong. For Singaporean investors, this matters because:\nMarket access: You can gain China tech exposure without using onshore China trading channels.\nLiquidity and global participation: Hong Kong is an established international market hub with deep institutional participation.\nTime-zone convenience: HKEX trading hours line up well with Singapore time, which can reduce the “overnight surprise” feeling you may get in US markets.\nThe real role of Hong Kong tech in a Singapore portfolio\nFor most investors, Hong Kong tech works best as a satellite allocation—a targeted sleeve that complements a diversified global core (for example, broad global equity exposure plus bonds). This matters because Hong Kong tech stocks can offer upside in strong “risk-on” periods, but can also experience sharp drawdowns when sentiment, policy expectations, or competition shifts.\nWhat Counts As Hong Kong Tech Stocks\nIn practice, Hong Kong tech stocks usually refers to listed companies exposed to technology-driven business models, such as:\nE-commerce and local services (online marketplaces, on-demand delivery)\nDigital payments and fintech ecosystems\nCloud, AI infrastructure, and enterprise software\nSmartphones, consumer electronics, and IoT ecosystems\nEV platforms and related consumer-tech supply chains\nWhat Changed for Hong Kong Tech Stocks in 2024–2025\nHong Kong-listed China tech has experienced multi-year drawdowns followed by sharp rebounds. A key point for Singapore investors is that sentiment can flip quickly when earnings surprise, AI narratives strengthen, or policy tone appears to improve.\nFor example, in February 2025, the Hang Seng Tech Index recorded a major jump (including a 6.5% daily surge cited as its biggest daily gain since October at the time), driven by better-than-expected earnings, AI excitement, and fund rotation. This highlights a practical reality for Hong Kong tech stocks: entry price matters, but behaviour matters more—position sizing and discipline are usually what determine outcomes in volatile sectors.\nUnderstanding The Hang Seng TECH Index Before Stock-picking\nEven if you have never bought an index fund, the Hang Seng TECH Index (HSTECH) is the reference point for how Hong Kong tech behaves.\nWhat HSTECH tracks\nThe HSTECH tracks 30 of the largest technology-themed companies listed in Hong Kong. It was launched on 27 July 2020.\nConcentration and the 8% cap\nHSTECH is designed to be diversified within tech themes, but it is still a 30-stock index, which makes it more concentrated than broad-market indices.\nThe index uses free-float-adjusted market-cap weighting and is commonly implemented with an 8% cap per constituent at rebalancing (weights can drift after the rebalance due to price movement). In plain terms: H", "Content_Length": 20207, "Word_Count": 3121, "Image_URLs": ["https://cdn.prod.website-files.com/64d3542964db4e6ae6de7d1d/64e3291d2637d31cece131ba_nav-menu-tip.webp"], "News_URL": "https://www.syfe.com/magazine/hong-kong-tech-stocks/", "Scrape_Time_Sec": 5.7431206703186035}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-15T22:00:01.894000+00:00", "News_Date_Formatted": "2025-12-15 22:00:01 (GMT+0)", "Week_Num": 7, "News_Title": "BYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.", "News_Source": "SMARTKARMA", "News_Content": "Dashboard\nDiscussions\nWatchlists\nCollections\nTools\nMore\n𝛼SK\nor Search\nSIGN UP\nSIGN IN\nBearish\nBYD\nWatchlist\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\nEquity Derivatives\n646 Views16 Dec 2025 06:00\nBYD (1211 HK) downtrend may be turning attractive for some as a speculative LONG position, but the short-term upside is limited according to our model. We discuss buy zones and profit targets.\nWHAT IS COVERED IN THE FULL INSIGHT:\nIntroduction\nMarket Reversal Matrix Background\nQuantChart Analysis\nProfit Targets and Short Reversal Probability\nEntry Targets and Long Reversal Probability\nNico Rosti\nFollow\nMessage\nSUMMARY(Sign Up to Access)\nTry Now\nBegin exploring Smartkarma's AI-augmented investing intelligence platform with a complimentary Preview Pass to:\nUnlock research summaries\nFollow top, independent analysts\nReceive personalised alerts\nAccess Analytics, Events and more\nJoin 55,000+ investors, including top global asset managers overseeing $13+ trillion.\nUpgrade later to our paid plans for full-access.\nSMARTKARMA PREVIEW PASS\nSign Up with LinkedIn\nor\nFirst Name\nLast name\nEmail\nSign Up with Email\nBy signing up, you agree to our\nTerms of Use and Privacy Policy.\nAlready have an account? Sign In Now\nFULL INSIGHT\n(Paid Plans Only, 2-minute read)\nRELATED INSIGHTS\nMore »\nBYD (1211 HK) Tactical Outlook: Taking Off?\nQuiddity Leaderboard HSTECH Mar26: Final Ranks; US$840mn One-Way\nHSTECH Index Rebalance Preview: Changes If Index Universe Is Expanded\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\nTRENDING COLLECTIONS\nMore »\nEquity Bottom-Up\nEvent-Driven\nIndex Rebalance\nUnpaywalled Insights\nSingapore Value-Up\nSouth Korea\nJapan\nSmartkarma Company Primers\nGold\nPhilippines\nTRENDING INSIGHTS\nMore »\nPrimer: Modern Times Group MTG (MTGB SS) - Feb 2026\nOverview #48 — Gradually, Then Suddenly\nWeekly Deals Digest (01 Feb) - Toyota Ind, Mandom, Eastroc, Montage, Muyuan, Shin Etsu, Kandenko\nSBS Transit (SBUS SP | BUY | TP:S$3.92): Bussing for Dividends\nMakino Milling Machine (6135 JP): Twin Headwinds as Chinese and US Approvals Secured\nTOP UNPAYWALLED INSIGHTS\nMore »\nCurator's Cut: Going Private, Getting Active & Reviewing Public Market Premieres\nOverview #48 — Gradually, Then Suddenly\nSlight Gain in Governance, ROE and Valuations in 2025 Suggest that Reforms Have yet to Spread Widely\nBangladesh: VEON’s Next Billion-Dollar Fintech Opportunity\nOverview #47 – Are We There Yet?\nDISCUSSIONS\n(Paid Plans Only)\nPrice Chart(Sign Up to Access)\nSmartkarma SmartScore\n3.6/5\nRelative to stocks in the same:\nCountry & Sector\nValue\n3\nDividend\n4\nGrowth\n5\nResilience\n3\nMomentum\n3\n1\n2\n3\n4\n5\nSentiment\nView SmartScore Screener »\nInsight Stream\nBYD (1211 HK) Tactical Outlook: Taking Off?\n30 Jan 2026\nTSLA Outlook After -9% Annual Sales Decline: Relative-Value Trade Opportunity Vs. BYD\n03 Jan 2026\nBYD (1211 HK) Tactical Outlook: Is This a Good Time To Go LONG? Possibly Yes.\n30 Dec 2025\nBYD (1211 HK) Tactical Outlook: Time To Go LONG? Not Yet.\n16 Dec 2025\nBYD (1211 HK) Tactical Outlook: Still Downtrending, But OVERSOLD\n06 Nov 2025\nBYD (1211 HK): 3Q25, No Surprise, Revenue Down for First Time\n31 Oct 2025\nRelated Entities\nBYD (1211 HK)\nExpand All\nCollapse All\nTop\nSOLUTIONS\nFor Institutional Investors and Financial Services\nFor Corporate IR and Strategy\nFor Private Wealth Intermediaries\nPricing\nHow Smartkarma Compares\nABOUT\nWho We Are\nCareers\nFAQs\nResearch Provider Solutions\nSyndicate your Publications\nLEGAL\nCompliance\nTerms of Use\nPrivacy Policy\nPress Kit\nRSS Feeds\nCONTACT\nRequest a Free Trial\nAvail a Transition Account\nGuest Posts on Smartkarma\nOther Enquiries\nJoin TL;DR Community\nFree Weekly Newsletters\nDOWNLOAD\nCopyright © 2022 Smartkarma Innovations Pte Ltd. All Rights Reserved. v3.63.2", "Content_Length": 3807, "Word_Count": 592, "Image_URLs": ["https://www.smartkarma.com/_next/image?url=https%3A%2F%2Fstatic-prod.smartkarma.com%2Faccounts%2Fprofile_photos%2F000%2F049%2F555%2Fsmall%2Fdata%3F1685106429&w=96&q=75"], "News_URL": "https://www.smartkarma.com/insights/byd-1211-hk-tactical-outlook-time-to-go-long-not-yet", "Scrape_Time_Sec": 2.440624475479126}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-14T22:55:15.564370+00:00", "News_Date_Formatted": "2025-12-14 22:55:15 (GMT+0)", "Week_Num": 8, "News_Title": "BYD stock forecast: Third-party price target", "News_Source": "CAPITAL", "News_Content": "BYD stock forecast: Third-party price target\nBYD’s share price continues to draw attention as traders and analysts track shifts in the electric vehicle market and the company’s latest performance data.\n1211 +0.2%\nBy Dan Mitchell\n18:03 (UTC), 8 December 2025 Updated\nYD Auto Signage Logo on Top of Glass Building. Workplace Car Company Office Headquarter. Photo: askarim / Shutterstock.com\nBYD Company (1211) is trading around $98.20 HKD per share in Hong Kong dollar terms as of 10:39am on 3 December 2025 (UTC), moving within an intraday range of $97.70 HKD to $101.25 HKD on Capital.com’s share CFD feed. Past performance is not a reliable indicator of future results.\nThe stock is trading amid mixed sector and company news, with recent data showing BYD’s November new energy vehicle sales down about 5% year-on-year as competition in China’s EV market intensifies (CnEVPost, 1 December 2025), while exports of over 130,000 units have provided some offset (Shanghai Metals Market, 2 December 2025).\nPast performance is not a reliable indicator of future results.\nBYD stock forecast 2026–2030: Analyst price targets\nAnalyst price targets compiled between October and December 2025 span a range of price targets. These figures are indicative opinions rather than guarantees, and they reflect assumptions about electric vehicle demand, competitive pricing, policy support and BYD’s expansion outside China over the coming year.\nInvesting.com (consensus screen)\nThe latest BYD Co Ltd-H consensus on the Investing.com equity forecast page shows an average 12-month target of about $132.73 HKD per share, with individual analyst estimates ranging roughly from $90.03 HKD on the low side to $175.50 HKD on the high side as of late 2025. The platform attributes this range to input from analysts over the prior three months, amid expectations that BYD may sustain earnings and revenue growth against a backdrop of heightened competition in the EV market (Investing.com, 3 December 2025).\nCMB International (company update)\nCMB International’s 31 October 2025 company update on BYD trims its H-share target price to $125 HKD, maintaining a positive rating while basing the valuation on a 20-times multiple of projected 2027 earnings per share. The research team cites slower-than-expected margin recovery, currency effects and a more competitive plug-in hybrid landscape, while still flagging BYD’s technology roadmap and overseas expansion as key supports for medium-term profitability (CMBI, 31 October 2025).\nGoldman Sachs relay (broker note summary)\nA news summary carried by Intellectia on 2 November 2025 reports that Goldman Sachs lifted its target price for BYD Company to $141 HKD, describing the move as an 8% increase while keeping a positive stance on the stock. The bank’s analysts highlight expectations that overseas markets could increasingly drive unit volumes between 2026 and 2035, with EV penetration outside China expected to catch up over time and underpin their long-run sales and earnings assumptions (Intellectia AI, 4 November 2025).\nTipRanks (aggregated broker data)\nA BYD price-target snapshot on TipRanks dated 20 October 2025 points to an average 12-month goal close to $135.02 HKD, with the highest individual forecast cited around $173.73 HKD and the lowest just above $79 HKD. The service describes a strongly positive analyst rating skew, as contributors emphasise BYD’s delivery growth and platform technology amid uncertainties around global demand, pricing strategies and policy support (TipRanks, 3 December 2025).\nAcross these sources, third-party 12-month BYD price forecasts span roughly from $79 HKD to the $175 HKD, with common themes around EV demand, competitive pricing dynamics, technology investment and the pace of overseas expansion.\nPredictions and third-party forecasts are inherently uncertain, as they cannot fully account for unexpected market developments. Past performance is not a reliable indicator of future results.\nBYD stock price: Technical overview\nThe BYD stock price is around $98.20 HKD as of 10:39 (UTC) on 3 December 2025, with price holding close to the Classic pivot at 97.7 after testing an intraday range between 97.7 and 101.25 in the session. On the daily chart, the simple moving-average cluster sits with the 20/50/100/200-DMAs near 98, 103, 109 and 119 respectively, while the 10-day SMA around 96.8 and VWMA(20) near 97.9 keep the price consolidated just under the shorter-term band. The 14-day RSI at 47.1 is mid-neutral and the ADX at 12.8 points to a weak trend environment, consistent with range-bound trading conditions rather than a directional impulse in the current setup.\nOn the topside, the nearest Classic resistance is R1 at 103.1, with R2 around 108.8 coming into view only if a daily close forms above the lower resistance area. On pullbacks, the Classic pivot at 97.7 is the first support to watch, followed by the 100-day SMA near 109.1 as the main moving-average shelf, while a decisive break below the pivot w", "Content_Length": 8756, "Word_Count": 1371, "Image_URLs": [], "News_URL": "https://capital.com/en-int/analysis/byd-stock-forecast-what-is-next-for-the-chinese-ev-maker", "Scrape_Time_Sec": 2.9871983528137207}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-09T21:11:23+00:00", "News_Date_Formatted": "2025-12-09 21:11:23 (GMT+0)", "Week_Num": 8, "News_Title": "Is BYD Still Attractive at HK$98 After Global EV Expansion and Mixed Valuation Signals?", "News_Source": "YAHOO", "News_Content": "Is BYD Still Attractive at HK$98 After Global EV Expansion and Mixed Valuation Signals?\nSimply Wall St\nDecember 10, 2025 4 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nWondering if BYD at HK$98 is still a smart way to ride the EV and battery wave, or if most of the upside is already priced in? You are not alone.\nThe stock is roughly flat over the last month at +0.1%, but a 13.9% gain year to date and 44.1% over three years shows investors have already been willing to pay up for its growth story, even after a recent 2.1% dip this week and a more modest 9.1% return over the past year.\nRecent headlines have focused on BYD aggressively expanding exports into Europe and Southeast Asia and ramping up its battery and EV production footprint globally, adding fuel to the long term growth narrative. At the same time, rising competition in China and shifting government policy have kept some investors cautious, which helps explain the more modest near term price action.\nRight now, BYD only scores 1 out of 6 on our valuation checks, suggesting the market might not see it as a clear bargain yet and that different valuation methods could tell very different stories. Toward the end of this article we will look at a more complete way to think about what BYD is really worth.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow model estimates what a business is worth by projecting its future cash flows and discounting them back to today, to reflect risk and the time value of money.\nFor BYD, the latest twelve month free cash flow is negative at roughly CN¥29.1 billion, reflecting heavy investment in growth. Analysts and extrapolated estimates, however, point to a sharp turnaround, with free cash flow expected to reach about CN¥101.3 billion in 2035, based on a 2 Stage Free Cash Flow to Equity model that blends explicit forecasts with longer term growth assumptions.\nWhen all projected cash flows over the next decade and beyond are discounted back, Simply Wall St’s DCF model arrives at an intrinsic value of around HK$111.51 per share. With the stock trading near HK$98, this implies BYD is about 12.1% undervalued on this cash flow view. This suggests the market may be underestimating the long term earnings power of its EV and battery businesses.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 12.1%. Track this in your watchlist or portfolio, or discover 904 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Dec 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor profitable companies like BYD, the price to earnings, or PE, ratio is a useful way to gauge how much investors are willing to pay for each unit of current earnings. In general, faster growth and lower risk justify a higher PE, while slower or more uncertain earnings usually warrant a lower multiple.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3159, "Word_Count": 546, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/byd-still-attractive-hk-98-211123804.html", "Scrape_Time_Sec": 8.805524826049805}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-04T02:36:18+00:00", "News_Date_Formatted": "2025-12-04 02:36:18 (GMT+0)", "Week_Num": 9, "News_Title": "Chinese EV stocks extend losses in Hong Kong as year-end sales momentum wanes", "News_Source": "CNEVPOST", "News_Content": "Chinese EV stocks extend losses in Hong Kong as year-end sales momentum wanes\nPhate Zhang • Dec 4, 2025, 10:36 AM GMT+8\n1\n7\nMajor EV makers have seen consecutive days of declines as year-end vehicle deliveries have been weaker than in previous years amid tapering stimulus policies.\nTo date, over 20 local governments have suspended or adjusted vehicle replacement subsidy applications.\n(An Onvo L60 displayed at the Shanghai auto show in April 2025. Image credit: CnEVPost)\nHong Kong-listed Chinese electric vehicle (EV) makers have witnessed sustained stock price declines over several days, with year-end sales performance proving weaker than in prior years.\nEV makers including Nio Inc (NYSE: NIO, HKG: 9866), Xpeng (NYSE: XPEV, HKG: 9868), Li Auto (NASDAQ: LI, HKG: 2015), and BYD (HKG: 1211, OTCMKTS: BYDDY) declined in early trading today, extending their multi-day slump.\nAs of this writing, Nio was down 1.95 percent to HK$38.30 per share, extending its decline to a fourth consecutive trading day and hitting its lowest level since August 19. The company has fallen about 33 percent over the past month.\nJoin us on Telegram or Google News\nXpeng currently fell 1.99 percent to HK$73.85 per share, also marking its fourth consecutive trading day of declines and hitting a new low since August 4. Over the past month, it has dropped about 19 percent.\nLi Auto was down 2.87 percent to HK$67.80 per share, marking its fifth consecutive trading day of losses and hitting a new low since late November 2022. The company has fallen about 17 percent over the past month, and down about 45 percent from its recent high in July.\nBYD was currently down 1.12 percent to HK$97.05 per share, marking its second consecutive trading day of decline. Over the past month, the company has fallen about 2 percent.\nLeapmotor (HKG: 9863) was down 1.13 percent, having declined about 11 percent over the past month.\nThese companies posted relatively strong deliveries last month but demonstrated weak momentum, especially compared to their robust year-end performances in previous years.\nNio delivered 36,275 vehicles in November, its second-highest monthly record. This represents a 76.31 percent year-on-year increase but a 10.20 percent decline from October.\nXpeng delivered 36,728 vehicles in November, up 18.88 percent year-on-year but down 12.58 percent from October.\nLi Auto delivered 33,181 vehicles in November, marking a 31.92 percent year-on-year decline -- its sixth consecutive month of year-on-year contraction. This monthly figure represents a 4.45 percent increase from October's 31,767 deliveries.\nBYD sold 480,186 NEVs in November, its highest monthly total this year. This represented a 5.25 percent year-on-year decline, marking the third consecutive month of year-on-year contraction, though it increased by 8.71 percent compared to October.\nLeapmotor delivered 70,327 vehicles in November, a 75.08 percent year-on-year increase and a 0.05 percent rise from October.\nThe year-end delivery slump partly stems from tapering stimulus policies.\nBy mid-November, trade-in subsidies in most Chinese provinces had been adjusted, intensifying consumer wait-and-see sentiment and impacting the November auto market, noted the China Passenger Car Association (CPCA) in a December 2 report.\nAs China's fourth batch of RMB 69 billion ($9.8 billion) in national subsidies nears depletion, an increasing number of local governments have suspended or adjusted vehicle trade-in subsidies, Yicai noted in a report yesterday.\nTo date, over 20 municipal governments have suspended or adjusted applications for vehicle trade-in subsidies, the report noted.\nAdditionally, China's current new energy vehicle (NEV) purchase tax reduction policy will begin scaling back next year, potentially further impacting first-quarter sales.\n($1 = RMB 7.0697)\nHK StocksLeapmotorLi AutoLi Auto StockNioNio StockXpengXpeng Stock\nDaily Recap\nSubscribe to Daily Recap to get updates on what's happening in China's EV industry each day.\n✓\nDaily Recap\nView more channels\nSubscribe\nAbout Author\nPhate Zhang\nPhate is the founder and main author of CnEVPost. He has been reporting since 2009, mainly on macroeconomics and capital markets. He started his career at China Daily and Reuters. Contact via: phate@cnevpost.com.", "Content_Length": 4285, "Word_Count": 655, "Image_URLs": [], "News_URL": "https://cnevpost.com/2025/12/04/chinese-ev-stocks-extend-losses-hong-kong/", "Scrape_Time_Sec": 18.61711621284485}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-01T13:23:01+00:00", "News_Date_Formatted": "2025-12-01 13:23:01 (GMT+0)", "Week_Num": 9, "News_Title": "8 China-Africa mobility stocks to watch now", "News_Source": "NAI500", "News_Content": "English\nHome\nArticles\nInterviews\nClients\nMarkets\nMETALS 100\nGCFF Event\nHomeMarket News8 China-Africa mobility stocks to watch now\n8 China-Africa mobility stocks to watch now\nPublished on: Dec 1, 2025 Author: Jian Wu Share article:\nA three-day factory deep dive by African auto media at Guangzhou Automobile Group’s headquarters and plants this month is more than a goodwill tour. It is a window into how China is building an end-to-end mobility corridor with Africa, from EV manufacturing and batteries to charging, grid upgrades, finance, and software. The message from Guangzhou is familiar to anyone tracking China’s industrial policy: world-class engineering at scale, faster product cycles, and an open playbook for emerging markets. It is also investable. The following eight companies sit at the center of this China-Africa mobility buildout, with milestones, capacity, and platforms that can convert into share gains across the 2026-2030 cycle.\nGAC Group 2238.HK, 601238.SS\nGAC just hosted a delegation of African automotive media from Egypt, Tunisia and beyond for an in-depth look at its intelligent manufacturing plants, EV and hybrid-REEV test drives, and its innovation pipeline showcased at the 23rd Guangzhou International Automobile Exhibition. The milestone matters. It signals a steady, pragmatic approach to globalization: open factories, repeatable processes, and an EV product matrix designed for varied road conditions. The production tour through welding, final assembly, and quality inspection reinforces GAC’s repeatability and quality control. Impact: GAC’s playbook checks the boxes African distributors care about — reliability, serviceability, and software-ready vehicles — lowering the risk of local market entry and accelerating time-to-scale.\nBYD 1211.HK, BYDDY\nBYD produced 545,000 vehicles in 2024 and, despite a 15 percent dip in domestic sales early in 2025, is doubling down on global capacity with a new European base in Hungary and premium technology like the YangWang U8. The milestone here is not a single model launch; it is platform economics. BYD’s vertical integration across batteries, power electronics, and vehicle assembly compresses costs and shortens development cycles. Impact: That cost curve is the bridge into Africa’s mass-market segments and municipal fleets. Capacity in Europe also helps de-risk logistics to North Africa while signaling to regulators and fleet buyers that BYD can localize where needed.\nPowerChina 1802.HK, 601669.SS\nEV adoption depends on charging and grid resilience. PowerChina is moving first with a renewables-heavy pipeline across the continent, targeting operations in nearly every African market within five years. Africa already accounts for about 30 percent of PowerChina’s overseas revenue, projected to rise to 40 to 45 percent by 2030. Milestone: a clear, time-bound market coverage target tied to revenue mix. Impact: Co-locating solar, wind, and substation projects with highway corridors and urban depots directly lowers the operational cost of EV fleets and improves charging uptime. This is the backbone that converts auto demand into sustainable, bankable transport ecosystems.\nICBC 1398.HK, 601398.SS\nFinance decides the pace of adoption. ICBC remains the world’s largest bank by assets and continues to expand its international network. That scale translates into lower-cost capital for auto leasing, dealer inventory finance, and green infrastructure debt. Milestone: a cross-border banking footprint that can syndicate large project loans and retail credit in tandem. Impact: Pairing ICBC’s balance sheet with PowerChina’s engineering and OEM rollouts creates a turnkey financing stack for African governments, utilities, and private fleet operators — a structural advantage few rivals can match at comparable rates.\nTencent 0700.HK\nConnected cars need ubiquitous software, payments, and content. Tencent, the world’s largest video game vendor, runs platforms with more than 1.2 billion monthly active users across WeChat and QQ. Milestone: persistent, at-scale mobile ecosystems with payments and messaging embedded. Impact: For automakers, Tencent’s cloud, mapping, and mini-program capabilities are the straightforward route to in-car services, over-the-air updates, and seamless charging payments. In emerging markets where smartphone penetration outpaces credit card penetration, Tencent-scale wallets and messaging can compress customer acquisition costs for automakers and charging networks.\nAlibaba 9988.HK, BABA\nLogistics and cloud are the hidden gears in auto expansion. Alibaba’s international e-commerce grew 36 percent year over year in Q4 2024. Milestone: proven cross-border retail acceleration that can be repurposed for parts, accessories, and after-sales fulfillment. Impact: A durable parts and last-mile network drives total cost of ownership down — critical for African fleet buyers and retail consumers. Alibaba Cloud also gives OEMs and dealers a toolkit for demand forecasting", "Content_Length": 8404, "Word_Count": 1212, "Image_URLs": [], "News_URL": "https://nai500.com/blog/2025/12/8-china-africa-mobility-stocks-to-watch-now/", "Scrape_Time_Sec": 3.732255697250366}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-30T22:55:15.564370+00:00", "News_Date_Formatted": "2025-11-30 22:55:15 (GMT+0)", "Week_Num": 10, "News_Title": "HK stocks open flat", "News_Source": "THESTANDAR", "News_Content": "News\nComment\nBusiness & Innovation\nProperty\nRacing\nEducation\nArts & Lifestyle\nEntertainment\nMore\nePaper\nBUSINESS & INNOVATION\nMARKET\nHK stocks open flat\nMARKET\n27-11-2025 10:38 HKT\nby\nHelen Zhong\nSING TAO\nHong Kong stocks opened little changed on Thursday, as tech shares were mixed.\nThe Hang Seng Index rose 17 points, or 0.07 percent, to 25,945.\nThe Hang Seng China Enterprises Index decreased 5 points, or 0.06 percent, to 9,156 at the open, while the Hang Seng Tech Index edged down 0.1 percent to 5,613.\nSMIC (0981) rose 0.44 percent, and Xiaomi (1810) also increased by 0.35 percent.\nAlibaba (9988), BYD(1211), and Baidu (9888) inched down 0.52 percent, 0.81 percent, and 1.3 percent, respectively, as they reportedly would be listed as Chinese military-linked companies by the Pentagon.\nDownload The Standard app to stay informed with news, updates, and significant events:\nhttps://www.thestandard.com.hk/appdownload\n  by Taboola\nYou May Like\nTop 10 Stocks for 2026\nSeeking Alpha\n|\nSponsored\nRead More\nTai Sang Bank chairman caught having an affair with Internet celebrity\nGrowth Isn’t the Only Way to Win in This Market\nSeeking Alpha\n|\nSponsored\nRead More\nTop News\nEx-chief secretary Rafael Hui dies at 77 due to health issues\nBREAKING NEWS\n42 mins ago\nRosanna Law anticipates over 50 million visitors in 2026, optimistic about Chinese New Year tourism\nHONG KONG NEWS\n7 hours ago\nHK to expand youth access to global internships and conferences, Alice Mak says\nHONG KONG NEWS\n4 hours ago\nHundreds flock to On King Street Park as cherry blossoms reach full bloom\nHONG KONG NEWS\n5 hours ago\nPolice probe over 70 new traffic-related frauds, with a claimant reporting 'neck injuries' 20 times\nHONG KONG NEWS\n9 hours ago\nMarius Hoiby, the 'almost royal' tarnishing Norway's crown\nWORLD NEWS\n7 hours ago\nRead More\nThree major telecom operators flag impact from VAT change\nMARKET\n3 hours ago\nHong Kong firms attract IPO listings despite accountant shortages\nMARKET\n3 hours ago\nTrump says Fed nominee Warsh could garner Democratic support\nMARKET\n4 hours ago\nHong Kong's public finance, retail sales improving, Paul Chan says\nMARKET\n5 hours ago\nMacau's gaming revenue increases 24 percent in January\nMARKET\n6 hours ago\nWall St slips after Trump picks Fed critic Warsh to succeed Powell\nMARKET\n30-01-2026 23:31 HKT\nUS producer prices accelerate in December on services\nMARKET\n30-01-2026 22:07 HKT\nPanama president says ports will operate without disruption after court ruling\nMARKET\n30-01-2026 21:02 HKT\nUS stock index futures cut losses after Trump nominates Kevin Warsh as next Fed Chair\nMARKET\n30-01-2026 20:13 HKT\nTrump picks former Fed official Warsh to run Fed\nMARKET\n30-01-2026 20:10 HKT\nNew seatbelt law applies only to buses registered after Jan 25, says Doreen Kong\nHONG KONG NEWS\n30-01-2026 16:30 HKT\nGovt to suspend mandatory bus seatbelt rule due to legal flaw\nHONG KONG NEWS\n30-01-2026 18:00 HKT\nRobber had precise cash route Info; reporting victim arrested as accomplice in Sheung Wan 51m yen robbery\nHONG KONG NEWS\n31-01-2026 19:29 HKT\n2025 年最紓壓的農場遊戲！無需安裝\n東加：島嶼農場\n|\nSponsored\n立即播放\nHK legal community mourns loss of prominent lawyer in tragic Wan Chai suicide\n五年來黃金投資最佳時機，就是現在！\nIC Markets\n|\nSponsored\n了解更多\nMissing Hong Kong investment boss found in Pok Fu Lam Reservoir after four-day ordeal\nLenovo Legion Pro 7i (16″, Gen 10) Intel® Core™ Ultra 9 275HX 處理器 (E 核心最高達 4.60 GHz P 核心最高達 5.40 GHz)/Windows 11 家用版 64\nLenovo HK\n|\nSponsored\n立即選購\nMan dies after collapsing on Hong Kong Trail following argument\n2025年黃金大漲！聰明人早就進場了\nIC Markets\n|\nSponsored\n了解更多\nPhilippine beauty queen found naked and dead at sea, surveillance footage reveals street kidnapping\n  by Taboola\nContact Us\nAbout Us\nTerms of Use\nPrivacy Policy Statement\nCopyright Policy & License\nEthics Statement\n|\nSubscriptions\nPrint Advertising\nDigital Advertising\nStreet Points\nCopyright © 2026 The Standard - A division of Sing Tao News Corporation Limited. All rights reserved.", "Content_Length": 3946, "Word_Count": 638, "Image_URLs": ["https://www.thestandard.com.hk/_next/static/media/more_arrow_bt.671f0812.png", "https://www.thestandard.com.hk/_next/static/media/Flippingbook.297281dc.png", "https://www.thestandard.com.hk/_next/static/media/Search_white.425b07fe.png", "https://www.thestandard.com.hk/_next/static/media/menu_youtube.454d42d0.png", "https://www.thestandard.com.hk/_next/static/media/menu_flipping_version.1237fa95.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_increase.f9ae48f6.png"], "News_URL": "https://www.thestandard.com.hk/market/article/317919/HK-stocks-open-flat", "Scrape_Time_Sec": 2.4607715606689453}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-25T10:11:02+00:00", "News_Date_Formatted": "2025-11-25 10:11:02 (GMT+0)", "Week_Num": 10, "News_Title": "Is BYD Trading Below Fair Value After New Global Partnership News?", "News_Source": "YAHOO", "News_Content": "Is BYD Trading Below Fair Value After New Global Partnership News?\nSimply Wall St\nNovember 25, 2025 5 min read\nIn this article:\n002594.SZ\n-1.54%\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nCurious about whether BYD is actually a bargain, or if that price tag just looks tempting on the surface? You are not alone. Getting to the real answer takes more than just glancing at the share price.\nBYD’s stock has slipped a bit in the last week and month (down 1.2% and 7.9%), but zoom out and you will see a decent 11.3% gain year-to-date and a 13.0% return over the past year.\nOver the last few months, headlines have focused on BYD’s competitive push into key global markets and ongoing innovations in electric vehicle technology. Announcements about new overseas partnerships and production updates have played into recent volatility, catching the eye of both bulls and skeptics.\nOn our simple value score, BYD comes in at just 1 out of 6, but “value” can mean very different things depending on the lens you use. Let’s break down those classic valuation measurements, and at the end, we will see if there is a smarter way to put all the pieces together.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nThe Discounted Cash Flow (DCF) model offers a rigorous approach to valuation by projecting a company’s future cash flows and then discounting those back to their present value. For BYD, this means estimating how much cash the business will generate in the years ahead and determining what those future earnings are worth today.\nCurrently, BYD’s Free Cash Flow stands at negative CN¥29.1 Billion, reflecting significant investments for future growth. Analyst forecasts suggest this trend will reverse rapidly, with projections of CN¥72.4 Billion in Free Cash Flow by 2027. Simply Wall St goes further, extrapolating estimates for the next decade and arriving at a predicted Free Cash Flow of over CN¥101.3 Billion by 2035.\nBased on these cash flow projections and using a 2-Stage Free Cash Flow to Equity model, the estimated intrinsic value per share comes to HK$111.37. With the stock trading at a 14.0% discount to this calculated fair value, the DCF model currently points to BYD being undervalued in the market.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 14.0%. Track this in your watchlist or portfolio, or discover 918 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Nov 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings (PE Ratio)\nThe Price-to-Earnings (PE) ratio is a go-to valuation metric for profitable companies, as it directly measures how much investors are willing to pay today for each dollar of current earnings. Since BYD is consistently reporting profits, the PE ratio helps reveal whether the market’s pricing reflects the company’s actual earnings power.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3112, "Word_Count": 518, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/DLoYws4eepMtuW_SiZ0mtw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM0MTtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/74d34776460f9bf9df70df0eb3e8eb9d"], "News_URL": "https://finance.yahoo.com/news/byd-trading-below-fair-value-101102931.html", "Scrape_Time_Sec": 4.5842695236206055}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-21T05:51:46+00:00", "News_Date_Formatted": "2025-11-21 05:51:46 (GMT+0)", "Week_Num": 11, "News_Title": "How Singapore Investors Can Approach China Stocks: Themes, Risks and Notable Names", "News_Source": "SYFE", "News_Content": "How Singapore Investors Can Approach China Stocks: Themes, Risks and Notable Names\nBy Syfe Singapore -\nNovember 21, 2025\nChina remains the world’s second-largest economy by nominal GDP and the largest by purchasing power parity, accounting for a sizeable share of global output and growth. In equity markets, China is just as significant: the MSCI China Index alone includes over 500 large- and mid-cap companies across A-shares (mainland China-listed, RMB-dominated stocks), H-shares (Chinese companies listed in Hong Kong and quoted in HKD) and overseas listings, representing about 85% of China’s investable equity universe.\nFor many Singapore investors, China stocks are back on the radar. On one side, you have some of the world’s most interesting names in e-commerce, super-apps, electric vehicles (EVs) and travel. On the other, you’re navigating headlines about regulations, property markets and US–China tensions.\nThis guide will cover how big China is in the global market, main ways to access Chinese markets from Singapore, key risks, a simple stock-picking framework, and an illustrative list of 10 top China stocks by theme.\nInvest in China Stocks with Syfe Brokerage\nBuild and manage your own China stock watchlist without juggling multiple brokers. With Syfe Brokerage, you can buy individual China stocks listed in the US (ADRs on NYSE/Nasdaq) and on HKEX, all from a single, MAS-regulated platform.\nEnjoy unlimited free US trades for the first three months, as well as low commission fee from 0.04% – 0.06% for HKEX. No platform or hidden fees.\nGet Started\nTable of Content\nHow Big Is China in the Global Market?\nWhy Singapore Investors Are Looking at Top China Stocks\nHow Singaporeans Can Access Chinese Stocks\nKey Risks of Investing in Chinese Stocks\nA Simple Framework to Evaluate Top Chinese Stocks\n10 Top China Stocks by Theme\nE-Commerce and Platforms\nOnline Services and Entertainment\nConsumer and Travel\nNew Energy, EVs and Local Services\nHow Much China Exposure Makes Sense?\nUsing ETFs to Get China Exposure\nQuick Takeaways\nConclusion\nFrequently Asked Questions (FAQs)\nHow Big Is China in the Global Market?\nChina is one of the heavyweights of the global economy. By nominal GDP, it is the second-largest economy in the world, and by purchasing power parity it ranks first, accounting for a sizeable share of global output.\nIn equity markets, China also plays a major role. The MSCI China Index covers over 500 large and mid-cap companies across A-shares (mainland China–listed, RMB-denominated stocks), H-shares (Chinese companies listed in Hong Kong and quoted in HKD) and overseas listings, representing around 85% of China’s investable equity universe. The broader MSCI China All Shares Index goes further by combining all major share classes from Shanghai, Shenzhen, Hong Kong and offshore markets into a single, integrated view.\nBecause of this size and breadth, China often appears as one of the largest single-country exposures within global emerging-market and Asia-focused equity benchmarks. In other words, what happens in Chinese markets can meaningfully influence regional and emerging-market performance, making China a key market to understand even if it’s only a moderate part of your own portfolio.\nWhy Singapore Investors Are Looking at Top China Stocks\nFrom Singapore, your portfolio might already lean heavily towards local banks, REITs and US tech stocks. Adding a measured slice of top Chinese stocks can introduce different drivers of return, such as onshore consumption, digital platforms, EV adoption and tourism recovery.\nCommon reasons Singapore investors look at Chinese equities:\nScale and growth potential: Even with slower growth than a decade ago, China remains a major engine of global demand and manufacturing, while shifting towards services, technology and consumption.\nUnique sectors and business models: Super-apps like WeChat, pure-play EV makers and certain consumer brands don’t have direct equivalents on SGX, so China offers exposure you can’t easily get locally.\nValuation reset: Years of regulatory actions, property stress and cautious sentiment have pushed many large-cap Chinese names to lower valuations than comparable companies elsewhere, which some investors see as an opportunity if conditions stabilise.\nFor Singaporean investors who can accept higher volatility in exchange for growth potential, Chinese stocks and China ETFs are often viewed as a satellite, higher-risk sleeve layered onto a global core.\nHow Singaporeans Can Access Chinese Stocks\nFrom Singapore, you have three main ways to get exposure to top Chinese stocks:\nUS-listed Chinese ADRs\nH-shares – Hong Kong–listed China shares\nChina A-shares via Stock Connect and ETFs\nEach route has different currencies, trading hours, fees and risks.\n1. US-Listed Chinese ADRs\nMany well-known Chinese companies trade in the US as American Depositary Receipts (ADRs), such as:\nAlibaba Group (BABA)\nJD.com (JD)\nPDD Holdings (PDD)\nBaidu (BIDU)\nTrip.com Group (TCOM)\nAn A", "Content_Length": 28630, "Word_Count": 4423, "Image_URLs": ["https://cdn.prod.website-files.com/64d3542964db4e6ae6de7d1d/64e3291d2637d31cece131ba_nav-menu-tip.webp"], "News_URL": "https://www.syfe.com/magazine/how-singapore-investors-can-approach-china-stocks/", "Scrape_Time_Sec": 3.64633846282959}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-13T12:56:22+00:00", "News_Date_Formatted": "2025-11-13 12:56:22 (GMT+0)", "Week_Num": 12, "News_Title": "BYD STOCK TODAY (13 NOVEMBER 2025): GLOBAL EXPANSION, CHEAPEST EVS AND WHAT IT MEANS FOR INVESTORS", "News_Source": "TS2", "News_Content": "13 NOVEMBER 2025\nCOMPANY ANALYSIS·ELECTRIC VEHICLES·GLOBAL ECONOMY·INVESTMENT STRATEGIES·STOCK MARKET\n9 MINS READ\nBYD STOCK TODAY (13 NOVEMBER 2025): GLOBAL EXPANSION, CHEAPEST EVS AND WHAT IT MEANS FOR INVESTORS\nBY MARCIN FRĄCKIEWICZ\nChinese electric‑vehicle giant BYD Co Ltd (HKEX: 1211, OTC: BYDDF) is back in the spotlight on 13 November 2025, as the stock rebounds in Hong Kong while a wave of fresh headlines highlights both its aggressive global push and the pressure at home.\nBelow is a news-style, SEO-ready rundown of BYD stock today, the latest company developments dated or updated 13 November 2025, and how they fit into the bigger investment story.\nBYD stock today: Hong Kong shares rebound from recent lows\nIn Hong Kong trading on 13 November 2025, BYD’s H‑shares closed at HK$102.80, up about 2.3% on the day after moving in a range between HK$99.20 and HK$103.20. Investing\nThat puts BYD:\nRoughly 25–26% above its 52‑week low of HK$81.80 set in January 2025\nStill well below its 52‑week high of HK$159.27 from May 2025 FT Markets\nKey snapshot for 1211.HK today:\nLast close: HK$102.80\nDay change: +2.29%\nDay range: HK$99.20 – HK$103.20\nMarket cap: ~HK$959 billion\nTrailing P/E: ~14.6\nDividend yield: ~1.4% FT Markets\nFor U.S. investors, the over‑the‑counter ticker BYDDF last closed at US$12.84 on 12 November 2025, down 1.47% on the session, with the 52‑week range running from about US$12.20 to US$60.20. StockInvest Trading for 13 November in U.S. markets is still unfolding at the time of writing.\nIn other words, BYD stock has bounced off its recent lows but remains deeply discounted versus its 2025 peak, reflecting lingering concerns about margins, China’s EV price war and slowing domestic growth.\nNew guidance: BYD doubles down on overseas sales targets\nOne of the biggest drivers behind today’s narrative is BYD’s overseas growth ambition.\nA fresh Reuters‑cited Citi report, widely discussed this week and carried in multiple outlets including The Manila Timesand SupercarBlondie, reveals that BYD is now targeting 1.5–1.6 million vehicles sold abroad in 2026. Reuters\nKey details from this guidance:\n2025 overseas sales are expected at 900,000–1,000,000 vehicles.\n2026 target: up to 1.5–1.6 million vehicles abroad – roughly doubling exports from current levels. Stocktwits\nBYD has cut its overall 2025 sales target by 16% to 4.6 million vehicles, citing weaker domestic demand and intensifying competition. Reuters\nOverseas sales are increasingly diversified across Europe, North America and ASEAN, each accounting for around a third of expected 2025 overseas volumes, according to Citi’s note. Reuters\nThe same report says BYD expects capital expenditure to decline in late 2025 and significantly in 2026 as its massive vehicle and battery plants finally catch up with demand. Reuters\nWhy this matters for BYD stock today:\nInvestors have been punishing BYD for its profit slump and China slowdown, but this new export‑heavy roadmapreinforces the idea that growth is shifting from China to overseas markets. That shift is exactly what many bullish theses on BYD rely on.\nAustralia: BYD unleashes the Atto 1 and Atto 2, the country’s cheapest EVs\nOn 13 November 2025, several Australian outlets confirmed what EV watchers have been anticipating: BYD is detonating the price floor of the Australian EV market.\nMultiple reports from WhichCar, Fleet EV News, The Canberra Times and TorqueCafe reveal final pricing and specs for the BYD Atto 1 city hatch and Atto 2 small SUV: Torquecafe.com\nAtto 1 (city hatch):\nFrom AU$23,990 + on‑road costs\nPositioned as Australia’s cheapest electric vehicle\nAtto 2 (small SUV):\nFrom AU$31,990 + on‑road costs\nReported as Australia’s cheapest electric SUV\nBoth models use BYD’s Blade Battery and e‑Platform 3.0, with the Atto 1 offering 30 kWh and 43.2 kWh packs (approx. 220–310 km WLTP range) and the Atto 2 a 51.3 kWh pack (around 345 km WLTP). WhichCar\n(Ranges are claimed WLTP figures from today’s reporting.)\nThe cars are due to reach Australian showrooms from December 2025. WhichCar\nCommentators emphasise that:\nThese models undercut many petrol cars on price, not just other EVs. Torquecafe\nFleet‑focused coverage calls them a “game‑changer” for sub‑AU$25,000 EVs, opening the door for corporate and government fleets to electrify without massive upfront costs. Fleet EV News\nImplication for the stock:\nOn the positive side, BYD is showing it can scale affordable EVs globally, not just in China – strengthening its reputation as a price leader and potentially boosting export volumes and brand share.\nOn the risk side, this underscores the broader concern: BYD’s strategy is still heavily price‑driven, and deep undercutting can weigh on margins, a key reason the stock derated after Q3 earnings.\nFresh November 13 headlines: Japan, Malaysia, the Philippines and more\nToday’s BYD newsflow isn’t just about Australia and sales targets. Several other 13 November 2025 stories highlight how wide the company’s global footprint has b", "Content_Length": 16525, "Word_Count": 2588, "Image_URLs": [], "News_URL": "https://ts2.tech/en/byd-stock-today-13-november-2025-global-expansion-cheapest-evs-and-what-it-means-for-investors/", "Scrape_Time_Sec": 3.7429916858673096}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-09T21:09:29+00:00", "News_Date_Formatted": "2025-11-09 21:09:29 (GMT+0)", "Week_Num": 12, "News_Title": "Is the Recent BYD Share Price Slide an Opportunity or a Warning for 2025?", "News_Source": "YAHOO", "News_Content": "Is the Recent BYD Share Price Slide an Opportunity or a Warning for 2025?\nSimply Wall St\nNovember 10, 2025 5 min read\nIn this article:\n002594.SZ\n-1.54%\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nEver wondered if BYD stock is actually a bargain or if it's already priced for perfection? You're not alone. This article is here to help you find out.\nWhile BYD has delivered a 6.5% gain over the past year and stands up an impressive 66.8% over five years, its recent dips of -2.7% this week and -11.2% over the last month signal the market is rethinking its outlook.\nNews around shifts in electric vehicle policy and competitive dynamics among Chinese automakers are swirling, adding volatility to BYD’s share price. Investors are paying close attention to updates on expansion plans, regulatory changes, and government incentives that could give BYD an edge or challenge its momentum.\nThe stock currently clocks a valuation score of 3 out of 6, suggesting it's undervalued on half of the key metrics we track. Up next, we break down how analysts typically value BYD. Stay tuned for an even more insightful approach to valuation that could change how you see the stock.\nFind out why BYD's 6.5% return over the last year is lagging behind its peers.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow (DCF) model estimates a company's intrinsic value by forecasting its future cash flows and then discounting those projected amounts back to today's value. This helps investors judge what a business could be worth based on how much free cash it can generate over the coming years.\nFor BYD, the latest data shows the company's last twelve months Free Cash Flow stood at a negative CN¥29.1 Billion. Despite this challenging base, analyst projections show an aggressive turnaround, with Free Cash Flow expected to reach CN¥78.4 Billion by 2027 and further growing to about CN¥125.2 Billion by 2035, based on both analyst forecasts and extrapolations. Notably, these projections use estimates for the first five years and apply a reasonable growth curve for the remainder of the next decade.\nWhen all these expected cash flows are discounted back to present value, the DCF model arrives at an estimated intrinsic value of HK$132.98 per share. This figure suggests the stock is trading at a 26.4% discount to its calculated fair value, indicating that, based on cash flow fundamentals, BYD is currently undervalued.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 26.4%. Track this in your watchlist or portfolio, or discover 876 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Nov 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nThe Price-to-Earnings (PE) ratio is a widely used valuation measure, particularly appropriate for profitable companies like BYD, because it helps investors quickly gauge how much they are paying for each dollar of earnings. A higher PE can reflect higher expected growth or a lower perceived risk, while a lower PE may hint at more limited upside or greater uncertainty.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3234, "Word_Count": 536, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/DLoYws4eepMtuW_SiZ0mtw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM0MTtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/74d34776460f9bf9df70df0eb3e8eb9d"], "News_URL": "https://finance.yahoo.com/news/recent-byd-share-price-slide-210929649.html", "Scrape_Time_Sec": 3.889376163482666}
