{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-15T00:00:00+00:00", "News_Date_Formatted": "2026-01-15 00:00:00 (GMT+0)", "Week_Num": 3, "News_Title": "Is BYD (SEHK:1211) Still Attractive After Recent Share Price Gains?", "News_Source": "SIMPLYWALL", "News_Content": "Hong Kong/Auto/SEHK:1211\nIs BYD (SEHK:1211) Still Attractive After Recent Share Price Gains?\nSimply Wall St\nReviewed by Bailey Pemberton\nJanuary 15, 2026\nShare\nCopy Link\nIf you are trying to work out whether BYD at HK$97.60 is a bargain or already fully priced, the starting point is to understand how its current share price lines up against a few different valuation checks.\nThe stock has returned 2.4% over the last week, 1.7% over the last month, with a year to date decline of 1.2% and a 14.4% return over the last year. This naturally raises questions about what is already priced in and what might still be on the table.\nRecent coverage around the electric vehicle and battery sector more broadly has kept attention on BYD, especially as investors compare established players with newer peers in the space. This backdrop helps frame the recent price moves and explains why sentiment around the stock can shift quickly.\nRight now, BYD has a valuation score of 2 out of 6, meaning it screens as undervalued on 2 of 6 checks. In the next sections we will look at how different valuation approaches arrive at that, before circling back to an even more practical way to think about the company’s value.\nBYD scores just 2/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nAdvertisement\nDiscover more\nNYSE\nNew York Stock Exchange\nSimply Wall St\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow, or DCF, model estimates what a company might be worth by projecting its future cash flows and then discounting them back to today’s value. It is essentially asking what all those future CN¥ coming in are worth in today’s money.\nFor BYD, the model used is a 2 Stage Free Cash Flow to Equity approach. The latest twelve month free cash flow is a loss of about CN¥29.1b, so the starting point is currently negative. Analysts provide forecasts for several years, and Simply Wall St then extrapolates beyond that. The ten year projections range from about CN¥61.2b in 2026 to CN¥124.8b in 2035, all expressed in future CN¥ terms before discounting.\nWhen all those projected cash flows are discounted back, the estimated intrinsic value comes out at CN¥135.37 per share. Compared with the current share price of HK$97.60, this DCF output implies the stock trades at a 27.9% discount to that intrinsic value, which screens as undervalued on this model.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 27.9%. Track this in your watchlist or portfolio, or discover 882 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable business, the P/E ratio is a useful way to think about value because it connects what you pay for each share with the earnings that support that price. As a rule of thumb, higher growth and lower perceived risk can justify a higher “normal” P/E, while slower growth or higher risk usually point to a lower one.\nBYD currently trades on a P/E of 20.74x. That sits above the Auto industry average of 18.62x and also above the average of its peer group at 8.67x, so on simple comparisons the shares look more expensive than many alternatives.\nSimply Wall St’s Fair Ratio for BYD is 13.89x. This is a proprietary estimate of what a reasonable P/E could be, based on factors such as the company’s earnings profile, industry, profit margins, market cap and risk characteristics. Because it adjusts for these company specific inputs, the Fair Ratio can be more informative than a plain comparison with industry or peer averages.\nComparing the current P/E of 20.74x with the Fair Ratio of 13.89x suggests BYD is trading above this model derived range.\nResult: OVERVALUED\nSEHK:1211 P/E Ratio as at Jan 2026\nP/E ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1441 companies where insiders are betting big on explosive growth.\nUpgrade Your Decision Making: Choose your BYD Narrative\nEarlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple way for you to put a clear story behind the numbers such as your fair value, and your expectations for BYD’s future revenue, earnings and margins.\nA Narrative is your own view of what BYD is, where it could go, and what that might mean in financial terms. It then connects that story to a forecast and finally to a fair value per share.\nOn Simply Wall St, Narratives sit in the Community page and are designed to be easy to use. They help you compare a Fair Value with the current price so you can decide for yourself whether BYD looks attractive or stretched on your assumptions.\nBecause Narratives update when new information such as news or earnings is added, your view of BYD can stay aligned with what is happening. For example, one investor mi", "Content_Length": 11646, "Word_Count": 1888, "Image_URLs": ["https://images.ctfassets.net/n07nr2koi959/6YVpCWgrk0c9DenG6UgW8m/d79e37d527c71a95e08b9ce1071ba986/Image_from_iOS.jpg?fit=thumb&w=64&h=64", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/dcf", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/pe-multiple-vs-industry", "https://images.simplywall.st/company/c5923218-3184-4601-8e64-12a238a82fc9/chart/quote-price", "https://images.ctfassets.net/n07nr2koi959/220TWz80MMu5IKd31MX2Mh/5baf073475c70362f71c7471b9e72a3c/portrait.jpg?fit=thumb&w=64&h=64", "https://media.simplywall.st/news/1732588370134-santa.png", "https://images.simplywall.st/asset/user/6ce83970.1752699810283.a08a5c2e44846abf.jpg", "https://images.simplywall.st/asset/user/45dda785.1742553080078.a6ba4470cda23f32.png", "https://images.simplywall.st/asset/user/a1009226.1745498844070.88d48672c85c64f4.jpg", "https://images.simplywall.st/asset/user/181c8840.1742542972024.b5a369d57557101f.jpg"], "News_URL": "https://simplywall.st/stocks/hk/automobiles/hkg-1211/byd-shares/news/is-byd-sehk1211-still-attractive-after-recent-share-price-ga", "Scrape_Time_Sec": 2.785137891769409}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-13T17:41:34-05:00", "News_Date_Formatted": "2026-01-13 17:41:34 (GMT-5)", "Week_Num": 3, "News_Title": "BYD Is A Key Part Of The World Shifting Towards BEVs", "News_Source": "SEEKINGALPHA", "News_Content": "Home\nConsumer \nElectric Vehicles\nChina\nBYD Is A Key Part Of The World Shifting Towards BEVs\nJan. 13, 2026 5:41 PM ETBYD Company Limited (BYDDY) Stock, BYDDF StockTSLA, TSLA:CA, ZTSL:CA\n, , , ,\nEric Sprague\n5.35K Followers\nFollow\n5\nShare\nSave\nPlay\n(12min)\nComments\n(38)\nSummary\nBYD Company Limited leads global BEV sales, outpacing Tesla in 2025 with 2.26 million BEVs sold and strong export momentum.\nChina dominates the global BEV market, with giants BYD and Geely combining to sell almost a million more BEVs in 2025 than 2024.\nBYDDY faces rising competitive threats from Huawei’s HIMA network and Xiaomi, both leveraging tech ecosystems which provide rapid unit growth.\nGetty Images\nIntroduction\nPer my August article, BYD Company Limited (BYDDY) is seeing growth in terms of selling new energy vehicles (“NEVs”) overseas. This continues as the December CPCA National Passenger Market Report says BYD exported 131,637 units in December. Unlike Tesla (TSLA), who only sells battery electric vehicles (“BEVs”), BYD also sells plug-in hybrid vehicles (“PHEVs”). NEVs include both BEVs and PHEVs.\nPer the December National Passenger Market Report, China accounts for 68% of global NEV share for the first 11 months of 2025. This includes 64.3% of the BEV share and 76.4% of the PHEV share. As such, if we want to analyze the global NEV market then we have to look at China and if we want to analyze China’s NEV market then we have to look at BYD.\nBYD saw BEV sales climb almost 28% from 1,764,992 units in 2024 up to 2,256,714 units in 2025 per the December CPCA Manufacturer Ranking Report. It's impressive how they sold 491,722 more BEVs in a year when sentiment in some markets was bearish on BEVs.\nMy thesis is that BYD is a key part of the world shifting to BEVs.\nAt the time of this writing, RMB 1,000 is about $143.32.\nThe Numbers\nOn a global basis, Tesla was slightly ahead of BYD with BEVs in 2024 but everything changed in 2025. It was a year where BYD sold nearly half a million more BEVs worldwide while Tesla saw a drop of more than 150 thousand units. Combined, BYD and Geely (GELYY) sold nearly a million more BEVs in 2025 than they did in 2024 while Tesla saw units fall:\n2024\nunits\n2025\nunits\n%\nchange\nunit\nchange\nBYD BEVs\n1,764,992\n2,256,714\n28%\n491,722\nBYD PHEVs\n2,485,378\n2,288,709\n(8)%\n(196,669)\nBYD Total\n4,250,370\n4,545,423\n7%\n295,053\nTesla BEVs/Total\n1,789,226\n1,636,129\n(9)%\n(153,097)\nGeely BEVs\n576,488\n1,073,805\n86%\n497,317\nGeely PHEVs\n311,747\n613,962\n97%\n302,215\nGeely ICE\n1,288,332\n1,336,800\n4%\n48,468\nGeely Total\n2,176,567\n3,024,567\n39%\n848,000\nDespite headlines about flat BEV markets in parts of the U.S. and Europe, BEV sales have been increasing substantially worldwide and much of this is because of BYD and China. Per the January 2025 CPCA National Passenger Market Report, global auto sales for 2024 were 90.6 million units and BEVs had 11.4% share while PHEVs had 6.3% share implying unit numbers of 10.3 million and 5.7 million, respectively. For 2025 global units, we only have the first 11 months at this time from the December 2025 CPCA National Passenger Market Report. For the first 11 months of 2025, global auto sales were 87.66 million. The global BEV penetration rate rose significantly to 15.3% while the PHEV penetration rate went up slightly to 7.9% which implies 11-month unit figures of 13.4 million and 6.9 million, respectively. In just the first 11 months of 2025, the global BEV unit sub total beat the full year total for 2024 by over 3 million units!\nBYD is by far the largest BEV wholesaler in China but many other OEMs are copying some of their techniques and increasing their numbers. Above we showed the global units for Tesla but below we only show only the Tesla China wholesale units:\n2025 China Wholesale Passenger Market (Author's spreadsheet)\nHere are the 2025 China wholesale passenger numbers in spreadsheet form:\nPassenger Wholesale\nUnits\nPercentage\nBYD PHEV NEV\n2,288,709\n7.7%\nBYD BEV NEV\n2,256,714\n7.6%\nGeely PHEV NEV\n613,962\n2.1%\nGeely BEV NEV\n1,073,805\n3.6%\nChangan NEV\n937,460\n3.2%\nSAIC-GM-Wuling NEV\n852,037\n2.9%\nTesla China BEV NEV\n851,732\n2.9%\nChery NEV\n831,406\n2.8%\nLeapmotor NEV\n596,555\n2.0%\nSeres/AITO NEV\n430,282\n1.5%\nXPeng BEV NEV\n429,445\n1.5%\nXiaomi NEV\n411,837\n1.4%\nOther NEV\n3,745,056\n12.7%\nChery ICE\n1,866,255\n6.3%\nGeely ICE\n1,336,800\n4.5%\nChangan ICE\n858,963\n2.9%\nGWM ICE\n737,857\n2.5%\nSAIC-GM-Wuling ICE\n255,809\nOther ICE\n9,179,316\n31.1%\nTotal\n29,554,000\n99.1%\nThe above numbers are from the wholesale tables of the December CPCA Manufacturer Ranking Report where we have the top 10 overall OEMs and the top 10 NEV OEMs. We can get some of the ICE leaders by taking the overall leaders and subtracting their NEV units which gives us their net ICE units. But BYD is the #1 overall OEM and they have no ICE units.\nAdditionally, Tesla China is the #10 overall OEM and they don't have any ICE units either. FAW-VW, SAIC VW and SAIC are in the top 10 overall and they have large ICE sales but I don't have their year", "Content_Length": 14056, "Word_Count": 2423, "Image_URLs": ["https://seekingalpha.com/images/users_profile/003/418/341/big_pic.png?io=w36", "https://seekingalpha.com/images/users_profile/000/016/392/big_pic.png?io=w36&t=ece861f9e7", "https://seekingalpha.com/images/users_profile/047/771/937/big_pic.png?io=w36&t=084f23098c", "https://seekingalpha.com/images/users_profile/057/852/430/big_pic.png?io=w36&t=ddcbd81e0a", "https://seekingalpha.com/images/users_profile/060/875/609/big_pic.png?io=w36&t=1712cd496a", "https://seekingalpha.com/images/users_profile/054/495/410/big_pic.png?io=w36&t=86772d38ae", "https://seekingalpha.com/images/users_profile/055/355/197/big_pic.png?io=w36&t=5e89e9f080", "https://seekingalpha.com/images/users_profile/050/113/560/big_pic.png?io=w36&t=c50fbb49fd", "https://seekingalpha.com/images/users_profile/050/662/133/big_pic.png?io=w36&t=cc4b502fcd"], "News_URL": "https://seekingalpha.com/article/4859400-byd-is-a-key-part-of-the-world-shifting-towards-bevs", "Scrape_Time_Sec": 7.880711555480957}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-09T18:15:24+00:00", "News_Date_Formatted": "2026-01-09 18:15:24 (GMT+0)", "Week_Num": 4, "News_Title": "Is BYD (SEHK:1211) Price Missing The Mark After Recent EV Demand Headlines", "News_Source": "YAHOO", "News_Content": "Is BYD (SEHK:1211) Price Missing The Mark After Recent EV Demand Headlines\nSimply Wall St\nJanuary 10, 2026 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nWondering whether BYD’s current share price actually lines up with its underlying worth, or if the market is missing something you can use to your advantage.\nBYD shares closed at HK$94.55, with a 7 day return of a 4.3% decline and a 30 day return of a 3.3% decline, while the 1 year return stands at 14.1% and the 3 year and 5 year returns are 26.9% and 19.2% respectively.\nRecent news around electric vehicle demand, competition among global automakers, and policy support for new energy vehicles has kept investor attention on companies like BYD. These themes help frame how the market is currently thinking about growth potential and risk for the stock.\nBYD records a valuation score of 1 out of 6, which suggests only one of six valuation checks signals the shares as undervalued. Next, we will look at what different valuation approaches say about that, before finishing with a way to think about value that goes beyond the usual ratios.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow, or DCF, model projects a company’s future cash flows and then discounts them back to today’s value to estimate what the business might be worth right now.\nFor BYD, the model used is a 2 Stage Free Cash Flow to Equity approach, working in CN¥. The latest twelve month free cash flow is a cash outflow of CN¥29.1b, so the model relies on future projections. Analysts provide estimates for several years, and Simply Wall St then extrapolates further to build a 10 year path. By 2035, projected free cash flow is CN¥101.3b, with discounted values provided for each year along the way.\nBringing all those projected cash flows back to today gives an estimated intrinsic value of CN¥115.23 per share, compared with the current share price of HK$94.55. On this basis, the DCF suggests BYD trades at about a 17.9% discount, which indicates that the shares are undervalued relative to these cash flow assumptions.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 17.9%. Track this in your watchlist or portfolio, or discover 877 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable business like BYD, the P/E ratio is a useful way to relate what you pay for each share to the earnings the company generates per share. It gives you a quick sense of how much of those earnings the market is currently willing to pay for.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 2899, "Word_Count": 501, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/byd-sehk-1211-price-missing-181524639.html", "Scrape_Time_Sec": 7.836383104324341}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-04T22:42:13.898474+00:00", "News_Date_Formatted": "2026-01-04 22:42:13 (GMT+0)", "Week_Num": 5, "News_Title": "BYD China EV sales drop in December as overseas deliveries hit record high", "News_Source": "INVESTING", "News_Content": "Get 50% Off\nSign In\nFree Sign Up\nMarkets\nMy Watchlist\nInvesting Challenges\nNews\nAnalysis\nCharts\nTechnical\nBrokers\nTools\nAcademy\nEconomic Calendar\nStock Screener\nMore\nBreaking News\nCurrencies\nCommodities\nStock Markets\nEconomic Indicators\nEconomy\nCryptocurrency\nInsider Trading\nCompany News\nEarnings\nInvestment Ideas\nSWOT Analysis\nAnalyst Ratings\nTranscripts\n🚪 February's AI-picked stock list about to go live. Opportunity is knocking...\nPick Stocks with AI\nBYD China EV sales drop in December as overseas deliveries hit record high\nAuthor\nNavamya Acharya\nStock Markets\nPublished 01/02/2026, 02:14 AM\n0\n© Reuters\n1211\n-3.98%\nInvesting.com -- BYD’s (HK:1211) China sales slump deepened in December, pulling overall new energy vehicle deliveries down for a fourth straight month even as overseas sales surged to a record high.\nThe Chinese automaker sold 420,398 new energy vehicles, or NEVs, in December, down 18.34% from a year earlier, according to data released Jan. 1, 2026. Sales fell 12.45% from November, when deliveries reached a monthly high for 2025.\nBYD’s overseas NEV sales rose to 133,172 units in December, exceeding November’s 131,935 units to set a new record. Overseas deliveries increased 133.01% year-on-year and 0.94% month-on-month.\nBYD’s NEV figures include both passenger and commercial vehicles. Passenger NEV sales totaled 414,784 units in December, down 18.58% year-on-year and down 12.66% from November. \nCommercial NEV sales reached 5,614 units, up 4.56% from a year earlier and up 6.63% from the prior month.\nPassenger battery electric vehicle, or BEV, sales came in at 190,712 units, down 8.19% year-on-year and down 19.71% month-on-month. \nPassenger plug-in hybrid electric vehicle, or PHEV, sales totaled 224,072 units, down 25.73% from a year earlier, marking the ninth consecutive month of year-on-year decline, and down 5.61% from November.\nBYD is China’s largest NEV manufacturer and the country’s second-largest producer of power batteries. Its power battery and energy storage battery installations totaled about 27.352 gigawatt-hours, or GWh, in December, up 16.42% year-on-year but down 1.15% from November.\nIn the fourth quarter, BYD sold 1,342,290 NEVs, down 11.94% year-on-year but up 20.47% from the third quarter.\nPassenger NEV sales in the quarter totaled 1,326,561 units, down 12.38% from a year earlier and up 19.99% from the previous quarter. \nCommercial NEV sales reached 15,729 units, up 52.69% year-on-year and up 82.87% quarter-on-quarter.\nPassenger BEV sales in the fourth quarter were 650,811 units, up 9.30% year-on-year and up 11.72% from the third quarter. Passenger PHEV sales totaled 675,750 units, down 26.43% year-on-year but up 29.19% quarter-on-quarter.\nOverseas NEV sales in the fourth quarter reached 349,011 units, up 192.49% from a year earlier and up 49.91% from the third quarter.\nPower battery and energy storage battery installations in the fourth quarter totaled about 82.383 GWh, up 22.99% year-on-year and up 19.87% quarter-on-quarter.\nFor all of 2025, BYD sold 4,602,436 NEVs, an increase of 7.73% from a year earlier. The total met the company’s revised annual sales target of 4.6 million units.\nPassenger NEV sales for the year totaled 4,545,423 units, up 6.94% year-on-year. Commercial NEV sales reached 57,013 units, up 161.83% from 2024.\nPassenger BEV sales totaled 2,256,714 units in 2025, up 27.86% year-on-year. Passenger PHEV sales came in at 2,288,709 units, down 7.91% from a year earlier.\nBYD sold 1,046,083 NEVs overseas in 2025, an increase of 150.74% year-on-year. Power battery and energy storage battery installations for the year totaled about 285.634 GWh, up 46.70% from 2024.\nIs 1211 a bargain right now?\nThe fastest way to find out is with our Fair Value calculator. We use a mix of 17 proven industry valuation models for maximum accuracy.\n\nGet the bottom line for 1211 plus thousands of other stocks and find your next hidden gem with massive upside.\nSee Undervalued Stocks\n0\nLatest comments\nPost\nComment Guidelines\nIndices\nCommodities\nBonds\nStocks\n1D\n1W\n1M\n6M\n1Y\n5Y\nMax\n30/01\n06:00\n12:00\n18:00\n48 250\n48 500\n48 750\nUS 30 48,856.90 -214.7 -0.44%\nUS 500 6,935.50 -33.4 -0.48%\nDow Jones 48,892.47 -179.09 -0.36%\nS&P 500 6,939.03 -29.98 -0.43%\nNasdaq 23,461.82 -223.30 -0.94%\nS&P 500 VIX 17.44 +0.56 +3.32%\nDollar Index 96.86 +0.720 +0.75%\nInvesting Challenges\nJoin our investing challenges and compete for rewards while you learn!\nTake the Challenge\nMost Popular Articles\nNews\nAnalysis\nHow does a weaker dollar impact gold and Bitcoin?\nBy Investing.co...\nFeb 01, 2026\nHotel stocks - here are winners and losers from weak dollar\nBy Investing.co...\nFeb 01, 2026\nIs the U.K. economy on the brink of a recession? BCA Research weighs in.\nBy Investing.co...\nFeb 01, 2026\nWill the ECB respond to the rising euro? Analyst weighs\nBy Investing.co...\nFeb 01, 2026\nHeavy earnings week, jobs data to test US stocks after Microsoft swoon\nBy Reuters\nFeb 02, 2026\nMore News\nMarket Movers\nMost Active\nGainers %\nLosers %\nName", "Content_Length": 7521, "Word_Count": 1180, "Image_URLs": ["https://i-invdn-com.investing.com/news/providers/investing-new.png", "https://i-invdn-com.investing.com/news/BYDCompany_800x533_L_1710763576.jpg", "https://eb2.3lift.com/getuid?gdpr=0&cmp_cs=&us_privacy=&redir=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26triplelift_uid%3D$UID", "https://sync.go.sonobi.com/us?gdpr=0&consent_string=&us_privacy=&loc=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26sonobi_uid%3D%5BUID%5D", "https://ssum-sec.casalemedia.com/usermatchredir?s=196326&gdpr=0&gdpr_consent=&us_privacy=&cb=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26ix_uid%3D", "https://csync.loopme.me/?pubid=11586&gdpr=0&gdpr_consent=&us_privacy=&redirect=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26loopme_uid%3D%7Bviewer_token%7D", "https://sync.1rx.io/usersync2/rmpssp?sub=sportority&gdpr=0&gdpr_consent=&us_privacy=&redir=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26unruly_uid%3D%5BRX_UUID%5D", "https://u.openx.net/w/1.0/cm?id=6667519e-f89c-40a7-9fb6-e7217998098f&gdpr=0&gdpr_consent=&us_privacy=&r=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26openx_uid%3D%7BOPENX_ID%7D%20", "https://cs.media.net/cksync.php?cs=81&type=vol&gdpr=0&gdpr_consent=&redirect=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcthcd8qpwtb0y2y26707nx%26medianet_uid%3D%3Cvsid%3E"], "News_URL": "https://www.investing.com/news/stock-market-news/byd-china-ev-sales-drop-in-december-as-overseas-deliveries-hit-record-high-4427359", "Scrape_Time_Sec": 22.677191019058228}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-28T22:42:13.898474+00:00", "News_Date_Formatted": "2025-12-28 22:42:13 (GMT+0)", "Week_Num": 6, "News_Title": "BYD COMPANY (01211) Analyst Ratings, Stock Forecast and Price Target", "News_Source": "MOOMOO", "News_Content": "Investments\nFeatures\nPricing\nPromotion\nInstitutions\nPrivate Wealth\nSupport\nAbout us\nDownload\nSign up/Log in\nEnjoy\nup to S$1190*\nOpen Account\nWatchlist\nPaper Trade\nScreener\nHeat Map\nInstitutional\nTracker\nHK Stock Market\nDetailed Quotes\nBYD COMPANY (01211)\nWatchlist\n97.750\n-4.050-3.98%\n15min Delay\nMarket Closed Jan 30 16:07 CST\n891.21B\nMarket Cap\n21.22\nP/E (TTM)\nOverview\nFinancials\nAnalysis\nCompany\nNews\nComments\nBYD COMPANY (01211) Analyst Ratings, Stock Forecast and Price Target\n01211 Analyst Ratings & Estimates\nLast Updated: Feb 1, 2026\nBased on 9 analysts giving stock ratings to BYD COMPANY in the past 3 months\nBuy\nStrong Buy\n66.67%\nBuy\n22.22%\nHold\n0.00%\nUnderperform\n0.00%\nSell\n11.11%\nUnlock Analyst Ratings\n01211 Price Target for the Next 12 Months\nLast Updated: Feb 1, 2026\nThe average BYD COMPANY stock price target is 280.47 with a max estimate of 458.80 and a min estimate of 80.00\n64.00\n186.00\n308.00\n430.00\n550.56\nPast 12 Months\n12 Months Forecast\nMax\n458.80\nAvg\n280.47\nMin\n80.00\nCurrent\n 97.75\nUnlock Price Targets\nReview BYD COMPANY earnings estimates\nDetailed Ratings\nReceive timely notifications of rating changes\nView more detailed ratings of institutions and analysts\nView rating details page for historical data\nDownload APP\nAnalyst Ratings Disclaimer\nMarket Insights\nGold\nNo.\nSymbol\n20D % Chg\nSample Name\nSample Code\n+264.36%\nSample Name\nSample Code\n+77.00%\nSample Name\nSample Code\n+57.13%\n4\nBlue Gold\nBGL\n+50.00%\n5\nParamount Gold Nevada\nPZG\n+40.48%\nView More\nMeet Smarter Moomoo AI\nARK ETFs\nThe ARK ETFs concept includes several ETFs across different strategies managed by ARK Invest. ARK Invest is an investment firm founded by Cathie Wood.\nNo.\nSymbol\n20D % Chg\nSample Name\nSample Code\n+10.39%\nSample Name\nSample Code\n+8.08%\nSample Name\nSample Code\n+5.04%\n4\nThe 3D Printing ETF\nPRNT\n+2.15%\n5\nARK Israel Innovative Technology ETF\nIZRL\n+1.47%\nUnlock Now\n- No more -\nCustomer Service\n+65 6321 8888\nTrading days: 24 hours\nNon-trading days: 9:30 - 21:30 SGT\nclientservice@sg.moomoo.com\nAbout moomoo\nAbout moomoo\nInfluencer Program\nInvestor Relations\nMedia Relations\nScam Awareness\nTerms & Conditions\nPrivacy Policy\nTerms of Use\nBroker Disclosure\nBest Execution Policy\nLicensed Entities*\nYour Privacy Choices\nCareers / Contact:\nApply Now\ncareer@sg.moomoo.com\nFollow us on\nMoomoo Stores\n313 @somerest\nJem\nAddress:\n313 Orchard Road #B2-14 & #B2-53/53A, 313@somerset, Singapore 238895\nOpening Hours:\n10:00 - 22:00 SGT\n\n\nThe moomoo app is an online trading platform offered by Moomoo Technologies Inc. In Singapore, securities and brokerage services are provided by Moomoo Financial Singapore Pte. Ltd., regulated by the Monetary Authority of Singapore (MAS) under a Capital Markets Services Licence (CMS101000), a Major Payment Institution Licence (PS20200617), and with Exempt Financial Adviser Status.\nMoomoo Financial Singapore Pte. Ltd. does not solicit or market in jurisdictions such as China or others where its services are not permitted. Accessing this platform from such locations is at your own risk, and compliance with local laws is your responsibility.\nAdvertisements leading to this website have not been reviewed by the MAS.\nCompany Address：Moomoo Financial Singapore Pte. Ltd. 10 Marina Blvd, Tower 2, #31-01 Marina Bay Financial Centre, 018983\nCopyright © 2026 Moomoo Technologies Inc. All Rights Reserved.", "Content_Length": 3342, "Word_Count": 515, "Image_URLs": ["https://foss-mm-us.moomoo.com/official_config_oss/prod/b9a5cf23-0e1c-4618-b6ea-1386983f8eff", "https://foss-mm-us.moomoo.com/official_config_oss/prod/5e71508f-1510-4870-bf60-fc6cb0c8a025", "https://foss-mm-us.moomoo.com/official_config_oss/prod/1b40bdd9-d11c-4301-b149-e8894277b53d", "https://foss-mm-us.moomoo.com/official_config_oss/prod/64c3939b-4b24-46dd-884c-e2b95044e7cb", "https://foss-mm-us.moomoo.com/official_config_oss/prod/6a5d23d0-6ba3-49cf-9bb9-88c8fbd4a901", "https://foss-mm-us.moomoo.com/official_config_oss/prod/875b7a1d-4fcf-4ecd-a57c-0daf291b5dd0"], "News_URL": "https://www.moomoo.com/stock/01211-HK/forecast", "Scrape_Time_Sec": 10.727244853973389}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-27T09:54:01+00:00", "News_Date_Formatted": "2025-12-27 09:54:01 (GMT+0)", "Week_Num": 6, "News_Title": "Nio moves toward greater reliance on CATL for batteries, report says", "News_Source": "CNEVPOST", "News_Content": "Nio moves toward greater reliance on CATL for batteries, report says\nPhate Zhang • Dec 27, 2025, 5:54 PM GMT+8\n0\n42\nNio and BYD's FinDreams have suspended their battery supply cooperation as L60 orders are insufficient to support multiple suppliers, according to a local media report.\nNio has also increased its reliance on CATL's supply for other batteries used in the Nio brand and Onvo.\n(Nio's third-generation ES8. Image credit: Nio)\nNio Inc (NYSE: NIO, HKG: 9866) introduced new battery suppliers over the past two years to reduce its dependence on CATL (HKG: 3750, SHE: 300750). However, these efforts now appear to be reversing.\nNio has halted battery supply cooperation with BYD's (HKG: 1211, OTCMKTS: BYDDY) FinDreams Battery for its Onvo sub-brand's L60 midsize SUV (sport utility vehicle), as orders are insufficient to sustain multiple suppliers, local media outlet 36Kr reported today citing industry sources.\nAt the same time, for the 100-kWh batteries previously supplied partly by CALB (HKG: 3931) to the Nio main brand, the supplier has now switched to CATL, according to the report.\nJoin us on Telegram or Google News\nFor Onvo's 85-kWh long-range battery, Nio has also brought in CATL as a supplier, with the battery maker set to become the primary supplier for this battery, the report said.\nCATL has been Nio's primary battery supplier since the EV maker's founding in November 2014, serving as its sole supplier for many of its early years.\nThe two companies have maintained a close partnership, jointly establishing Mirattery, or Wuhan Weineng, with other shareholders to manage Nio's battery assets.\nOver the past several years, Nio has introduced new battery suppliers including BYD, CALB, and Sunwoda (SHE: 300207) as new battery suppliers. It also attempted to produce its own battery cells, though this effort was abandoned due to financial constraints.\nRegarding Nio's battery supply situation, rapid changes emerged in 2025. Nio faces operational challenges, including pressure from battery payments, a situation CATL is well aware of, as noted by the 36Kr report.\nCATL has taken steps to support Nio, investing in businesses like Nio Power and Mirattery to alleviate the funding needs of its major client, the report said.\nFor Nio, it has also acted accordingly, proactively increasing its battery supply from CATL, the report noted.\nBeyond investments, CATL is also supporting Nio in product delivery.\nFollowing the strong sales performance of the Onvo L90 and new ES8 models launched in the second half of 2025, CATL prioritized production resources from its Luoyang and Liyang facilities to support Nio's new vehicle deliveries amid tight capacity constraints, 36Kr said.\nHelping Nio navigate these challenges was a clear strategic choice for CATL, the report observed.\nWith annual sales exceeding 200,000 units and battery demand at swap stations, Nio's annual battery procurement could reach 20 GWh, representing a value of at least RMB 10 billion ($1.43 billion), the report noted.\nBeyond its substantial support for Nio, CATL's robust engineering capabilities are also key to securing larger market shares.\nCALB was the preferred supplier for Onvo's 85-kWh battery, but numerous challenges arose during the process from cell production to packaging, shaking Nio's confidence in the partnership, according to 36Kr.\nCATL promptly recognized this opportunity and conducted assessments and preparations after the Chinese New Year this year. By mid-year, after receiving Nio's request, CATL achieved development and delivery within just five months, the report said.\nBy late July, the Onvo L90 equipped with the 85-kWh battery pack was launched with strong initial sales, with CATL's battery supply alleviating Nio's capacity constraints, the report noted.\n\"CATL earned this money through its personnel readiness and engineering capabilities,\" a Nio insider cited by 36Kr said, adding that they had used products from multiple battery manufacturers.\nNio faced battery shortages following the late-September launch of the third-generation Nio ES8 and the late-July rollout of the Onvo L90.\nThis appears to have been swiftly resolved. Earlier this month, Onvo announced plans to double the number of available battery packs at swap stations within one month, indicating sufficient battery supply for vehicle production.\nCATL remains the world's largest battery supplier, maintaining its top position with a 38.1 percent global market share from January to October, according to South Korean market research firm SNE Research. It is the only manufacturer exceeding 30 percent market share.\nMarket share of world's top EV battery makers (Jan-Oct 2025)\n0%\n10%\n20%\n30%\n40%\nCATL\nBYD\nLG Energy Solution\nCALB\nGotion High-tech\nSK On\nPanasonic\nSamsung SDI\nEve Energy\nSvolt\nOthers\nSource: SNE Research\n© CnEVPost\nMarket Share of World's Top EV Battery Makers (Jan-Oct 2025)\nIn China, CATL held a 43.71 percent share of the overall battery market by battery installations in Novemb", "Content_Length": 6089, "Word_Count": 948, "Image_URLs": [], "News_URL": "https://cnevpost.com/2025/12/27/nio-greater-reliance-on-catl-batteries/", "Scrape_Time_Sec": 6.606605291366577}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-21T22:42:13.898474+00:00", "News_Date_Formatted": "2025-12-21 22:42:13 (GMT+0)", "Week_Num": 7, "News_Title": "BYD Company Limited (1211.HK) Analyst Ratings, Estimates & Forecasts - Yahoo Finance", "News_Source": "YAHOO", "News_Content": "Summary\nNews\nChart\nConversations\nStatistics\nHistorical Data\nProfile\nFinancials\nAnalysis\nOptions\nHolders\nHKSE - Delayed Quote\n•\nHKD\nBYD Company Limited (1211.HK)\nFollow\nGet top stock picks\n97.750\n-4.050\n(-3.98%)\nAt close: January 30 at 4:08:02 PM GMT+8\nEarnings Trends: 1211.HK\nEarnings Per Share\nGAAP\nNormalized\nQ4 FY24\nEstimate\n+1.57\nActual\n+1.43\nRevenue vs. Earnings\nAnnual\nQuarterly\nQ3 FY25\nRevenue\n194.98B\nEarnings\n--\nQ4\nFY24\nQ1\nFY25\nQ2\nFY25\nQ3\nFY25\n0\n50B\n100B\n150B\n200B\n250B\nEarnings Estimate\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nNo. of Analysts 2 1 9 10\nAvg. Estimate 1.28 0.22 3.9 5.18\nLow Estimate 1.17 0.22 3.22 4.46\nHigh Estimate 1.39 0.22 4.59 5.92\nYear Ago EPS 1.72 1.04 4.24 3.9\nRevenue Estimate\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nNo. of Analysts 3 1 27 29\nAvg. Estimate 256.25B 158.97B 854.68B 1.01T\nLow Estimate 239.99B 158.97B 765.28B 877.37B\nHigh Estimate 284.75B 158.97B 988.08B 1.17T\nYear Ago Sales 274.85B 170.36B 777.1B 854.68B\nSales Growth (year/est) -6.77% -6.69% 9.98% 17.90%\nEarnings History\nCurrency in CNY 12/31/2024 3/31/2025 9/30/2025\nEPS Est. 1.57 0.85 1.17\nEPS Actual 1.43 1.04 0.85\nDifference -0.15 0.19 -0.32\nSurprise % -9.36% 22.35% -27.35%\nEPS Trend\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nCurrent Estimate 1.28 0.22 3.9 5.18\n7 Days Ago 1.34 0.3 3.9 5.17\n30 Days Ago 1.34 0.3 3.92 5.24\n60 Days Ago 1.39 0 3.95 5.23\n90 Days Ago 1.55 0 4.47 5.78\nEPS Revisions\nCurrency in CNY Current Qtr. (Dec 2025) Next Qtr. (Mar 2026) Current Year (2025) Next Year (2026)\nUp Last 7 Days -- 1 -- 1\nUp Last 30 Days -- -- -- --\nDown Last 7 Days 1 -- 1 --\nDown Last 30 Days 1 -- 1 1\nGrowth Estimates\nSymbol Current Qtr. Next Qtr. Current Year Next Year\n1211.HK -- -- -7.88% 32.69%\nS&P 500 10.49% 10.30% 15.58% 15.26%\nRelated Tickers\n0175.HK\nGeely Automobile Holdings Limited\n16.090\n-4.23%\n  9868.HK\nXPeng Inc.\n71.650\n-1.71%\n  9866.HK\nNIO Inc.\n38.620\n+3.65%\n  XPEV\nXPeng Inc.\n17.98\n-3.31%\n  2015.HK\nLi Auto Inc.\n65.950\n-2.58%\n  VOW3.DE\nVolkswagen AG\n102.50\n-1.01%\n  9973.HK\nChery Automobile Co., Ltd.\n28.380\n+0.35%\n  2333.HK\nGreat Wall Motor Company Limited\n13.250\n-2.21%\n  LI\nLi Auto Inc.\n16.63\n-3.65%\n  7203.T\nToyota Motor Corporation\n3,504.00\n+1.62%\n  Copyright © 2026 Yahoo. All rights reserved.\nWhat's trending\nDow Jones\nS&P 500\nDAX Index\nNvidia\nTesla\nDJT\nTariffs\nExplore more\nMortgages\nCredit Cards\nSectors\nCrypto Heatmap\nFinancial News\nAbout\nData Disclaimer\nHelp\nFeedback\nSitemap\nLicensing\nWhat's New\nAbout Our Ads\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard\nU.S. markets closed\nUS\nEurope\nAsia\nCryptocurrencies\nRates\nCommodities\nCurrencies\nS&P 500\n6,939.03\n-29.98\n(-0.43%)\nDow 30\n48,892.47\n-179.09\n(-0.36%)\nNasdaq\n23,461.82\n-223.30\n(-0.94%)\nRussell 2000\n2,626.55\n-28.23\n(-1.06%)\nVIX\n17.01\n+0.13\n(+0.77%)\nGold\n5,067.50\n-287.30\n(-5.37%)\nTrending tickers\nBTC-USD\nBitcoin USD\n77,483.59\n-3,456.90\n(-4.27%)\nETH-USD\nEthereum USD\n2,340.64\n-182.92\n(-7.25%)\nXRP-USD\nXRP USD\n1.60\n-0.02\n(-1.08%)\nSOL-USD\nSolana USD\n102.22\n-6.81\n(-6.25%)\nBTC-CAD\nBitcoin CAD\n105,567.52\n-4,709.85\n(-4.27%)\nPortfolio\nSign in to access your portfolio\nSign in\nTop gainers\nPHOE\nPhoenix Asia Holdings Limited\n133.12\n+120.99\n(+997.44%)\nTCGL\nTechCreate Group Ltd.\n172.84\n+69.50\n(+67.25%)\nRHI\nRobert Half Inc.\n34.61\n+7.53\n(+27.83%)\nDECK\nDeckers Outdoor Corporation\n119.34\n+19.47\n(+19.50%)\nVZ\nVerizon Communications Inc.\n44.52\n+4.71\n(+11.82%)\nTop losers\nPFSI\nPennyMac Financial Services, Inc.\n99.92\n-49.43\n(-33.10%)\nPSLV\nSprott Physical Silver Trust\n26.41\n-9.89\n(-27.24%)\nU\nUnity Software Inc.\n29.10\n-9.28\n(-24.19%)\nNG\nNovaGold Resources Inc.\n8.73\n-2.27\n(-20.64%)\nCVCO\nCavco Industries, Inc.\n492.02\n-125.48\n(-20.32%)\nMost active\nHBAN\nHuntington Bancshares Incorporated\n17.48\n+0.19\n(+1.10%)\nNVDA\nNVIDIA Corporation\n191.13\n-1.38\n(-0.72%)\nPLUG\nPlug Power Inc.\n2.1150\n-0.2250\n(-9.62%)\nSOFI\nSoFi Technologies, Inc.\n22.81\n-1.55\n(-6.36%)\nINTC\nIntel Corporation\n46.47\n-2.19\n(-4.50%)\nEarnings events\nUpcoming\nFEB\n02\nDIS\nThe Walt Disney Company\nFEB\n03\nPLTR\nPalantir Technologies Inc.\nMRK\nMerck & Co., Inc.\nPEP\nPepsiCo, Inc.\nPFE\nPfizer Inc.\nEdit your Dock\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 4249, "Word_Count": 674, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/quote/1211.HK/analysis/", "Scrape_Time_Sec": 10.759511470794678}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-14T22:42:13.898474+00:00", "News_Date_Formatted": "2025-12-14 22:42:13 (GMT+0)", "Week_Num": 8, "News_Title": "BYD stock forecast: Third-party price target", "News_Source": "CAPITAL", "News_Content": "BYD stock forecast: Third-party price target\nBYD’s share price continues to draw attention as traders and analysts track shifts in the electric vehicle market and the company’s latest performance data.\n1211 +0.2%\nBy Dan Mitchell\n18:03 (UTC), 8 December 2025 Updated\nYD Auto Signage Logo on Top of Glass Building. Workplace Car Company Office Headquarter. Photo: askarim / Shutterstock.com\nBYD Company (1211) is trading around $98.20 HKD per share in Hong Kong dollar terms as of 10:39am on 3 December 2025 (UTC), moving within an intraday range of $97.70 HKD to $101.25 HKD on Capital.com’s share CFD feed. Past performance is not a reliable indicator of future results.\nThe stock is trading amid mixed sector and company news, with recent data showing BYD’s November new energy vehicle sales down about 5% year-on-year as competition in China’s EV market intensifies (CnEVPost, 1 December 2025), while exports of over 130,000 units have provided some offset (Shanghai Metals Market, 2 December 2025).\nPast performance is not a reliable indicator of future results.\nBYD stock forecast 2026–2030: Analyst price targets\nAnalyst price targets compiled between October and December 2025 span a range of price targets. These figures are indicative opinions rather than guarantees, and they reflect assumptions about electric vehicle demand, competitive pricing, policy support and BYD’s expansion outside China over the coming year.\nInvesting.com (consensus screen)\nThe latest BYD Co Ltd-H consensus on the Investing.com equity forecast page shows an average 12-month target of about $132.73 HKD per share, with individual analyst estimates ranging roughly from $90.03 HKD on the low side to $175.50 HKD on the high side as of late 2025. The platform attributes this range to input from analysts over the prior three months, amid expectations that BYD may sustain earnings and revenue growth against a backdrop of heightened competition in the EV market (Investing.com, 3 December 2025).\nCMB International (company update)\nCMB International’s 31 October 2025 company update on BYD trims its H-share target price to $125 HKD, maintaining a positive rating while basing the valuation on a 20-times multiple of projected 2027 earnings per share. The research team cites slower-than-expected margin recovery, currency effects and a more competitive plug-in hybrid landscape, while still flagging BYD’s technology roadmap and overseas expansion as key supports for medium-term profitability (CMBI, 31 October 2025).\nGoldman Sachs relay (broker note summary)\nA news summary carried by Intellectia on 2 November 2025 reports that Goldman Sachs lifted its target price for BYD Company to $141 HKD, describing the move as an 8% increase while keeping a positive stance on the stock. The bank’s analysts highlight expectations that overseas markets could increasingly drive unit volumes between 2026 and 2035, with EV penetration outside China expected to catch up over time and underpin their long-run sales and earnings assumptions (Intellectia AI, 4 November 2025).\nTipRanks (aggregated broker data)\nA BYD price-target snapshot on TipRanks dated 20 October 2025 points to an average 12-month goal close to $135.02 HKD, with the highest individual forecast cited around $173.73 HKD and the lowest just above $79 HKD. The service describes a strongly positive analyst rating skew, as contributors emphasise BYD’s delivery growth and platform technology amid uncertainties around global demand, pricing strategies and policy support (TipRanks, 3 December 2025).\nAcross these sources, third-party 12-month BYD price forecasts span roughly from $79 HKD to the $175 HKD, with common themes around EV demand, competitive pricing dynamics, technology investment and the pace of overseas expansion.\nPredictions and third-party forecasts are inherently uncertain, as they cannot fully account for unexpected market developments. Past performance is not a reliable indicator of future results.\nBYD stock price: Technical overview\nThe BYD stock price is around $98.20 HKD as of 10:39 (UTC) on 3 December 2025, with price holding close to the Classic pivot at 97.7 after testing an intraday range between 97.7 and 101.25 in the session. On the daily chart, the simple moving-average cluster sits with the 20/50/100/200-DMAs near 98, 103, 109 and 119 respectively, while the 10-day SMA around 96.8 and VWMA(20) near 97.9 keep the price consolidated just under the shorter-term band. The 14-day RSI at 47.1 is mid-neutral and the ADX at 12.8 points to a weak trend environment, consistent with range-bound trading conditions rather than a directional impulse in the current setup.\nOn the topside, the nearest Classic resistance is R1 at 103.1, with R2 around 108.8 coming into view only if a daily close forms above the lower resistance area. On pullbacks, the Classic pivot at 97.7 is the first support to watch, followed by the 100-day SMA near 109.1 as the main moving-average shelf, while a decisive break below the pivot w", "Content_Length": 8756, "Word_Count": 1371, "Image_URLs": ["https://img.capital.com/imgs/articles/1920x1140x0/shutterstock_1919639507.jpg", "https://img.capital.com/articles/articleimg_8065f526bb6c825afcab7aeb73c8de8593704dcc.png"], "News_URL": "https://capital.com/en-int/analysis/byd-stock-forecast-what-is-next-for-the-chinese-ev-maker", "Scrape_Time_Sec": 3.046642303466797}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-14T22:42:13.898474+00:00", "News_Date_Formatted": "2025-12-14 22:42:13 (GMT+0)", "Week_Num": 8, "News_Title": "China's car sales extend decline in November in biggest drop in 10 months", "News_Source": "THESTANDAR", "News_Content": "News\nComment\nBusiness & Innovation\nProperty\nRacing\nEducation\nArts & Lifestyle\nEntertainment\nMore\nePaper\nBUSINESS & INNOVATION\nMARKET\nChina's car sales extend decline in November in biggest drop in 10 months\nMARKET\n08-12-2025 17:26 HKT\nNew cars are stored at a parking lot in Shanghai, China, September 8, 2025. REUTERS\nChina's annual car sales dropped 8.5 percent in November in a second straight monthly decline, for their biggest fall in 10 months, data showed on Monday, amid a waning scramble to buy vehicles before government subsidies dwindle at year-end.\nCar sales in the world's biggest auto market stood at 2.24 million last month, following October's slide of 0.8 percent, according to the data from the China Passenger Car Association.\nThe deeper slide was \"abnormal,\" as sales have generally been quite strong in the years' final two months, said Cui Dongshu, the industry body's secretary-general, but evoked conditions 17 years ago.\n\"A similar abnormality occurred in 2008 when consumption was under pressure,\" he added.\nSales of electric vehicles and plug-in hybrids made up a record 58.9 percent of total car sales. Subsidised auto trade-ins in favour of EVs and PHEVs exceeded 11.2 million units in the first 11 months, official data showed.\nReduced government subsidies near the end of the year are seen denting consumer sentiment nationwide.\nAdditionally, a big fall in gasoline car sales and a high base last year were attributed to the fall in overall sales last month, according to Cui, expecting full-year sales to grow by 5 percent.\nCar sales are forecast to be largely flat in 2026 when competition in China becomes even stiffer, with \"a possible all-time high number of new models\", CMBI analysts said in a note.\nTo spur sales before purchase-tax breaks for EVs and PHEVs halve from 2026, many automakers have also rolled out subsidies of up to 15,000 yuan (HK$16,509) for orders before year-end which may not get delivered until next year.\nAs woes over overcapacity and excessive competition mount, Beijing has dropped EVs from a list of strategic industries in a roadmap for the next five years, signalling perhaps a more challenging time ahead.\nEntangled in a battle in the budget segment with rivals such as Geely (0175) and Leapmotor (9863), whose sales kept hitting new highs, domestic EV giant BYD (1211) ended November with lower sales than the year before.\nIt was BYD's third month of declining sales globally, despite record overseas shipments last month. It has achieved 91 percent of a trimmed sales target for this year.\nTesla's sales in China rose to 73,145 units last month after October's fall to a three-year low of 26,006.\nIts aggressive new rival Xiaomi (1810) delivered more than 40,000 EVs for a third consecutive month, having already met an annual sales target of 350,000 vehicles.\nOverall car export growth soared to 52.4 percent from 27.7 percent in October.\nThe majority of China's car export growth is expected to come from EVs and PHEVs next year, their exports rising 40 percent from this year to a projected 2.83 million vehicles, CMBI estimates.\nReuters\n car\nsales\nChina\ndrop\nauto\nmarket\nDownload The Standard app to stay informed with news, updates, and significant events:\nhttps://www.thestandard.com.hk/appdownload\n  by Taboola\nYou May Like\n五年來黃金投資最佳時機，就是現在！\nIC Markets\n|\nSponsored\n了解更多\nEx-husband of butchered Hong Kong model Abby Choi arrested in Tung Chung\nThey Were So Beautiful Before; Now Look At Them; Number 10 Will Shock You.\nGames Waka\n|\nSponsored\nTop News\nEx-chief secretary Rafael Hui dies at 77 due to health issues\nBREAKING NEWS\n28 mins ago\nRosanna Law anticipates over 50 million visitors in 2026, optimistic about Chinese New Year tourism\nHONG KONG NEWS\n7 hours ago\nHK to expand youth access to global internships and conferences, Alice Mak says\nHONG KONG NEWS\n4 hours ago\nHundreds flock to On King Street Park as cherry blossoms reach full bloom\nHONG KONG NEWS\n5 hours ago\nPolice probe over 70 new traffic-related frauds, with a claimant reporting 'neck injuries' 20 times\nHONG KONG NEWS\n8 hours ago\nMarius Hoiby, the 'almost royal' tarnishing Norway's crown\nWORLD NEWS\n6 hours ago\nRead More\nHong Kong's public finance, retail sales improving, Paul Chan says\nMARKET\n4 hours ago\nTrump says he welcomes Chinese investment in Venezuelan oil\nWORLD NEWS\n7 hours ago\nChina's corruption watchdog probing emergency management minister\nCHINA NEWS\n31-01-2026 16:53 HKT\nSciwind Biosciences diabetes drug approved in China\nCHINA NEWS\n30-01-2026 15:20 HKT\nChina plans 200 billion yuan capital injection into biggest insurers, Bloomberg News reports\nMARKET\n30-01-2026 15:03 HKT\nChina conditionally approves DeepSeek to buy Nvidia's H200 chips\nCHINA NEWS\n30-01-2026 14:16 HKT\nUS lawmakers say Nvidia AI tech 'powering China's military'\nCHINA NEWS\n30-01-2026 13:49 HKT\nEileen Gu - Olympic champion who bestrides rivals US, China\nCHINA NEWS\n30-01-2026 11:23 HKT\nTrump warns Britain on China ties as Starmer hails progress in Beijing\nCHINA N", "Content_Length": 6438, "Word_Count": 1043, "Image_URLs": ["https://www.thestandard.com.hk/_next/static/media/more_arrow_bt.671f0812.png", "https://www.thestandard.com.hk/_next/static/media/Flippingbook.297281dc.png", "https://www.thestandard.com.hk/_next/static/media/Search_white.425b07fe.png", "https://www.thestandard.com.hk/_next/static/media/menu_youtube.454d42d0.png", "https://www.thestandard.com.hk/_next/static/media/menu_flipping_version.1237fa95.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_increase.f9ae48f6.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_decrease.c19f90ee.png", "https://www.thestandard.com.hk/_next/static/media/printer.a8900506.png", "https://image.hkstandard.com.hk/f/1024p0/0x0/100/none/8cb7ce4a1c94dff9f2d00ff4c078f59e/2025-10/WhatsApp_Image_2025-10-13_at_11_21_48_1_.jpeg", "https://www.thestandard.com.hk/_next/static/media/whatsapp.2df4fc9c.png", "https://www.thestandard.com.hk/_next/static/media/x.479884fe.png", "https://www.thestandard.com.hk/_next/static/media/email.22f696fe.png", "https://www.thestandard.com.hk/_next/static/media/link.0fdd3fbe.png", "https://image.hkstandard.com.hk/f/1024p0/0x0/100/none/56093513701c8700e5bf6a074ebc87b1/2026-01/WhatsApp_Image_2025-11-10_at_15_07_58.jpeg"], "News_URL": "https://www.thestandard.com.hk/market/article/318758/Chinas-car-sales-extend-decline-in-November-in-biggest-drop-in-10-months", "Scrape_Time_Sec": 7.367898941040039}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-24T06:53:38+00:00", "News_Date_Formatted": "2025-11-24 06:53:38 (GMT+0)", "Week_Num": 10, "News_Title": "BYD leads global BEV market with 15.4% share in Q3, followed by Tesla at 13.4%", "News_Source": "CNEVPOST", "News_Content": "BYD leads global BEV market with 15.4% share in Q3, followed by Tesla at 13.4%\nLei Kang • Nov 24, 2025, 2:53 PM GMT+8\n5\n8\nBYD retained its position as the top BEV seller in the third quarter with a 15.4 percent global share, though sales declined compared to the second quarter.\nIn the global PHEV market, BYD maintained its leading position with a 27.9 percent market share.\n(A BYD Dolphin displayed at the Shanghai auto show in April 2025. Image credit: CnEVPost)\nBYD (HKG: 1211, OTCMKTS: BYDDY) and Tesla (NASDAQ: TSLA) continued to dominate the global battery electric vehicle (BEV) market last quarter, according to a new report.\nBYD retained its position as the top BEV seller in the third quarter with a 15.4 percent global share, though sales declined compared to the second quarter, per a report released today by market research firm TrendForce.\nTesla ranked second with a 13.4 percent share, posting robust third-quarter sales growth of 29 percent quarter-on-quarter, the report said\nJoin us on Telegram or Google News\nBYD, which produces BEVs and plug-in hybrid electric vehicles (PHEVs), sold 582,522 passenger BEVs in the third quarter -- a 31.37 percent year-on-year increase but a 4.03 percent decline from the second quarter -- according to data compiled by CnEVPost.\nTesla, which only produces BEVs, delivered 497,099 vehicles globally in the third quarter, a 7.39 percent year-on-year increase and a 29.41 percent rise from the second quarter.\nTesla's growth momentum primarily stemmed from stimulus driven by US market subsidy deadlines and achieving quarterly growth in the Chinese market, TrendForce noted.\nGeely Auto (HKG: 0175, OTCMKTS: GELYF) and Leapmotor (HKG: 9863) demonstrated remarkable growth momentum in the third quarter, capturing 6 percent and 4.1 percent market share respectively, according to the report.\nXpeng (NYSE: XPEV, HKG: 9868) ranked sixth in the global BEV market with a 3.1 percent share in the third quarter, while Xiaomi (HKG: 1810, OTCMKTS: XIACY) placed eighth with a 2.9 percent share.\nIn the global PEHV market, BYD maintained its leading position with a 27.9 percent share.\nFacing market saturation and intense competition in China, BYD saw sequential sales growth in the third quarter but experienced a year-on-year decline, TrendForce noted.\nBYD's third-quarter passenger PHEV sales totaled 523,069 units, down 23.73 percent year-on-year despite a 0.56 percent increase from the second quarter, according to data compiled by CnEVPost.\nAito, Chery (HKG: 9973), and Geely rose to second, third, and fourth place respectively. Chery's sales growth was particularly rapid, increasing its market share to 6.6 percent in the third quarter, TrendForce noted.\nLi Auto (NASDAQ: LI, HKG: 2015), despite securing second place in second-quarter sales, saw its market share rapidly eroded amid intensifying competition from increasingly more carmakers launching extended-range electric vehicle (EREV) models. Its third-quarter sales declined both sequentially and year-on-year, the report said.\nLi Auto delivered 93,211 vehicles in the third quarter, down 39.01 percent year-on-year and down 16.08 percent quarter-on-quarter.\nGlobal new energy vehicle (NEV) sales reached 5.39 million units in the third quarter, a 31 percent year-on-year increase, according to TrendForce.\nBEV sales reached 3.71 million units, up 48 percent year-on-year, while PHEV sales totaled 1.67 million units, rising 4 percent year-on-year.\nTrendForce projects global NEV sales to reach 20.43 million units in 2025, representing about 25 percent year-on-year growth.\nGlobal NEV sales are projected to reach 22.8 million units in 2026, representing a 12 percent year-on-year increase, TrendForce said.\nBYD aims for up to 1.6 million overseas sales in 2026, Citi says\nBYD's overseas sales target for 2026 is 1.5-1.6 million vehicles, with growth primarily driven by new model launches, Citi said.\nBYD\nNov 11, 2025\nBYDTesla\nBYD News Alert\nSubscribe to receive email notifications immediately when new articles about BYD are published.\n✓\nBYD\nView more channels\nSubscribe\nAbout Author\nLei Kang\nLei Kang joined CnEVPost in October 2022 and has been sharing exciting things about the EV industry in China since then. Contact the team: phate@cnevpost.com.", "Content_Length": 4267, "Word_Count": 659, "Image_URLs": [], "News_URL": "https://cnevpost.com/2025/11/24/byd-leads-global-bev-market-q3-2025-followed-tesla/", "Scrape_Time_Sec": 7.680065393447876}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-30T22:42:13.898474+00:00", "News_Date_Formatted": "2025-11-30 22:42:13 (GMT+0)", "Week_Num": 10, "News_Title": "BYD's Oct Registrations in Europe Jump 206.8%, While Tesla Slips 48.5%", "News_Source": "MOOMOO", "News_Content": "Investments\nFeatures\nPricing\nPromotion\nInstitutions\nPrivate Wealth\nSupport\nAbout us\nDownload\nSign up/Log in\nEnjoy\nup to S$1190*\nOpen Account\nHeadlines\nBYD's Oct Registrations in Europe Jump 206.8%, While Tesla Slips 48.5%\nBYD's Oct Registrations in Europe Jump 206.8%, While Tesla Slips 48.5%\nCnEVPost\n· \nNov 25, 2025 14:21\nBYD COMPANY\n-3.98%\nBYDDY\n-4.40%\nTSLA\n+3.32%\nBYD Company Limited\n-1.54%\nBYD's new vehicle registrations in Europe reached 17,470 units in October, while Tesla's dropped to 6,964 units.\nFrom January to October, BYD's new vehicle registrations in Europe totaled 138,390 units, compared to Tesla's 180,688 units.\n(File photo shows a BYD Yuan Plus. Image credit: CnEVPost)\nBYD (HKG: 1211, OTCMKTS: BYDDY) maintained robust sales growth in Europe last month, while Tesla (NASDAQ: TSLA) continued its decline.\nBYD's new vehicle registrations in Europe reached 17,470 units in October, a 206.8 percent increase from 5,695 units in the same period last year, according to data released today by the European Automobile Manufacturers Association (ACEA).\nThe data covers the European Union plus Iceland, Liechtenstein, Norway, Switzerland, and the United Kingdom (EU + EFTA + UK).\nJoin us on Telegram or Google News\nTesla's new vehicle registrations in Europe for October totaled 6,964 units, a 48.5 percent decrease from 13,519 units in the same period last year.\nWithin the EU, BYD's October registrations reached 13,350 units, a 195.0 percent increase from 4,525 units in the same period last year.\nTesla's October registrations in the EU totaled 9,426 units, a 9.0 percent decline from 10,360 units in the same period last year.\nFrom January to October, BYD's new vehicle registrations in Europe totaled 138,390 units, a 285.0 percent increase from 35,949 units during the same period last year.\nTesla's new vehicle registrations in Europe for the first ten months came in at 180,688 units, a 29.6 percent decrease from 256,495 units during the same period last year.\nIn the EU, BYD's new vehicle registrations from January to October reached 94,216 units, a 239.6 percent increase compared to 27,741 units during the same period last year.\nTesla's new vehicle registrations in the EU from January to October totaled 117,000 units, a 39.2 percent decrease compared to 192,439 units during the same period last year.\nBYD leads global BEV market with 15.4% share in Q3, followed by Tesla at 13.4%\nBYD retained its position as the top BEV seller in the third quarter with a 15.4 percent global share, though sales declined compared to the second quarter.\nBYD\nNov 24, 2025\nDisclaimer: This content is for informational and educational purposes only and does not constitute a recommendation or endorsement of any specific investment or investment strategy. Read more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLike\n1\nViews 278\nRecommended\nMicrosoft, Apple, Meta And More Make Headlines: This Week In Tech\nBenzinga\n·\n40m\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nBenzinga\n·\n23m\nWhy I'm Getting a Home Battery Backup Before the Next Outage -- WSJ\nWSJ\n·\n45m\nThe Silver Market Is Messed Up. These Buyers Are Feeling the Pain. -- WSJ\nWSJ\n·\n18:30\nInternational Human Resources Co. Lands SAR9.4 Million Outsourcing Services Deal\nMT Newswires\n·\n18:31\nWrite a comment\n1\n\nMarket Insights\nGold\nNo.\nSymbol\n20D % Chg\nSample Name\nSample Code\n+264.36%\nSample Name\nSample Code\n+77.00%\nSample Name\nSample Code\n+57.13%\n4\nBlue Gold\nBGL\n+50.00%\n5\nParamount Gold Nevada\nPZG\n+40.48%\nView More\nMeet Smarter Moomoo AI\nARK ETFs\nThe ARK ETFs concept includes several ETFs across different strategies managed by ARK Invest. ARK Invest is an investment firm founded by Cathie Wood.\nNo.\nSymbol\n20D % Chg\nSample Name\nSample Code\n+10.39%\nSample Name\nSample Code\n+8.08%\nSample Name\nSample Code\n+5.04%\n4\nThe 3D Printing ETF\nPRNT\n+2.15%\n5\nARK Israel Innovative Technology ETF\nIZRL\n+1.47%\nUnlock Now\n- No more -\nCustomer Service\n+65 6321 8888\nTrading days: 24 hours\nNon-trading days: 9:30 - 21:30 SGT\nclientservice@sg.moomoo.com\nAbout moomoo\nAbout moomoo\nInfluencer Program\nInvestor Relations\nMedia Relations\nScam Awareness\nTerms & Conditions\nPrivacy Policy\nTerms of Use\nBroker Disclosure\nBest Execution Policy\nLicensed Entities*\nYour Privacy Choices\nCareers / Contact:\nApply Now\ncareer@sg.moomoo.com\nFollow us on\nMoomoo Stores\n313 @somerest\nJem\nAddress:\n313 Orchard Road #B2-14 & #B2-53/53A, 313@somerset, Singapore 238895\nOpening Hours:\n10:00 - 22:00 SGT\n\n\nThe moomoo app is an online trading platform offered by Moomoo Technologies Inc. In Singapore, securities and brokerage services are provided by Moomoo Financial Singapore Pte. Ltd., regulated by the Monetary Authority of Singapore (MAS) under a Capital Markets Services Licence (CMS101000), a Major Payment Institution Licence (PS20200617), and with Exempt Financial Adviser Status.\nMoomoo Financial Singapore Pte. Ltd. does not solicit or market in jurisdictions such as China or others where its services are not permitted.", "Content_Length": 5378, "Word_Count": 844, "Image_URLs": ["https://pubimg.futunn.com/2022050900000199ec990cc001a.jpg?imageMogr2/thumbnail/76x76!/ignore-error/1/format/webp", "https://foss-mm-us.moomoo.com/official_config_oss/prod/b9a5cf23-0e1c-4618-b6ea-1386983f8eff", "https://foss-mm-us.moomoo.com/official_config_oss/prod/5e71508f-1510-4870-bf60-fc6cb0c8a025", "https://foss-mm-us.moomoo.com/official_config_oss/prod/1b40bdd9-d11c-4301-b149-e8894277b53d", "https://usnewsfile.moomoo.com/public/MM-PersistNewsContentImage/7781/20251125/61997270-0-0dcc10643ce006869d9605c494f24bbb.jpg/big?imageMogr2/quality/minsize/1/ignore-error/1/format/webp", "https://record.moomoo.com/news-editor-imgs/20260201/public/17699571012069038883491.png?imageMogr2/quality/minsize/1/ignore-error/1/format/webp", "https://usnewsfile.moomoo.com/public/MM-PersistNewsContentImage/7781/20251125/61997270-1-347c310560c8ce6f2f06f43be2c25d63.jpg/big?imageMogr2/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/20220512034323915718aa92946.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/20220509000001723ec64e8d0f7.png?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/202205090000014815324d62ed6.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/2022050900000203bfee0cc4562.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/2022050900000213c4b25fbd0cb.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://foss-mm-us.moomoo.com/official_config_oss/prod/64c3939b-4b24-46dd-884c-e2b95044e7cb", "https://foss-mm-us.moomoo.com/official_config_oss/prod/6a5d23d0-6ba3-49cf-9bb9-88c8fbd4a901", "https://foss-mm-us.moomoo.com/official_config_oss/prod/875b7a1d-4fcf-4ecd-a57c-0daf291b5dd0"], "News_URL": "https://www.moomoo.com/news/post/61997270/byd-s-oct-registrations-in-europe-jump-206-8-while", "Scrape_Time_Sec": 4.809608459472656}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-12T03:35:25+00:00", "News_Date_Formatted": "2025-11-12 03:35:25 (GMT+0)", "Week_Num": 12, "News_Title": "Automakers' share of China NEV market in Oct: BYD leads with 23.1%, Tesla drops out of top 10", "News_Source": "CNEVPOST", "News_Content": "Automakers' share of China NEV market in Oct: BYD leads with 23.1%, Tesla drops out of top 10\nPhate Zhang • Nov 12, 2025, 11:35 AM GMT+8\n2\n11\nTesla's share of China's NEV market in October stood at 2.03 percent, dropping out of the top 10 for the first time since August 2022.\nBYD's October share was lower than September's 26.7 percent and also below the 36.1 percent recorded in the same month last year.\nBYD (HKG: 1211) maintained its position as China's largest new energy-vehicle (NEV) maker in October, while Tesla (NASDAQ: TSLA) dropped out of the top 10 in retail sales for the first time in three years.\nBYD's passenger NEV retail sales in October totaled 295,871 units, down 31.4 percent year-on-year and down 14.8 percent month-on-month, according to rankings released Tuesday by the China Passenger Car Association (CPCA).\nJoin us on Telegram or Google News\nThe company maintained its top position with a 23.1 percent market share in October, down from 26.7 percent in September and below the 36.1 percent share recorded in the same period last year.\nTesla's October retail sales in China came in at 26,006 units, marking its lowest level since November 2022, according to data released by the CPCA on November 10.\nThe US electric vehicle (EV) maker's share of China's NEV market in October was 2.03 percent, the lowest since August 2022, data compiled by CnEVPost show.\nThis resulted in Tesla falling out of the top 10 in CPCA's monthly NEV retail sales rankings for the first time since August 2022.\nGWM (HKG: 2333), occupying the final spot in October's NEV retail top 10, achieved a 3.2 percent share with 41,005 NEV sales.\nGeely Auto (HKG: 0175) recorded NEV retail sales of 164,256 units in October, marking a 54.7 percent year-on-year increase and a 9.1 percent rise from September.\nIts 12.8 percent market share in October maintained its second-place ranking in NEV retail sales, up from 11.6 percent in September.\nIn China, NEVs include plug-in hybrid electric vehicles (PHEVs), battery electric vehicles (BEVs), and fuel cell vehicles.\nBYD and Geely produce both BEVs and PHEVs, while Tesla only makes BEVs.\nSAIC-GM-Wuling ranked third in China's NEV market in October with 99,752 NEV retail sales and a 7.8 percent share.\nXiaomi EV came in eighth in the top 10 NEV retail sales list, securing a 3.8 percent share with 48,654 units sold.\nIn August, Xiaomi EV first entered the list with 36,396 units sold and a 3.3 percent share.\nLike Tesla, Xiaomi EV's current models -- the SU7 sedan series and YU7 SUV (sport utility vehicle) -- are all BEVs.\nFrom January to October, BYD led China's NEV market with 2,838,110 retail sales and a 28.0 percent market share.\nGeely ranked second in China's NEV market during the same period, achieving 1,256,404 NEV retail sales and a 12.4 percent market share.\nChangan ranked third in China's NEV market from January to October with 663,179 NEV sales and a 6.5 percent market share.\nTesla ranked fifth in China's NEV market in the January to October period with 458,710 retail sales and a 4.5 percent market share.\nIn the overall passenger vehicle market including traditional internal combustion engine vehicles, BYD ranked first in retail sales in October with a 13.2 percent market share.\nGeely ranked second in October with 265,565 units sold and an 11.8 percent market share.\nFAW-Volkswagen ranked third with 136,002 units sold and a 6.0 percent market share.\nTesla preparing lower-priced Model 3 and Model Y in China, production expected in 2026, report says\nBoth new projects have now entered the validation testing phase, according to a report by 36kr.\nTesla\nOct 14, 2025\nBYDCPCACPCA RankingEV DataMonthly DataTesla\nTesla News Alert\nSubscribe to receive email notifications immediately when new articles about Tesla are published.\n✓\nTesla\nView more channels\nSubscribe\nAbout Author\nPhate Zhang\nPhate is the founder and main author of CnEVPost. He has been reporting since 2009, mainly on macroeconomics and capital markets. He started his career at China Daily and Reuters. Contact via: phate@cnevpost.com.", "Content_Length": 4069, "Word_Count": 676, "Image_URLs": [], "News_URL": "https://cnevpost.com/2025/11/12/automakers-share-china-nev-market-oct-2025/", "Scrape_Time_Sec": 3.6214025020599365}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-05T00:28:55+00:00", "News_Date_Formatted": "2026-01-05 00:28:55 (GMT+0)", "Week_Num": 4, "News_Title": "Cheng-Tech motors into crowded self-driving field", "News_Source": "THEBAMBOOW", "News_Content": "Cheng-Tech motors into crowded self-driving field\nJanuary 5, 2026\nThe millimeter-wave radar maker, led by a former Huawei employee as its founder, has filed for a Hong Kong IPO\nKey Takeaways:\nCheng-Tech has filed to list in Hong Kong, reporting its revenue surged 464% in the first half of last year, though it remained in the red\nThe millimeter-wave radar maker faces risks from reliance on a single client, and is making efforts to diversify\n   By Bai Xin Rui\nAs autonomous driving gains speed and acceptance, key components are fueling the technology’s rise. While cameras and light detection and ranging (LiDAR) are among the higher-profile of those, Shenzhen Cheng-Tech Co. Ltd. hopes to impress investors with its status as China’s third-largest maker of automotive millimeter-wave radar, as it revs up for a Hong Kong IPO. The company aims to capitalize on current enthusiasm for technology stocks, including a growing number engaged in autonomous driving, as Hong Kong experiences one of its hottest IPO markets in years.\nCheng-Tech has some strong credentials in the smart car space, established in 2016 by former Huawei worker Chen Chengwen, and Zhou Ke, who possesses over 20 years of experience in automotive electronics. The company began mass deliveries of its corner radars for passenger vehicles in 2020. A year later it secured designation as a Tier-1 supplier for a German automaker. In 2022, it won orders from a leading domestic OEM after being named as a designated supplier.\nThe company has also signed on multiple investors since its founding, including listed companies Ningbo Shanshan and Beijing Xinleineng Technology, among others. Chairman Chen is currently its largest shareholder with a 15.48% stake.\nThe company’s primary product, millimeter-wave radar, functions as a non-contact sensor that emits radio wave signals. It then receives those signals when they bounce back and processes them to detect targets and determine a car’s spatial position, movement direction, speed, distance, and surrounding objects.\nWhile many autonomous vehicles are typically equipped with cameras and LiDAR, millimeter-wave radar can operate effectively under all weather conditions. It also offers strong anti-interference capabilities and penetrative properties. Those factors, combined with growing cost effectiveness, are making the technology an increasingly important component in autonomous driving perception systems.\nThe millimeter-wave radar industry chain comprises upstream, midstream and downstream segments. The upstream consists mostly of components, including radio frequency front-end modules (MMIC), digital signal processors (DSP/FPGA), printed circuit boards (PCB), antennas and control circuits. The midstream encompasses millimeter-wave radar system design and manufacturing. Finished downstream products are mainly used in intelligent driving, traffic safety, robotics and the low-altitude economy.\nCheng-Tech is selling into a millimeter-wave radar market that is growing rapidly as autonomous driving gains momentum. The market grew from 17.8 billion yuan ($2.54 billion) in 2020 to 29.1 billion yuan by 2024, representing 13.1% annual growth over that time, according to third-party data in Cheng-Tech’s prospectus filed late last month. The growth rate is expected to accelerate in the years ahead, rising to 16.7% annually to reach 63 billion yuan by 2029. Automotive intelligent driving applications are the primary force driving the industry’s growth right now.\nRise of intelligent driving\nFalling costs have been a primary factor boosting the recent adoption of millimeter-wave radar products into a growing number of low- to mid-priced vehicle models, as more cost-conscious buyers increasingly want such features. The technology can act as an important part of a car’s core perception system, complementing other sensing technologies like cameras, ultrasonic radar and LiDAR that often have various limitations, to prevent accidents, especially in complex or extreme driving scenarios.\nCheng-Tech has developed multiple millimeter-wave radar products catering to intelligent driving demands from Level 0 (L0) to Level 2+ (L2+), on an autonomous driving scale of 0 to 5, where L5 represents fully autonomous driving. Its products are used in both passenger and commercial vehicles, covering front radars as well as rear and side-facing radars.\nThe company’s revenue rose more than fivefold year-on-year to 539 million yuan in the first half of 2025, as its front millimeter-wave radar sales jumped 351% and corner millimeter-wave radar sales soared by 1,134%. The big rise lifted the company’s gross profit by 182% year-on-year to 74.51 million yuan in the six-month period.\nBut Cheng-Tech still lost 14.43 million yuan in the first half of 2025, partly due to a 4.22 million yuan provision for trade and other receivables. The bottom line also took a hit from a tripling in the company’s general and administrative expenses, which it attributed to higher ", "Content_Length": 9037, "Word_Count": 1357, "Image_URLs": [], "News_URL": "https://thebambooworks.com/cheng-tech-motors-into-crowded-self-driving-field/", "Scrape_Time_Sec": 5.724320411682129}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-04T22:42:13.898474+00:00", "News_Date_Formatted": "2026-01-04 22:42:13 (GMT+0)", "Week_Num": 5, "News_Title": "BYD Company Limited", "News_Source": "PERPLEXITY", "News_Content": "History\nDiscover\nSpaces\nFinance\nMore\nPerplexity Finance\nBY6.F\nNews\nShare\nBYD Company Limited\nBY6\n·\nFSX\n·\nFollow\nOverview\nFinancials\nEarnings\nHistorical Data\nReports\nMT Newswires\n·\nJanuary 5, 2026 at 11:51 AM\nBYD Dethrones Tesla in 2025 Electric Vehicle Sales\n10:51 PM EST, 01/04/2026 (MT Newswires) -- BYD's (HKG:1211, SHE:002594) electric vehicle sales surged 28% year over year to about 2.3 million units in 2025 from 1.8 million units in 2024, according to a Monday disclosure to the Shenzhen bourse.\nThe figure surpassed that of Tesla, whose sales reached more than 1.6 million during the year, according to figures released Friday.\nTesla's sales fell 8.6% year over year.\nBack\nSee all\nBenzinga\n·\n12 minutes ago\nWeekend Round-Up: GM Motors Earnings, Tesla Triumphs And Autonomous Vehicles Make Headlines\nBenzinga\n·\n21 minutes ago\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nBenzinga\n·\n39 minutes ago\nMicrosoft, Apple, Meta And More Make Headlines: This Week In Tech\nBenzinga\n·\n1 hour ago\n'That's Basic Econ' — Dave Ramsey Says Increased Tariffs Do Not Cost Companies Money, As 'They Pass The Tariff Cost On To The Customer'\nBenzinga\n·\n1 hour ago\nConsumer Tech News (Jan 26-30): Meta Faces Lawsuits Over Youth Addiction Claims, IMF Warns AI Could Eliminate Millions Of Jobs & More\nMT Newswires\n·\n1 hour ago\nTadawul Shares Start Week Lower; Saudi Arabia's Real GDP Growth Accelerates\nBenzinga\n·\n2 hours ago\nQ1 Earnings, Focus On Premium iPhone, Steve Jobs' Signature And More: This Week In Appleverse\nMT Newswires\n·\n3 hours ago\nSisco Says Tawzea Signs SAR133.5 Million Water Network Operation, Maintenance Deal\nMT Newswires\n·\n3 hours ago\nAmlak International Finance Unveils New Visual Branding\nBenzinga\n·\n3 hours ago\nPowell's Stark Message, Silver's Historic Rally, Trump's Fed Chair Pick And More: This Week In Economy\nMT Newswires\n·\n4 hours ago\nInternational Human Resources Co. Lands SAR9.4 Million Outsourcing Services Deal\nMT Newswires\n·\n4 hours ago\nAgility Global Launches New Partnership Program in Abu Dhabi\nMT Newswires\n·\n4 hours ago\nMarket Chatter: Carlyle Said in Discussions for Potential UAE Partners Amid Lukoil Assets Purchase\nBenzinga\n·\n4 hours ago\nTrump Briefed On Iran, Gavin Newsom Wants Californians To Report Miscoundct And More: This Week In Politics\nBenzinga\n·\n4 hours ago\n'YouTube Doesn't Allow Spam, Scams Or Other Deceptive Practices,' CEO Neal Mohan Says As Platform Shuts Popular AI Channels\nSymbol\nBY6.F\nIPO Date\nApr 18, 2007\nCEO\nChuan-Fu Wang\nFulltime Employees\n969K\nSector\nConsumer Cyclical\nIndustry\nAuto - Manufacturers\nCountry\nChina\nExchange\nFrankfurt Stock Exchange\nBYD Company Limited is a Chinese multinational manufacturing conglomerate headquartered in Shenzhen that has established itself as the world's leading manufacturer of new energy vehicles (NEVs), with approximately 4.3 million passenger NEVs sold in 2024, representing 35% of the Chinese market. Founded in 1995 by CEO Wang Chuanfu, the vertically integrated company operates across multiple business segments including automobiles (BYD Auto, Denza, Fangchengbao, and Yangwang brands), rechargeable batteries and photovoltaic products, and mobile handset components and assembly services. With nearly 970,000 employees worldwide and over 30 global industrial parks, BYD has developed proprietary core technologies in batteries, motors, electronic controls, and semiconductors through its subsidiaries including FinDreams Battery (the world's second-largest EV battery producer with 17% market share in 2024), positioning the company as a comprehensive solutions provider spanning passenger vehicles, commercial vehicles, rail transit systems, energy storage, and electronics manufacturing.\nView More\nGainers\nLosers\nActive\nPhoenix Asia Holdings Limited Ordinary Shares\n$133.12\nPHOE\n·\nNASDAQ\n+\n997.44%\nTechCreate Group Ltd.\n$172.84\nTCGL\n·\nAMEX\n+\n100.14%\nAdlai Nortye Ltd.\n$10.63\nANL\n·\nNASDAQ\n+\n62.79%\nRobert Half International Inc.\n$34.61\nRHI\n·\nNYSE\n+\n27.76%\nPeers\nTesla, Inc.\n$430.41\nTSLA\n·\nNASDAQ\n+\n3.32%\nGeneral Motors Company\n$84.00\nGM\n·\nNYSE\n-\n2.62%\nMercedes-Benz Group AG\n€57.79\nMBG\n·\nXETRA\n+\n0.86%\nVolkswagen AG\n$12.10\nVWAGY\n·\nOTC\n-\n2.34%\nFord Motor Company\n$13.88\nF\n·\nNYSE\n-\n0.82%\nLi Auto Inc.\n$16.63\nLI\n·\nNASDAQ\n-\n3.65%\nNIO Inc.\n$4.70\nNIO\n·\nNYSE\n-\n1.47%\nXPeng Inc.\n$17.98\nXPEV\n·\nNYSE\n-\n3.28%\nStellantis N.V.\n$9.87\nSTLA\n·\nNYSE\n+\n0.10%\nFerrari N.V.\n$333.17\nRACE\n·\nNYSE\n-\n1.56%\nRivian Automotive, Inc.\n$14.75\nRIVN\n·\nNASDAQ\n-\n2.77%\nGeely Automobile Holdings Limited\nHK$16.09\n0175\n·\nHKSE\n-\n4.23%\nGreat Wall Motor Company Limited\n$1.77\nGWLLF\n·\nOTC\n0.00%\nHonda Motor Co., Ltd.\n$30.33\nHMC\n·\nNYSE\n+\n0.13%\nBayerische Motoren Werke AG\n€87.42\nBMW\n·\nXETRA\n+\n0.34%\nFinancial information provided by Financial Modeling Prep. Options data provided by Unusual Whales. Earnings transcripts, audio, and documents provided by Quartr. Reported revenue and EPS data from Earnings powered by Fiscal.ai. Estimates provided by S&P Global. Prediction markets data fro", "Content_Length": 5219, "Word_Count": 823, "Image_URLs": [], "News_URL": "https://www.perplexity.ai/finance/BY6.F/news/G2593783", "Scrape_Time_Sec": 3.694786548614502}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-23T22:09:36+00:00", "News_Date_Formatted": "2025-12-23 22:09:36 (GMT+0)", "Week_Num": 6, "News_Title": "Is It Too Late To Consider BYD After Its Strong Multi Year Share Price Run?", "News_Source": "YAHOO", "News_Content": "Is It Too Late To Consider BYD After Its Strong Multi Year Share Price Run?\nSimply Wall St\nDecember 24, 2025 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nIf you are wondering whether BYD is still a smart buy after its big multiyear run, or if the easy money has already been made, you are not alone. That is exactly what this article will unpack.\nDespite some recent choppiness, with the stock down 1.5% over the last week and roughly flat over 30 days, BYD is still up 8.2% year to date and 3.1% over the past year, on top of a hefty 48.4% gain in three years and 49.9% in five.\nThese moves have come as BYD cements its position as a global EV and battery heavyweight, ramping exports and expanding its model lineup in key overseas markets. Investors have also been reacting to policy shifts in China and intensifying EV competition, which can quickly change how the market prices BYD's growth story.\nIn our framework, BYD scores just 1 out of 6 on undervaluation checks. That might sound underwhelming until you see how different valuation methods tell very different stories, and why the most useful way to think about fair value, which we will get to at the end, goes beyond a simple scorecard.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow model takes estimates of the cash a company can generate in the future and discounts those amounts back to what they are worth today, to arrive at an intrinsic value per share.\nFor BYD, the model uses a 2 Stage Free Cash Flow to Equity framework in CN¥. The latest twelve months show negative free cash flow of about CN¥29.1 billion, reflecting heavy investment and working capital swings. Analysts then expect free cash flow to turn positive and grow rapidly, with Simply Wall St extrapolating those forecasts so that by 2035 BYD could be generating around CN¥101.3 billion in free cash flow.\nAfter discounting this stream of cash flows back to today, the model arrives at an intrinsic value of roughly HK$111.24 per share. Compared with the current market price, this implies the stock is about 16.3% below this DCF-derived estimate of intrinsic value, indicating a potential valuation gap based on the model’s assumptions.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 16.3%. Track this in your watchlist or portfolio, or discover 909 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Dec 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor a profitable company like BYD, the price to earnings ratio is a straightforward way to gauge how much investors are willing to pay today for each dollar of current earnings. In general, stronger and more reliable earnings growth, and lower perceived risk, justify a higher PE multiple, while slower growth or higher uncertainty usually call for a lower, more conservative multiple.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3156, "Word_Count": 542, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/too-consider-byd-strong-multi-220936883.html", "Scrape_Time_Sec": 6.475024223327637}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-28T22:42:13.898474+00:00", "News_Date_Formatted": "2025-12-28 22:42:13 (GMT+0)", "Week_Num": 6, "News_Title": "BYD Sells 210,051 NEVs in Jan, Down 30.11% Year-on-year", "News_Source": "MOOMOO", "News_Content": "Investments\nFeatures\nPricing\nPromotion\nInstitutions\nPrivate Wealth\nSupport\nAbout us\nDownload\nSign up/Log in\nEnjoy\nup to S$1190*\nOpen Account\nHeadlines\nBYD Sells 210,051 NEVs in Jan, Down 30.11% Year-on-year\nBYD Sells 210,051 NEVs in Jan, Down 30.11% Year-on-year\nCnEVPost\n· \n18:50\nBYD COMPANY\n-3.98%\nThis article is being updated, please refresh later for more content.\nBYD exported 100,482 NEVs in January, up 51.47% year-on-year but down 24.55% from December.\nBYD Monthly NEV Sales 2024-2026\nMonth 2024 2025 2026\nJanuary 201,493 300,538 210,051\nFebruary 122,311 322,846\nMarch 302,459 377,420\nApril 313,245 380,089\nMay 331,817 382,476\nJune 341,658 382,585\nJuly 342,383 344,296\nAugust 373,083 373,626\nSeptember 419,426 396,270\nOctober 502,657 441,706\nNovember 506,804 480,186\nDecember 514,809 420,398\nBYD monthly NEV sales\n2024 2025 2026\nSource: Company reports CnEVPost\nBYD (HKG: 1211, OTCMKTS: BYDDY) sold 210,051 new energy-vehicles (NEVs) in January, down 30.11% year-on-year and 50.04% month-on-month.\nJoin us on Telegram or Google News\nIts passenger NEV sales in January reached 205,518 units, down 30.67% year-on-year and 50.45% month-on-month.\nThe company exported 100,482 NEVs in January, a 51.47% increase year-on-year but a 24.55% decrease compared to December.\nDisclaimer: This content is for informational and educational purposes only and does not constitute a recommendation or endorsement of any specific investment or investment strategy. Read more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLike\nViews 315\nRecommended\nQ1 Earnings, Focus On Premium IPhone, Steve Jobs' Signature And More: This Week In Appleverse\nBenzinga\n·\n20:01\nThe Silver Market Is Messed Up. These Buyers Are Feeling the Pain. -- WSJ\nWSJ\n·\n18:30\nPowell's Stark Message, Silver's Historic Rally, Trump's Fed Chair Pick And More: This Week In Economy\nBenzinga\n·\n19:01\nWhy I'm Getting a Home Battery Backup Before the Next Outage -- WSJ\nWSJ\n·\n44m\nInternational Human Resources Co. Lands SAR9.4 Million Outsourcing Services Deal\nMT Newswires\n·\n18:31\nWrite a comment\n\nMarket Insights\nGold\nNo.\nSymbol\n20D % Chg\nSample Name\nSample Code\n+264.36%\nSample Name\nSample Code\n+77.00%\nSample Name\nSample Code\n+57.13%\n4\nBlue Gold\nBGL\n+50.00%\n5\nParamount Gold Nevada\nPZG\n+40.48%\nView More\nMeet Smarter Moomoo AI\nARK ETFs\nThe ARK ETFs concept includes several ETFs across different strategies managed by ARK Invest. ARK Invest is an investment firm founded by Cathie Wood.\nNo.\nSymbol\n20D % Chg\nSample Name\nSample Code\n+10.39%\nSample Name\nSample Code\n+8.08%\nSample Name\nSample Code\n+5.04%\n4\nThe 3D Printing ETF\nPRNT\n+2.15%\n5\nARK Israel Innovative Technology ETF\nIZRL\n+1.47%\nUnlock Now\n- No more -\nCustomer Service\n+65 6321 8888\nTrading days: 24 hours\nNon-trading days: 9:30 - 21:30 SGT\nclientservice@sg.moomoo.com\nAbout moomoo\nAbout moomoo\nInfluencer Program\nInvestor Relations\nMedia Relations\nScam Awareness\nTerms & Conditions\nPrivacy Policy\nTerms of Use\nBroker Disclosure\nBest Execution Policy\nLicensed Entities*\nYour Privacy Choices\nCareers / Contact:\nApply Now\ncareer@sg.moomoo.com\nFollow us on\nMoomoo Stores\n313 @somerest\nJem\nAddress:\n313 Orchard Road #B2-14 & #B2-53/53A, 313@somerset, Singapore 238895\nOpening Hours:\n10:00 - 22:00 SGT\n\n\nThe moomoo app is an online trading platform offered by Moomoo Technologies Inc. In Singapore, securities and brokerage services are provided by Moomoo Financial Singapore Pte. Ltd., regulated by the Monetary Authority of Singapore (MAS) under a Capital Markets Services Licence (CMS101000), a Major Payment Institution Licence (PS20200617), and with Exempt Financial Adviser Status.\nMoomoo Financial Singapore Pte. Ltd. does not solicit or market in jurisdictions such as China or others where its services are not permitted. Accessing this platform from such locations is at your own risk, and compliance with local laws is your responsibility.\nAdvertisements leading to this website have not been reviewed by the MAS.\nCompany Address：Moomoo Financial Singapore Pte. Ltd. 10 Marina Blvd, Tower 2, #31-01 Marina Bay Financial Centre, 018983\nCopyright © 2026 Moomoo Technologies Inc. All Rights Reserved.", "Content_Length": 4101, "Word_Count": 620, "Image_URLs": ["https://pubimg.futunn.com/2022050900000273867d830535b.jpg?imageMogr2/thumbnail/76x76!/ignore-error/1/format/webp", "https://foss-mm-us.moomoo.com/official_config_oss/prod/1b40bdd9-d11c-4301-b149-e8894277b53d", "https://foss-mm-us.moomoo.com/official_config_oss/prod/b9a5cf23-0e1c-4618-b6ea-1386983f8eff", "https://foss-mm-us.moomoo.com/official_config_oss/prod/5e71508f-1510-4870-bf60-fc6cb0c8a025", "https://record.moomoo.com/news-editor-imgs/20260201/public/17699570393458193494726.png?imageMogr2/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/202205090000014815324d62ed6.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/2022050900000203bfee0cc4562.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/202205090343018608af559109f.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://pubimg.futunn.com/2022050900000213c4b25fbd0cb.jpg?imageMogr2/thumbnail/264x198!/quality/minsize/1/ignore-error/1/format/webp", "https://foss-mm-us.moomoo.com/official_config_oss/prod/64c3939b-4b24-46dd-884c-e2b95044e7cb", "https://foss-mm-us.moomoo.com/official_config_oss/prod/6a5d23d0-6ba3-49cf-9bb9-88c8fbd4a901", "https://foss-mm-us.moomoo.com/official_config_oss/prod/875b7a1d-4fcf-4ecd-a57c-0daf291b5dd0"], "News_URL": "https://www.moomoo.com/news/post/64894199/byd-sells-210051-nevs-in-jan-down-30-11-year", "Scrape_Time_Sec": 5.734841823577881}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-09T21:11:23+00:00", "News_Date_Formatted": "2025-12-09 21:11:23 (GMT+0)", "Week_Num": 8, "News_Title": "Is BYD Still Attractive at HK$98 After Global EV Expansion and Mixed Valuation Signals?", "News_Source": "YAHOO", "News_Content": "Is BYD Still Attractive at HK$98 After Global EV Expansion and Mixed Valuation Signals?\nSimply Wall St\nDecember 10, 2025 4 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nWondering if BYD at HK$98 is still a smart way to ride the EV and battery wave, or if most of the upside is already priced in? You are not alone.\nThe stock is roughly flat over the last month at +0.1%, but a 13.9% gain year to date and 44.1% over three years shows investors have already been willing to pay up for its growth story, even after a recent 2.1% dip this week and a more modest 9.1% return over the past year.\nRecent headlines have focused on BYD aggressively expanding exports into Europe and Southeast Asia and ramping up its battery and EV production footprint globally, adding fuel to the long term growth narrative. At the same time, rising competition in China and shifting government policy have kept some investors cautious, which helps explain the more modest near term price action.\nRight now, BYD only scores 1 out of 6 on our valuation checks, suggesting the market might not see it as a clear bargain yet and that different valuation methods could tell very different stories. Toward the end of this article we will look at a more complete way to think about what BYD is really worth.\nBYD scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow model estimates what a business is worth by projecting its future cash flows and discounting them back to today, to reflect risk and the time value of money.\nFor BYD, the latest twelve month free cash flow is negative at roughly CN¥29.1 billion, reflecting heavy investment in growth. Analysts and extrapolated estimates, however, point to a sharp turnaround, with free cash flow expected to reach about CN¥101.3 billion in 2035, based on a 2 Stage Free Cash Flow to Equity model that blends explicit forecasts with longer term growth assumptions.\nWhen all projected cash flows over the next decade and beyond are discounted back, Simply Wall St’s DCF model arrives at an intrinsic value of around HK$111.51 per share. With the stock trading near HK$98, this implies BYD is about 12.1% undervalued on this cash flow view. This suggests the market may be underestimating the long term earnings power of its EV and battery businesses.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 12.1%. Track this in your watchlist or portfolio, or discover 904 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Dec 2025\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nApproach 2: BYD Price vs Earnings\nFor profitable companies like BYD, the price to earnings, or PE, ratio is a useful way to gauge how much investors are willing to pay for each unit of current earnings. In general, faster growth and lower risk justify a higher PE, while slower or more uncertain earnings usually warrant a lower multiple.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3159, "Word_Count": 546, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/byd-still-attractive-hk-98-211123804.html", "Scrape_Time_Sec": 6.2064573764801025}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-04T02:36:18+00:00", "News_Date_Formatted": "2025-12-04 02:36:18 (GMT+0)", "Week_Num": 9, "News_Title": "Chinese EV stocks extend losses in Hong Kong as year-end sales momentum wanes", "News_Source": "CNEVPOST", "News_Content": "Chinese EV stocks extend losses in Hong Kong as year-end sales momentum wanes\nPhate Zhang • Dec 4, 2025, 10:36 AM GMT+8\n1\n7\nMajor EV makers have seen consecutive days of declines as year-end vehicle deliveries have been weaker than in previous years amid tapering stimulus policies.\nTo date, over 20 local governments have suspended or adjusted vehicle replacement subsidy applications.\n(An Onvo L60 displayed at the Shanghai auto show in April 2025. Image credit: CnEVPost)\nHong Kong-listed Chinese electric vehicle (EV) makers have witnessed sustained stock price declines over several days, with year-end sales performance proving weaker than in prior years.\nEV makers including Nio Inc (NYSE: NIO, HKG: 9866), Xpeng (NYSE: XPEV, HKG: 9868), Li Auto (NASDAQ: LI, HKG: 2015), and BYD (HKG: 1211, OTCMKTS: BYDDY) declined in early trading today, extending their multi-day slump.\nAs of this writing, Nio was down 1.95 percent to HK$38.30 per share, extending its decline to a fourth consecutive trading day and hitting its lowest level since August 19. The company has fallen about 33 percent over the past month.\nJoin us on Telegram or Google News\nXpeng currently fell 1.99 percent to HK$73.85 per share, also marking its fourth consecutive trading day of declines and hitting a new low since August 4. Over the past month, it has dropped about 19 percent.\nLi Auto was down 2.87 percent to HK$67.80 per share, marking its fifth consecutive trading day of losses and hitting a new low since late November 2022. The company has fallen about 17 percent over the past month, and down about 45 percent from its recent high in July.\nBYD was currently down 1.12 percent to HK$97.05 per share, marking its second consecutive trading day of decline. Over the past month, the company has fallen about 2 percent.\nLeapmotor (HKG: 9863) was down 1.13 percent, having declined about 11 percent over the past month.\nThese companies posted relatively strong deliveries last month but demonstrated weak momentum, especially compared to their robust year-end performances in previous years.\nNio delivered 36,275 vehicles in November, its second-highest monthly record. This represents a 76.31 percent year-on-year increase but a 10.20 percent decline from October.\nXpeng delivered 36,728 vehicles in November, up 18.88 percent year-on-year but down 12.58 percent from October.\nLi Auto delivered 33,181 vehicles in November, marking a 31.92 percent year-on-year decline -- its sixth consecutive month of year-on-year contraction. This monthly figure represents a 4.45 percent increase from October's 31,767 deliveries.\nBYD sold 480,186 NEVs in November, its highest monthly total this year. This represented a 5.25 percent year-on-year decline, marking the third consecutive month of year-on-year contraction, though it increased by 8.71 percent compared to October.\nLeapmotor delivered 70,327 vehicles in November, a 75.08 percent year-on-year increase and a 0.05 percent rise from October.\nThe year-end delivery slump partly stems from tapering stimulus policies.\nBy mid-November, trade-in subsidies in most Chinese provinces had been adjusted, intensifying consumer wait-and-see sentiment and impacting the November auto market, noted the China Passenger Car Association (CPCA) in a December 2 report.\nAs China's fourth batch of RMB 69 billion ($9.8 billion) in national subsidies nears depletion, an increasing number of local governments have suspended or adjusted vehicle trade-in subsidies, Yicai noted in a report yesterday.\nTo date, over 20 municipal governments have suspended or adjusted applications for vehicle trade-in subsidies, the report noted.\nAdditionally, China's current new energy vehicle (NEV) purchase tax reduction policy will begin scaling back next year, potentially further impacting first-quarter sales.\n($1 = RMB 7.0697)\nHK StocksLeapmotorLi AutoLi Auto StockNioNio StockXpengXpeng Stock\nDaily Recap\nSubscribe to Daily Recap to get updates on what's happening in China's EV industry each day.\n✓\nDaily Recap\nView more channels\nSubscribe\nAbout Author\nPhate Zhang\nPhate is the founder and main author of CnEVPost. He has been reporting since 2009, mainly on macroeconomics and capital markets. He started his career at China Daily and Reuters. Contact via: phate@cnevpost.com.", "Content_Length": 4285, "Word_Count": 655, "Image_URLs": [], "News_URL": "https://cnevpost.com/2025/12/04/chinese-ev-stocks-extend-losses-hong-kong/", "Scrape_Time_Sec": 4.765810251235962}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-30T22:42:13.898474+00:00", "News_Date_Formatted": "2025-11-30 22:42:13 (GMT+0)", "Week_Num": 10, "News_Title": "Quantgroup, Haiwei Tech see heavy retail demand in Hong Kong IPOs", "News_Source": "THESTANDAR", "News_Content": "News\nComment\nBusiness & Innovation\nProperty\nRacing\nEducation\nArts & Lifestyle\nEntertainment\nMore\nePaper\nBUSINESS & INNOVATION\nMARKET\nQuantgroup, Haiwei Tech see heavy retail demand in Hong Kong IPOs\nMARKET\n24-11-2025 15:59 HKT\nA Stock Exchange of Hong Kong (HKEX) sign is seen at the 2020 China International Fair for Trade in Services (CIFTIS) in Beijing, China September 4, 2020. REUTERS\n Chinese e-commerce platform Yangxiaomie’s operator, Quantgroup, closed its retail book for Hong Kong initial public offering, with at least HK$79.21 billion in margin orders, about 6.056 times oversubscribed.\nThe company plans to issue 13.35 million shares, with 10 percent offered to the public at a price range of HK$8.8 to HK$9.8 per share, raising up to HK$130 million.\nEach board lot comprises 500 shares, with a minimum investment of HK$4,949.40 per lot.\nQuantgroup is expected to debut on the Hong Kong Stock Exchange on November 27.\nHebei Haiwei Electronic New Material Technology saw its retail book oversubscribed about 2,000 times, attracting roughly HK$88 billion in margin financing.\nThe capacitor-film maker is offering 30.83 million shares, with 10 percent earmarked for the Hong Kong public tranche, at an issue price of HK$14.28 per share to raise about HK$440 million. Each board lot is 200 shares, with a minimum investment of HK$2,884.8.\nThe company is set to list on November 28. BYD (1211), a customer of Haiwei and a pre-IPO investor, holds a 4.9 percent stake.\nDownload The Standard app to stay informed with news, updates, and significant events:\nhttps://www.thestandard.com.hk/appdownload\n  by Taboola\nYou May Like\n五年來黃金投資最佳時機，就是現在！\nIC Markets\n|\nSponsored\n了解更多\nRosanna Law anticipates over 50 million visitors in 2026, optimistic about Chinese New Year tourism\nBeyond Text Generation: An AI Tool That Helps You Write Better\nGrammarly\n|\nSponsored\nInstall Now\nTop News\nEx-chief secretary Rafael Hui dies at 77 due to health issues\nBREAKING NEWS\n28 mins ago\nRosanna Law anticipates over 50 million visitors in 2026, optimistic about Chinese New Year tourism\nHONG KONG NEWS\n7 hours ago\nHK to expand youth access to global internships and conferences, Alice Mak says\nHONG KONG NEWS\n4 hours ago\nHundreds flock to On King Street Park as cherry blossoms reach full bloom\nHONG KONG NEWS\n5 hours ago\nPolice probe over 70 new traffic-related frauds, with a claimant reporting 'neck injuries' 20 times\nHONG KONG NEWS\n8 hours ago\nMarius Hoiby, the 'almost royal' tarnishing Norway's crown\nWORLD NEWS\n6 hours ago\nRead More\nThree major telecom operators flag impact from VAT change\nMARKET\n2 hours ago\nHong Kong firms attract IPO listings despite accountant shortages\nMARKET\n3 hours ago\nTrump says Fed nominee Warsh could garner Democratic support\nMARKET\n4 hours ago\nHong Kong's public finance, retail sales improving, Paul Chan says\nMARKET\n4 hours ago\nMacau's gaming revenue increases 24 percent in January\nMARKET\n6 hours ago\nWall St slips after Trump picks Fed critic Warsh to succeed Powell\nMARKET\n30-01-2026 23:31 HKT\nUS producer prices accelerate in December on services\nMARKET\n30-01-2026 22:07 HKT\nPanama president says ports will operate without disruption after court ruling\nMARKET\n30-01-2026 21:02 HKT\nUS stock index futures cut losses after Trump nominates Kevin Warsh as next Fed Chair\nMARKET\n30-01-2026 20:13 HKT\nTrump picks former Fed official Warsh to run Fed\nMARKET\n30-01-2026 20:10 HKT\nNew seatbelt law applies only to buses registered after Jan 25, says Doreen Kong\nHONG KONG NEWS\n30-01-2026 16:30 HKT\nGovt to suspend mandatory bus seatbelt rule due to legal flaw\nHONG KONG NEWS\n30-01-2026 18:00 HKT\nRobber had precise cash route Info; reporting victim arrested as accomplice in Sheung Wan 51m yen robbery\nHONG KONG NEWS\n31-01-2026 19:29 HKT\nTop 10 Stocks for 2026\nSeeking Alpha\n|\nSponsored\nRead More\nGoal-hero Konate puts grief aside to help injury-hit Liverpool\nTop 10 Quant-Rated Stocks for 2026\nSeeking Alpha\n|\nSponsored\nRead More\nHK TV report exposes shocking indecent behavior at Tsing Yi public staircase\nLenovo Legion Pro 7i (16″, Gen 10) Intel® Core™ Ultra 9 275HX 處理器 (E 核心最高達 4.60 GHz P 核心最高達 5.40 GHz)/Windows 11 家用版 64\nLenovo HK\n|\nSponsored\n立即選購\nHK woman took her own life in UK after struggling to pay for food and rent\n2025 年最紓壓的農場遊戲！無需安裝\n東加：島嶼農場\n|\nSponsored\n立即播放\nPhilippine beauty queen found naked and dead at sea, surveillance footage reveals street kidnapping\n  by Taboola\nContact Us\nAbout Us\nTerms of Use\nPrivacy Policy Statement\nCopyright Policy & License\nEthics Statement\n|\nSubscriptions\nPrint Advertising\nDigital Advertising\nStreet Points\nCopyright © 2026 The Standard - A division of Sing Tao News Corporation Limited. All rights reserved.", "Content_Length": 4681, "Word_Count": 756, "Image_URLs": ["https://www.thestandard.com.hk/_next/static/media/more_arrow_bt.671f0812.png", "https://www.thestandard.com.hk/_next/static/media/Flippingbook.297281dc.png", "https://www.thestandard.com.hk/_next/static/media/Search_white.425b07fe.png", "https://www.thestandard.com.hk/_next/static/media/menu_youtube.454d42d0.png", "https://www.thestandard.com.hk/_next/static/media/menu_flipping_version.1237fa95.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_increase.f9ae48f6.png", "https://www.thestandard.com.hk/_next/static/media/fontsize_decrease.c19f90ee.png", "https://www.thestandard.com.hk/_next/static/media/printer.a8900506.png", "https://image.hkstandard.com.hk/f/1024p0/0x0/100/none/f26bd9ca7bf488527f4cb13e310de992/2025-11/WhatsApp_Image_2025-11-24_at_15_53_43.jpeg", "https://www.thestandard.com.hk/_next/static/media/whatsapp.2df4fc9c.png", "https://www.thestandard.com.hk/_next/static/media/x.479884fe.png", "https://www.thestandard.com.hk/_next/static/media/email.22f696fe.png", "https://www.thestandard.com.hk/_next/static/media/link.0fdd3fbe.png", "https://image.hkstandard.com.hk/f/1024p0/0x0/100/none/18710c0319641fbdacdaa460972bf470/2026-02/AFP_62RU2KD.jpg"], "News_URL": "https://www.thestandard.com.hk/market/article/317621/Quantgroup-Haiwei-Tech-see-heavy-retail-demand-in-Hong-Kong-IPOs", "Scrape_Time_Sec": 5.124172687530518}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-11-21T05:51:46+00:00", "News_Date_Formatted": "2025-11-21 05:51:46 (GMT+0)", "Week_Num": 11, "News_Title": "How Singapore Investors Can Approach China Stocks: Themes, Risks and Notable Names", "News_Source": "SYFE", "News_Content": "How Singapore Investors Can Approach China Stocks: Themes, Risks and Notable Names\nBy Syfe Singapore -\nNovember 21, 2025\nChina remains the world’s second-largest economy by nominal GDP and the largest by purchasing power parity, accounting for a sizeable share of global output and growth. In equity markets, China is just as significant: the MSCI China Index alone includes over 500 large- and mid-cap companies across A-shares (mainland China-listed, RMB-dominated stocks), H-shares (Chinese companies listed in Hong Kong and quoted in HKD) and overseas listings, representing about 85% of China’s investable equity universe.\nFor many Singapore investors, China stocks are back on the radar. On one side, you have some of the world’s most interesting names in e-commerce, super-apps, electric vehicles (EVs) and travel. On the other, you’re navigating headlines about regulations, property markets and US–China tensions.\nThis guide will cover how big China is in the global market, main ways to access Chinese markets from Singapore, key risks, a simple stock-picking framework, and an illustrative list of 10 top China stocks by theme.\nInvest in China Stocks with Syfe Brokerage\nBuild and manage your own China stock watchlist without juggling multiple brokers. With Syfe Brokerage, you can buy individual China stocks listed in the US (ADRs on NYSE/Nasdaq) and on HKEX, all from a single, MAS-regulated platform.\nEnjoy unlimited free US trades for the first three months, as well as low commission fee from 0.04% – 0.06% for HKEX. No platform or hidden fees.\nGet Started\nTable of Content\nHow Big Is China in the Global Market?\nWhy Singapore Investors Are Looking at Top China Stocks\nHow Singaporeans Can Access Chinese Stocks\nKey Risks of Investing in Chinese Stocks\nA Simple Framework to Evaluate Top Chinese Stocks\n10 Top China Stocks by Theme\nE-Commerce and Platforms\nOnline Services and Entertainment\nConsumer and Travel\nNew Energy, EVs and Local Services\nHow Much China Exposure Makes Sense?\nUsing ETFs to Get China Exposure\nQuick Takeaways\nConclusion\nFrequently Asked Questions (FAQs)\nHow Big Is China in the Global Market?\nChina is one of the heavyweights of the global economy. By nominal GDP, it is the second-largest economy in the world, and by purchasing power parity it ranks first, accounting for a sizeable share of global output.\nIn equity markets, China also plays a major role. The MSCI China Index covers over 500 large and mid-cap companies across A-shares (mainland China–listed, RMB-denominated stocks), H-shares (Chinese companies listed in Hong Kong and quoted in HKD) and overseas listings, representing around 85% of China’s investable equity universe. The broader MSCI China All Shares Index goes further by combining all major share classes from Shanghai, Shenzhen, Hong Kong and offshore markets into a single, integrated view.\nBecause of this size and breadth, China often appears as one of the largest single-country exposures within global emerging-market and Asia-focused equity benchmarks. In other words, what happens in Chinese markets can meaningfully influence regional and emerging-market performance, making China a key market to understand even if it’s only a moderate part of your own portfolio.\nWhy Singapore Investors Are Looking at Top China Stocks\nFrom Singapore, your portfolio might already lean heavily towards local banks, REITs and US tech stocks. Adding a measured slice of top Chinese stocks can introduce different drivers of return, such as onshore consumption, digital platforms, EV adoption and tourism recovery.\nCommon reasons Singapore investors look at Chinese equities:\nScale and growth potential: Even with slower growth than a decade ago, China remains a major engine of global demand and manufacturing, while shifting towards services, technology and consumption.\nUnique sectors and business models: Super-apps like WeChat, pure-play EV makers and certain consumer brands don’t have direct equivalents on SGX, so China offers exposure you can’t easily get locally.\nValuation reset: Years of regulatory actions, property stress and cautious sentiment have pushed many large-cap Chinese names to lower valuations than comparable companies elsewhere, which some investors see as an opportunity if conditions stabilise.\nFor Singaporean investors who can accept higher volatility in exchange for growth potential, Chinese stocks and China ETFs are often viewed as a satellite, higher-risk sleeve layered onto a global core.\nHow Singaporeans Can Access Chinese Stocks\nFrom Singapore, you have three main ways to get exposure to top Chinese stocks:\nUS-listed Chinese ADRs\nH-shares – Hong Kong–listed China shares\nChina A-shares via Stock Connect and ETFs\nEach route has different currencies, trading hours, fees and risks.\n1. US-Listed Chinese ADRs\nMany well-known Chinese companies trade in the US as American Depositary Receipts (ADRs), such as:\nAlibaba Group (BABA)\nJD.com (JD)\nPDD Holdings (PDD)\nBaidu (BIDU)\nTrip.com Group (TCOM)\nAn A", "Content_Length": 28630, "Word_Count": 4423, "Image_URLs": ["https://cdn.prod.website-files.com/64d3542964db4e6ae6de7d1d/64e3291d2637d31cece131ba_nav-menu-tip.webp", "https://cdn.prod.website-files.com/64d3542964db4e6ae6de7d1d/64e3297d6a5c9343fa085d51_IG.webp", "https://cdn.prod.website-files.com/64d3542964db4e6ae6de7d1d/64e3297d6a5c9343fa085d59_FB.webp"], "News_URL": "https://www.syfe.com/magazine/how-singapore-investors-can-approach-china-stocks/", "Scrape_Time_Sec": 5.59372353553772}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-02-01T13:53:00+00:00", "News_Date_Formatted": "2026-02-01 13:53:00 (GMT+0)", "Week_Num": 12, "News_Title": "BYD Co. Ltd.", "News_Source": "MARKETWATCH", "News_Content": "WSJ\nBarron's\nMarketWatch\nIBD\nWSJ | Buy Side\nSKIP TO MAIN CONTENT\nMain Menu\nMarketWatch Logo Go to the homepage.\nInvesting\nPersonal Finance\nRetirement\nEconomy\nWatchlist\nOpen Site Search\nClose Search Overlay\nMARKET DATA\nS&P 500 Movers\nDECK\n19.5\nVZ\n11.8\nCHTR\n7.6\nAPP\n-16.9\nKLAC\n-15.2\nNEM\n-11.5\nWDC\n-10.1\nHome Investing Quotes Stocks Hong Kong 1211 Overview\nStock Screener\nEarnings Calendar\nSectors\nSearch Ticker\n|\n1211\nHong Kong\nBYD Co. Ltd.\n+\nWatchlist\nCLOSED\nLast Updated: Jan 30, 2026 4:08 p.m. HKST\nDelayed quote\nHK$\n97.75\n-4.05 -3.98%\nPREVIOUS CLOSE\nHK$101.80\n10am\n11am\n12pm\n1pm\n2pm\n3pm\n4pm\nHK$96\nHK$98\nHK$100\nHK$102\nToggle Chart Options\nAdvanced Charting\n1D\n5D\n1M\n3M\n6M\nYTD\n1Y\n3Y\nAll\nRange Dropdown\n$ % VOL\nVOLUME: 28.69M\n65 DAY AVG: 22.26M\n129% VS AVG\n97.40\nDAY RANGE\n101.80\n88.67\n52 WEEK RANGE\n159.27\nBuild Your Watchlist\nPersonalize and monitor market data with your custom tool.\nRegister Now\nSymbol Price/Vol % Chg\narrow_downward\nDJIA\nDow Jones Industrial Average\n48,892.47\n--\n-0.36%\n-179.09\narrow_upward\nAAPL\nApple Inc.\n259.48\nVol. 92M\n0.46%\n1.20\narrow_downward\nMSFT\nMicrosoft Corp.\n430.29\nVol. 59M\n-0.74%\n-3.21\narrow_downward\nGOOGL\nAlphabet Inc. Cl A\n338.00\nVol. 31M\n-0.07%\n-0.25\nRecently Viewed Tickers\nNo Recent Tickers\nVisit a quote page and your recently viewed tickers will be displayed here.\nSEARCH TICKERS\nOVERVIEW\nPROFILE\nCHARTS\nFINANCIALS\nHISTORICAL QUOTES\nPREMIUM TOOLS\nKEY DATA\nOPEN\nHK$101.80\nDAY RANGE\n97.40 - 101.80\n52 WEEK RANGE\n88.67 - 159.27\nMARKET CAP\nHK$906.57B\nSHARES OUTSTANDING\n3.68B\nPUBLIC FLOAT\n3.68B\nBETA\n1.23\nREV. PER EMPLOYEE\nHK$938.44K\nP/E RATIO\n21.07\nEPS\nHK$4.64\nYIELD\n1.12%\nDIVIDEND\nHK$1.14\nEX-DIVIDEND DATE\nJun 11, 2024\nSHORT INTEREST\nN/A\n% OF FLOAT SHORTED\nN/A\nAVERAGE VOLUME\n22.26M\nPERFORMANCE\n5 Day\n-1.86%\n1 Month\n-1.01%\n3 Month\n-2.83%\nYTD\n2.52%\n1 Year\n7.42%\nANALYST RATINGS\nSELL\nUNDER\nHOLD\nOVER\nBUY\nNUMBER OF RATINGS 1\nFULL RATINGS\nNEWS FROM DOW JONES\nEVS BYD Takes EV Crown From Tesla. What It Means for the Stock.\nJan. 2, 2026 at 4:12 p.m. ET by Barron's\nBYD overtakes Tesla to become top seller of electric vehicles — and the gap is big\nJan. 2, 2026 at 9:48 a.m. ET by Barbara Kollmeyer\nEVS Tesla Sales Plummet. The Stock Rises Despite a Global Headache.\nDec. 12, 2025 at 9:54 a.m. ET by Barron's\nFord can’t ‘walk away’ from EVs if it wants to thrive, says its CEO\nNov. 12, 2025 at 1:04 p.m. ET by William Gavin\nTesla is still losing ground in the world’s biggest EV market\nNov. 10, 2025 at 1:22 p.m. ET by William Gavin\nEVS Tesla Investors Have a New Worry\nNov. 3, 2025 at 4:32 p.m. ET by Barron's\nAUTOS Tesla European Sales Slump Again. Why the Stock Is Rising.\nOct. 28, 2025 at 4:18 p.m. ET by Barron's\nEVS Tesla Offers Cut-Price New Vehicles In Europe, Trying to Arrest Sales Decline\nOct. 12, 2025 at 4:04 p.m. ET by Barron's\nEVS BYD, NIO, Li Auto, and XPeng Post EV Sales Growth. Tesla Sales in China Haven’t Been Growing.\nOct. 1, 2025 at 4:17 p.m. ET by Barron's\nEVS BYD Stock Falls. Warren Buffett’s Berkshire Hathaway Is Bailing on the EV Maker.\nSep. 22, 2025 at 4:33 p.m. ET by Barron's\nEVS EV Sales Stay Strong in China. Why Profitability Is a Worry For Tesla, BYD, NIO, Others.\nSep. 1, 2025 at 10:39 a.m. ET by Barron's\nEVS XPeng Deliveries Soar but China’s EV Makers Hit By U.S. Trade Fears. What It Means for Tesla.\nAug. 1, 2025 at 10:06 a.m. ET by Barron's\nEVS BYD, XPeng, and NIO Deliveries Jump. Why Tesla Is Under Pressure.\nJul. 1, 2025 at 4:21 p.m. ET by Barron's\nTesla sales plunge in France, showing Elon Musk may have a long way to go to restore the brand\nJun. 2, 2025 at 11:52 a.m. ET by James Rogers\nEVS Chinese EV Makers Pull Away From Tesla With Sales Gains\nJun. 1, 2025 at 12:29 p.m. ET by Barron's\nEVS Tesla Europe Sales Slumped by 49%. Why the Stock Rose.\nMay. 27, 2025 at 5:09 p.m. ET by Barron's\nEVS BYD Ramps Up EV Price War. Nio and Other Chinese Auto Stocks Fall.\nMay. 27, 2025 at 10:14 a.m. ET by Barron's\nBYD has been grabbing market share from Tesla. Its shares are tanking after price cuts.\nMay. 27, 2025 at 7:01 a.m. ET by Barbara Kollmeyer\nMusk’s ‘24/7’ return to Tesla and business world comes as competition intensifies in China\nMay. 27, 2025 at 5:33 a.m. ET by Jules Rimmer\nEVS Tesla Stock Drops. Its Self-Driving Cars May Not Be Self Driving After All.\nMay. 21, 2025 at 4:16 p.m. ET by Barron's\nOTHER SOURCES\nPRESS RELEASES\nBYD’s January NEV Sales Drop 30% Year-on-Year as Exports and Battery Deployments Hold Firm\n4 hours ago on TipRanks.com\nTesla ends year with lower sales in Europe, BYD continues to outpace, WSJ says\nJan. 27, 2026 at 6:45 a.m. ET on TipRanks.com\nBYD plans to sell 1.3M cars outside of China in 2026, Bloomberg says\nJan. 25, 2026 at 2:10 p.m. ET on TipRanks.com\nChina’s EV companies see success in global expansion, WSJ reports\nJan. 21, 2026 at 6:30 a.m. ET on TipRanks.com\nFord, BYD in discussions over hybrid-vehicle battery partnership, WSJ reports\nJan. 15, 2026 at 11:35 a.m. ET on TipRanks.com\nBYD: Undervalued Battery Powerhouse Beyond EVs, Supported by Structural Growth and Vertical", "Content_Length": 9672, "Word_Count": 1620, "Image_URLs": [], "News_URL": "https://www.marketwatch.com/investing/stock/1211?countrycode=hk", "Scrape_Time_Sec": 6.822532653808594}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-11T22:42:13.898474+00:00", "News_Date_Formatted": "2026-01-11 22:42:13 (GMT+0)", "Week_Num": 4, "News_Title": "China EV stocks fall as weak Dec sales drive demand concerns", "News_Source": "INVESTING", "News_Content": "Get 50% Off\nSign In\nFree Sign Up\nMarkets\nMy Watchlist\nInvesting Challenges\nNews\nAnalysis\nCharts\nTechnical\nBrokers\nTools\nAcademy\nEconomic Calendar\nStock Screener\nMore\nBreaking News\nCurrencies\nCommodities\nStock Markets\nEconomic Indicators\nEconomy\nCryptocurrency\nInsider Trading\nCompany News\nEarnings\nInvestment Ideas\nSWOT Analysis\nAnalyst Ratings\nTranscripts\n🚪 February's AI-picked stock list about to go live. Opportunity is knocking...\nPick Stocks with AI\nChina EV stocks fall as weak Dec sales drive demand concerns\nAuthor\nAmbar Warrick\nStock Markets\nPublished 01/05/2026, 01:02 AM\n1\n© Reuters.\n1211\n-3.98%\nTSLA\n3.32%\n9868\n-1.71%\n9866\n3.65%\nInvesting.com-- Chinese electric vehicle stocks fell on Monday as data showing slowing sales growth in December sparked concerns over cooling demand in the world’s largest EV market. \nBYD (HK:1211) fell 2.2% in Hong Kong trade. While the company did overtake rival Tesla Inc (NASDAQ:TSLA) in EV sales in 2025, its December sales still slumped about 18% year-on-year in their fourth straight month of declines.\nBYD is the largest Chinese EV maker, and acts as a bellwether for the sector. While the company has managed to offset weaker Chinese sales by expanding to overseas markets, specifically Europe, analysts questioned whether its rivals will be able to do the same. \nLi Auto Inc (HK:2015), which clocked a 24.4% y-o-y drop in its December sales, fell 2.4%, while rivals NIO Inc (HK:9866) and Xpeng Inc (HK:9868) slid 6.4% and 5.2%, respectively. Xiaomi Corp (HK:1810), which entered the EV sector only recently, fell 2.5%.\nWant to know Wall Street’s top auto stock picks for 2026? Subscribe to InvestingPro-- Get over 50% today!\nData from the China Passenger Car Association showed EV sales grew 5% y-o-y in December. But growth was much slower than the 32.2% jump seen December 2024. \nThe slowdown comes after Beijing said it will wind down some subsidies and tax exemptions for EV buyers, amid overheated competition in the sector. The government was also seen intervening to dissuade companies from cutting prices aggressively and undercutting their rivals. \nDespite logging mostly strong sales, Chinese EV makers have struggled with profitability in recent years, as a bitter price war in the sector largely wiped out margins. Tesla was also battered by increased competition in China, while BYD was seen challenging the American EV maker in European markets. \n Which stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\n\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\n\nWhich stock will be the next to soar?\nPick Stocks with AI\n0\nLatest comments\nPost\nComment Guidelines\nOleh Feshchenko\nJan 05, 2026, 20:48\nHello world!\nReply\n0\n0\nIndices\nCommodities\nBonds\nStocks\n1D\n1W\n1M\n6M\n1Y\n5Y\nMax\n30/01\n06:00\n12:00\n18:00\n48 250\n48 500\n48 750\nUS 30 48,856.90 -214.7 -0.44%\nUS 500 6,935.50 -33.4 -0.48%\nDow Jones 48,892.47 -179.09 -0.36%\nS&P 500 6,939.03 -29.98 -0.43%\nNasdaq 23,461.82 -223.30 -0.94%\nS&P 500 VIX 17.44 +0.56 +3.32%\nDollar Index 96.86 +0.720 +0.75%\nInvesting Challenges\nJoin our investing challenges and compete for rewards while you learn!\nTake the Challenge\nMost Popular Articles\nNews\nAnalysis\nHotel stocks - here are winners and losers from weak dollar\nBy Investing.co...\nFeb 01, 2026\nIs the U.K. economy on the brink of a recession? BCA Research weighs in.\nBy Investing.co...\nFeb 01, 2026\nWill the ECB respond to the rising euro? Analyst weighs\nBy Investing.co...\nFeb 01, 2026\nReaction Roundup: Experts weigh in on Warsh as Fed chair pick\nBy Investing.co...\nJan 31, 2026\nCan U.S. dollar remain as the backbone of the global financial system?\nBy Investing.co...\nJan 31, 2026\nMore News\nMarket Movers\nMost Active\nGainers %\nLosers %\nName Last Chg. % Vol.\nNVDA\n191.13 -0.72% 179.49M\nAAPL\n259.48 +0.46% 92.44M\nTSLA\n430.41 +3.32% 82.63M\nMSFT\n430.29 -0.74% 58.57M\nMU\n414.88 -4.80% 51.02M\nSNDK\n576.25 +6.85% 40.93M\nMETA\n716.50 -2.95% 23.74M\nTrending Stocks\nName Last Chg. % Vol.\nTSLA\n430.41 +3.32% 82.63M\nMSFT\n430.29 -0.74% 58.57M\nNVDA\n191.13 -0.72% 179.49M\nAAPL\n259.48 +0.46% 92.44M\nPLTR\n146.59 -3.47% 47.27M\nShow more\nMarkets\nAsk WarrenAI\nNew\nStocks Picked by AI\nWatchlist\nAlerts\nTop Brokers\nNew\nBreaking News\nTools\nInstall Our App\nScan QR code to install app\nGoogle Play\nApp Store\nBlog\nMobile\nPortfolio\nWidgets\nAbout Us\nAdvertise\nHelp & Support\nAuthors\nRisk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political eve", "Content_Length": 6564, "Word_Count": 1049, "Image_URLs": ["https://i-invdn-com.investing.com/news/providers/investing-new.png", "https://i-invdn-com.investing.com/news/LYNXMPED0B12Y_L.jpg", "https://i-invdn-com.investing.com/defaultUserMaleTmp.png"], "News_URL": "https://www.investing.com/news/stock-market-news/china-ev-stocks-fall-as-weak-dec-sales-drive-demand-concerns-4428766", "Scrape_Time_Sec": 23.42602515220642}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-02T14:48:00+00:00", "News_Date_Formatted": "2026-01-02 14:48:00 (GMT+0)", "Week_Num": 5, "News_Title": "BYD overtakes Tesla to become top seller of electric vehicles - and the gap is big", "News_Source": "MORNINGSTA", "News_Content": "News\nMarketWatch\nBYD overtakes Tesla to become top seller of electric vehicles - and the gap is big\nBYD overtakes Tesla to become top seller of electric vehicles - and the gap is big\nProvided by Dow Jones Jan 2, 2026, 10:48:00 PM\nBy Barbara Kollmeyer\nPractitioners perform martial art next to a BYD Sealion 7 electric vehicle (EV) by Chinese car manufacturer BYD on display at Singapore Motorshow in Singapore on Jan. 9, 2025. BYD sales are set to surpass Tesla's globally for 2025.\nChinese automaker BYD became the biggest global seller of battery-powered vehicles last year, according to figures released on Friday.\nReporting unaudited numbers on Jan. 1, BYD (CN:002594) said sales of battery electric vehicles rose 27% last year to 2.25 million, with plug-in hybrid electric cars sales falling 7% to 2.25 million. BYD sold a total of 4.6 million new energy vehicles in the year, a 7.7% gain on 2024. Its shares (HK:1211) rose 3.5% in Hong Kong on Friday.\nOn Friday, Tesla (TSLA) said it sold 1.63 million vehicles in 2025, below the 1.78 million it delivered in 2024, the company's second straight annual drop. Between October and December, Tesla said it delivered 418,227 vehicles, below the 440,000 expected from Wall Street.\nTesla has faced stiff competition in China from BYD and Xiaomi (HK:1810), with its deliveries in the country down by more than 8% through November.\nRead: Meet the best non-Tesla EV stocks of 2025\nShares of Tesla rose 1.3% on Friday, with the tech sector COMP broadly looking stronger. The stock rose 18% in 2025.\nLast year saw Chief Executive Elon Musk rankle investors with his involvement in U.S. politics. European buyers shunned his cars, with deliveries in the region down nearly 39% through November. On Friday, Spain reported new Tesla registrations fell 44% annually in December, versus a 137% gain for BYD sales, according to data from the Spanish Association of Automobile and Truck Manufacturers, or ANFAC .\nBYD shares, though, gained just 3.7% last year as it faces a tougher domestic market and rising competition.\nThe EV maker also lost a big champion this year as Warren Buffett's Berkshire Hathaway (BRK.A) ended its investment in the Chinese automaker that began in 2008. Its shares never recovered from a high seen last May.\nAccording to automotive analysis group Autovista24, BYD held the lead for EV sales in the first half of this year, with a 19.9% share of the global EV market, versus 7.5% for Tesla.\nRead: A humanoid-robot revolution is coming. Don't worry - here's why it will take a while.\n-Barbara Kollmeyer\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.\n(END) Dow Jones Newswires\n01-02-26 0948ET\nCopyright (c) 2026 Dow Jones & Company, Inc.\nTake Action with Morningstar Investor: Screen for best investments using our stock star ratings, fair value estimates, moat ratings, and unbiased analyses.\nGet 7 Days Free\nThe articles, information, and content displayed on this webpage may include materials prepared and provided by third parties. Such third-party content is offered for informational purposes only and is not endorsed, reviewed, or verified by Morningstar.\nMorningstar makes no representations or warranties regarding the accuracy, completeness, timeliness, or reliability of any third-party content displayed on this site. The views and opinions expressed in third-party content are those of the respective authors and do not necessarily reflect the views of Morningstar, its affiliates, or employees.\nMorningstar is not responsible for any errors, omissions, or delays in this content, nor for any actions taken in reliance thereon. Users are advised to exercise their own judgment and seek independent financial advice before making any decisions based on such content. The third-party providers of this content are not affiliated with Morningstar, and their inclusion on this site does not imply any form of partnership, agency, or endorsement.\nMore in Markets\nView All\nSmart Investor: Dividend Aristocrats, AI’s Electricity Issues, and a Private Credit Fund Takes a Hit\nWrapping up our coverage of the markets and the week.\nTom Lauricella Jan 31, 2026\nWeekly Market Update: Stocks Gain 0.1% as Energy Rises and Basic Materials Fall\nHuya was the top-gaining stock of the week, while Humana and UnitedHealth both fell more than 19%.\nRachel Schlueter Jan 30, 2026\nWhat 7 Key Indicators Are Saying About the Market\nWhen almost everything is trading at a high level, a measure of caution is warranted for investors.\nAmy C. Arnott, CFA Jan 30, 2026\nMore in Stocks\nView All\nAdd These Core Stocks to Your Buy List in 2026\nThese undervalued stocks with wide economic moats and consistent cash flows look attractive.\nSusan Dziubinski Jan 27, 2026\n3 New 5-Star Stocks This Week\nTyler Technologies and Zimmer Biomet are now seen as signifcantly undervalued.\nBella Albrecht Jan 26, 2026\nThe 10 Best Companies to In", "Content_Length": 5106, "Word_Count": 834, "Image_URLs": ["https://morningstar-morningstar-prod.web.arc-cdn.net/resizer/Yl155jF6kL-hReLMtD2qaXZYri0=/2401x2401/cloudfront-us-east-1.images.arcpublishing.com/morningstar/7GRLSZCKIBBZ3LSLC7GWE46BWM.jpg", "https://morningstar-morningstar-prod.web.arc-cdn.net/resizer/Im4V4skkdQ4SyAQ6Rabkxislm-k=/2400x2400/cloudfront-us-east-1.images.arcpublishing.com/morningstar/ZFH3UKFV7JBGHB7CUXGZBTDEUA.jpg", "https://morningstar-morningstar-prod.web.arc-cdn.net/resizer/G0DWLFqNN4E7zQpYcuMhHPHUWYA=/2400x2400/cloudfront-us-east-1.images.arcpublishing.com/morningstar/SOLFDSA7NNF4RMXXVIQBPYTP5M.png", "https://morningstar-morningstar-prod.web.arc-cdn.net/resizer/xrWA-dxWsUXc7_0iPf3JepC5XME=/2000x2000/d10o6nnig0wrdw.cloudfront.net/01-26-2026/t_de9b5a604b97453ba785cc0c1131feef_name_file_960x540_1600_v4_.jpg", "https://morningstar-morningstar-prod.web.arc-cdn.net/resizer/FKaEggWwhXPE8ojRo21uKNA-67Y=/2401x2401/cloudfront-us-east-1.images.arcpublishing.com/morningstar/AICDMSLNPFGUTDXK2WKF7LC4NA.png", "https://tvspix.com/t.png?&t=1769957037912&l=tvscientific-pix-o-98f51bdf-8e73-4dbb-a892-2532f3f6678e&u3=https%3A%2F%2Fwww.morningstar.com%2Fnews%2Fmarketwatch%2F20260102163%2Fbyd-overtakes-tesla-to-become-top-seller-of-electric-vehicles-and-the-gap-is-big"], "News_URL": "https://www.morningstar.com/news/marketwatch/20260102163/byd-overtakes-tesla-to-become-top-seller-of-electric-vehicles-and-the-gap-is-big", "Scrape_Time_Sec": 6.015043497085571}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2025-12-28T22:42:13.898474+00:00", "News_Date_Formatted": "2025-12-28 22:42:13 (GMT+0)", "Week_Num": 6, "News_Title": "BYD stock split: all investors need to know about a possible BYD split", "News_Source": "CAPITAL", "News_Content": "BYD stock split: all investors need to know about a possible BYD split\nThe share price performance of Build Your Dreams has gained increasing attention in recent years by worldwide equity investors, especially after reaching its highest pre-split levels, a milestone that reignited debate about potential liquidity measures.\n1211 +0.2%\nBy Dan Mitchell\n15:40 (UTC), 22 December 2025\nPhoto: Shutterstock.com\nThe share price performance of Build Your Dreams has gained increasing attention in recent years by worldwide equity investors, especially after reaching its highest pre-split levels, a milestone that reignited debate about potential liquidity measures. As one of the world’s largest electric vehicle and battery manufacturers, BYD’s rising valuation has prompted ongoing discussion about whether another stock split could become relevant.\nWhat is Build Your Dreams?\nFounded in 1995 by chemist Wang Chuanfu, BYD is a Chinese electric vehicle, battery and clean-energy technology company. Originally established as Shenzhen BYD Battery Co, the company was founded with a focus on rechargeable NiCd and later lithium-ion batteries for mobile electronics. The firm is headquartered in Shenzhen and has been listed on the Hong Kong Stock Exchange since 2002, and the Shenzhen Stock Exchange since 2011.\nBYD evolved from a pure-play battery manufacturer into an integrated electric vehicle ecosystem player covering passenger cars, commercial vehicles, energy storage systems, and semiconductor components. The company has also strengthened its international presence, with more than 30 industrial parks on six continents and rapid growth in Europe, Latin America, and Southeast Asia, supported by local distribution partnerships, assembly facilities, and regional subsidiaries.\nHistorical context\nBYD's stock experienced notable ups and downs in earlier years. The stock fell more than 60% from its peak in 2021, driven by softer global EV demand, an intense price war in China – which saw the average EV prices decline by around 20% in 2022, and broader macroeconomic headwinds such as China's zero-COVID lockdowns and interest-rate increases.\nSince 2022-2023, the stock staged a strong rebound. Shares surged about 150% from the lows in October 2022, buoyed by increasing vehicle deliveries and stronger operational efficiency in the EV mass-market segment.\nDeliveries of vehicles increased from 1.86m units in 2022 to a record 4.27m in 2024, including 1.76m pure EVs. Gross margins expanded to about 21% in 2024 from 18% in 2022. Models such as the Seagull and Qin Plus helped BYD capture about 36% of China's NEV market in 2024. Investor sentiment further improved with battery production capacity exceeding 200 GWh a year and cost discipline strengthened through vertical integration.\nAt the end of 2025, shares of BYD were trading post-split; performance reflects strong YTD gains but is adjusted from pre-split levels. Year-to-date gains also outperform many traditional carmakers and wider regional equity benchmarks.\n1d\n1h\n4h\n1m\n5m\n15m\n30m\n1w\nPast performance is not a reliable indicator of future results.\nRecent financials & operating metrics\nBYD has been reporting solid growth across key operating indicators. Vehicle deliveries have continued to rise year after year on strong domestic demand and expanding overseas sales.\nIts vertical integration strategy has helped hedge against margin pressure during periods of pricing competition in the global EV market. Aside from passenger vehicles, energy storage and battery technologies are supporting revenue growth. BYD has also invested heavily in next-generation batteries, focused on improving charging speed, safety, and energy density.\nWhat is a stock split?\nA stock split is when a company increases the number of its outstanding shares – for example, through a 2-for-1 or 3-for-1 split, which decreases the price per share without changing the company's overall market capitalisation.\nThe aim is typically to increase liquidity and make stocks more accessible to retail investors. The company’s fundamentals remain unchanged.\nHow many times has Build Your Dreams stock split?\nThere indeed is a Build Your Dreams stock split history. BYD carried out a 3:1 stock split on its Hong Kong listing effective 10 June 2025. Alongside dividend declarations and capital adjustments, BYD also completed a 3:1 split in June 2025 and previously in 2008.\nDiscussion of another potential Build Your Dreams split is entirely speculative as of the end of 2025.\nInfluencing factors for a BYD stock split in the future\nSeveral elements could shape whether BYD considers another split in the coming years.\nShare price level\nOne factor behind stock splits is a high nominal share price. If BYD’s valuation continues to appreciate, management may consider a split to improve accessibility.\nMarket environment\nGlobal sentiment towards EV makers, battery technology, and clean-energy infrastructure can influence corporate decisions. Supportive equity co", "Content_Length": 6338, "Word_Count": 948, "Image_URLs": ["https://img.capital.com/imgs/articles/1920x1140x0/shutterstock_2628707637.jpg"], "News_URL": "https://capital.com/en-int/analysis/byd-stock-split", "Scrape_Time_Sec": 4.0135228633880615}
