{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-30T17:09:00+00:00", "News_Date_Formatted": "2026-01-30 17:09:00 (GMT+0)", "News_Title": "Battery Energy Storage System Market to Reach US$ 68.22 Billion by 2033 Driven by Renewable Energy Integration and Grid Stability Says Astute Analytica", "News_Source": "YAHOO", "News_Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\nBattery Energy Storage System Market to Reach US$ 68.22 Billion by 2033 Driven by Renewable Energy Integration and Grid Stability Says Astute Analytica\nAstuteAnalytica India Pvt. Ltd.\nSat, January 31, 2026 at 1:09 AM GMT+8 7 min read\nIn this article:\nTSLA\n+3.32%\nBYDDF\n-2.94%\nPCRFF\n0.00%\nSIEGY\n-1.02%\nAstuteAnalytica India Pvt. Ltd.\nThis growth is attributed by rapid adoption of renewable energy, growing electrification across industries, and widespread deployment of utility-scale, residential, and commercial storage solutions; with aggregated battery capacity nearing 280 GWh, over 10 million households relying on compact units, and second-life EV packs mitigating e-waste, modular systems from leaders like Tesla, LG, BYD, Panasonic, and Siemens are stabilizing grids, enabling behind-the-meter energy management, and supporting microgrids, while advanced dispatch systems and on-grid installations enhance real-time load balancing, voltage support, and frequency stabilization across Asia, North America, and Europe.\nChicago, Jan. 30, 2026 (GLOBE NEWSWIRE) -- The global battery energy storage system market was valued at 8.08 billion in 2024 and is expected to reach US$ 68.22 billion by 2033, growing at a CAGR of 26.75% from 2025 to 2033.\nThe battery energy storage system market terrain has accelerated remarkably in 2024, boosted by the expanding adoption of renewable power sources and widespread electrification across industries. As nations seek cleaner grids, around 1,500 operational storage projects now stabilize utility-scale power worldwide, mitigating voltage dips and smoothing peak demands. In parallel, the presence of more than 30 million battery electric vehicles (BEVs) underscores the urgent demand for advanced charging infrastructure. With total renewable electricity generation surpassing 10,000 terawatt-hours this year, battery-based solutions have taken center stage in offsetting the intermittency of wind and solar. About 2,200 terawatt-hours of that figure stem from solar alone, catalyzing an upsurge in behind-the-meter deployments. Commercial sites are also adopting energy storage in record numbers, with nearly 4,000 on-site battery installations supporting backup power and cost optimization. These developments are accompanied by significant research endeavors, including collaborative projects among 25 nations seeking to design battery cells that can withstand upwards of 5,000 charge-discharge cycles.\nRequest Sample Pages: https://www.astuteanalytica.com/request-sample/battery-energy-storage-system-market\nNote: This report is readily available for immediate delivery. We can review it with you in a meeting to ensure data reliability and quality for decision-making.\nAutomotive-Grade Packs Find Second Life, Reducing E-Waste and Supply Pressures\nBy 2024, aggregated battery storage capacity will have climbed to nearly 280 gigawatt-hours, reflecting a global transition toward more reliable and sustainable energy systems. Roughly 10 million households now rely on compact residential battery units in the battery energy storage system market, helping to safeguard against grid disruptions. Automotive-grade packs from retired electric vehicles are increasingly funneled into second-life projects, reducing e-waste and alleviating supply constraints for new cells. In response to mounting competition, major industry players such as Tesla, LG Energy Solution, BYD, Panasonic, and Siemens have presented modular solutions for everything from suburban microgrids to commercial skyscrapers. This multi-faceted approach helps ensure stable power whenever renewable outputs fluctuate. To future-proof grids, at least 12 major energy conglomerates worldwide have commissioned pilot programs harnessing solid-state battery prototypes that promise higher energy density and improved safety metrics. With governments, utilities, and the private sector working in tandem, battery energy storage continues to gain traction as a linchpin technology for advancing renewable integration, reducing carbon footprints, and modernizing aging electrical infrastructure.\nStory Continues\n\n\n\n\n\n\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 4264, "Word_Count": 573, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/8cvs4Vdz6uI4Y6rzp3KbEQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTQyMDtoPTQyMDtjZj13ZWJw/https://media.zenfs.com/en/globenewswire.com/dc7cef0d35ec22446236715ef3d86dcc"], "News_URL": "https://finance.yahoo.com/news/battery-energy-storage-system-market-170900260.html?.tsrc=rss", "Scrape_Time_Sec": 8.922396659851074}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-30T16:13:24+00:00", "News_Date_Formatted": "2026-01-30 16:13:24 (GMT+0)", "News_Title": "BYD Expands Beyond China With New Capacity In India Mexico Vietnam", "News_Source": "YAHOO", "News_Content": "BYD Expands Beyond China With New Capacity In India Mexico Vietnam\nSimply Wall St\nSat, January 31, 2026 at 12:13 AM GMT+8 3 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nFind winning stocks in any market cycle. Join 7 million investors using Simply Wall St's investing ideas for FREE.\nBYD, ticker SEHK:1211, is stepping up its global expansion with new moves in India, Mexico, and Vietnam.\nIn India, the company is exploring local assembly options to work around import restrictions on electric vehicles.\nIn Mexico, BYD is adjusting its plans in response to higher tariffs that affect imported vehicles and components.\nIn Vietnam, BYD is partnering on a new EV battery plant that would broaden its manufacturing base in Southeast Asia.\nAt a current share price of HK$97.75, BYD is in a phase where investors are weighing its China exposure against its push into overseas markets. The stock has gained 8.6% over the past 1 year and 18.7% over 3 years, while the year-to-date return stands at a 1% decline. This context highlights international expansion as an important part of the story for SEHK:1211 and illustrates where management is focusing its efforts geographically as domestic growth slows.\nFor investors, a key question is how effectively BYD can build and operate capacity in markets such as India, Mexico, and Vietnam while managing tariffs and policy changes. The new battery plant partnership in Vietnam and possible local assembly in India could move more of its supply chain closer to end markets, which may influence costs, pricing power, and competitive positioning over time.\nStay updated on the most important news stories for BYD by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on BYD.\nSEHK:1211 Earnings & Revenue Growth as at Jan 2026\nHow BYD stacks up against its biggest competitors\nFor BYD, pushing deeper into India, Mexico, and Vietnam looks like an attempt to reduce reliance on any single policy regime and bring production closer to customers. Local assembly in India and potential plant investments in Mexico and Vietnam could give the company more control over tariffs, logistics, and model mix in markets where competitors such as Tesla and Volkswagen are also trying to expand their presence.\nBYD narrative, from China champion to global capacity builder\nThis news fits a wider story of BYD trying to shift from a mainly China-focused EV and battery producer to a more balanced global operator. Investors following the BYD narrative may see these projects as part of a longer-term effort to match manufacturing footprints with overseas demand rather than relying heavily on exports from China.\nRisks and rewards for investors to weigh\n🎁 Potential for better pricing and cost control if local assembly in India and tariffs in Mexico are managed through on-the-ground capacity and flexible sourcing.\n🎁 The Vietnam battery plant can broaden BYD's supply base in Southeast Asia and support more regional vehicle production partnerships.\n⚠️ Higher tariffs in Mexico and policy shifts in large markets add execution risk if new facilities do not reach efficient scale quickly.\n⚠️ Faster overseas build out requires capital and management focus, which may stretch operations while BYD also competes with Tesla, Volkswagen, and others in key EV markets.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3407, "Word_Count": 548, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/OWN26h15q0WBWxKjMbNJ7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYxMztjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/17b0e84622d2fb9c7e9cd0e645ef9f2c"], "News_URL": "https://finance.yahoo.com/news/byd-expands-beyond-china-capacity-161324993.html?.tsrc=rss", "Scrape_Time_Sec": 4.711370229721069}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-28T17:15:18+00:00", "News_Date_Formatted": "2026-01-28 17:15:18 (GMT+0)", "News_Title": "BYD’s European EV Surge Puts Pressure On Tesla And Volkswagen", "News_Source": "YAHOO", "News_Content": "BYD’s European EV Surge Puts Pressure On Tesla And Volkswagen\nSimply Wall St\nThu, January 29, 2026 at 1:15 AM GMT+8 3 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nTSLA\n+3.32%\nVLKAF\n+1.74%\nGet insights on thousands of stocks from the global community of over 7 million individual investors at Simply Wall St.\nBYD (SEHK:1211) has rapidly increased electric vehicle sales in Europe, contributing to fully electric cars outselling petrol models for the first time.\nThis shift highlights a change in European car buyer preferences toward battery electric vehicles.\nThe development reflects the growing presence of Chinese automakers in European passenger car markets.\nBYD, known for its electric vehicles and batteries, is now a prominent name in Europe as buyers move toward fully electric cars instead of petrol models. This shift aligns with tighter emissions rules, expanding charging networks, and broader policy support for electrification. For investors, it places BYD alongside long established brands in a region that has been a key market for global automakers.\nAs electric cars gain share, attention may focus on how BYD positions its product range, pricing, and local partnerships across Europe. Readers may want to watch how regulators, incumbents, and consumers respond to the growing role of Chinese brands, since that can influence competitive pressure and capital allocation decisions across the sector.\nStay updated on the most important news stories for BYD by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on BYD.\nSEHK:1211 1-Year Stock Price Chart\nWhy BYD could be great value\nBYD's surge in European electric vehicle registrations, while fully electric cars slightly outsold petrol models for the first time, suggests investors are seeing the company as a credible contender to Tesla and Volkswagen in a key global market. For you, this points to growing investor attention on how BYD executes on distribution, brand-building and local production as Europe leans further into battery electric vehicles.\nHow this fits into the broader BYD narrative\nThe shift in buyer interest toward fully electric cars gives more weight to narratives that view BYD as a long-term EV specialist rather than just a China-focused automaker. Investors who already followed BYD for its vertical integration in batteries and vehicles may read this European traction as an extension of that story into a region where competitors like Tesla, Volkswagen and Stellantis are already well known.\nRisks and rewards investors are weighing\nBYD's strong registration growth in Europe suggests rising brand visibility with consumers and investors compared with peers such as Tesla and Volkswagen.\nGrowing EV share in Europe supports interest in companies focused on battery electric models, which aligns with BYD's core offering.\nAnalysts have flagged a risk tied to the quality of earnings, with a high level of non cash earnings that investors may want to understand in more detail.\nCompetition from established European brands and other Chinese manufacturers could affect pricing power and investor confidence if market share gains slow.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3252, "Word_Count": 502, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/byd-european-ev-surge-puts-171518197.html?.tsrc=rss", "Scrape_Time_Sec": 15.647600173950195}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-02-01T14:25:49.475621+00:00", "News_Date_Formatted": "2026-02-01 14:25:49 (GMT+0)", "News_Title": "{Hot Stocks}BYD COMPANY(01211) quoted at HK$113.2, down 2.6% - Free Real Time Stock Quote- Economics News - etnet", "News_Source": "ETNET", "News_Content": "繁體版／简体版 | Set Homepage | Switch Color\nQuote | Super Quote\nStocks\nFutures\nWarrants / CBBC\nETF\nHK GoGoGo\nHome\n|\nRT Quote\n|\nIndices\n|\nIndustry\n|\nTop 20\n|\nRecord High\n|\nShort Sell\n|\nHot Sector\n|\nAH\n|\nIPO\n|\nCompany Info\nSuper Quote   |   Detail Quote   |   Interactive Chart   |   Transaction   |   Related News   |   Related Securities   |   Company Information   |   Dividend Records   |   Short Sell\n01211 BYD COMPANY\nNominal 97.750 -4.050 (-3.978%)\nOthers\n04/08/2025 09:30\n{Hot Stocks}BYD COMPANY(01211) quoted at HK$113.2, down 2.6%\n[ET Net News Agency, 4 August 2025] BYD COMPANY (01211) fell 2.6% to HK$113.2.\nIt hits an intra-day low of HK$112.6, hitting an 1-month low, and an intra-day high of\nHK$113.4. The total shares traded was 1.86 million, with a value of HK$209.94m. The active\nbuy/sell ratio is 69:31, with net buying turnover of HK$13.34m. CHINA INV INFO accounts\nfor greatest net responsive buying turnover of HK$1.57m, with volume weighted average\nprice of HK$112.811. CLSA LTD accounts for greatest net responsive selling turnover of\nHK$6.02m, with volume weighted average price of HK$112.901.\nRMB counter of BYD COMPANY (81211) fell 3.3% to RMB103.8. It hits an intra-day low of\nRMB103.8, and an intra-day high of RMB109. The total shares traded was 2,500, with a value\nof RMB262,800.\nThe Hang Seng Index now fell 71 points, or 0.3% to 24,436; the Hang Seng China\nEnterprises Index now fell 25 points, or 0.3% to 8,778; the Hang Seng TECH Index now fell\n26 points, or 0.5% to 5,370.\n\nBasic Information\n=================\n\n-----------------------------------\nNominal 113.200 % Chg -2.58%\nHigh 113.400 Low 112.600\nShares Tr 1.86m Turnover 209.94m\n10-D SMA 125.080 %H.V 37.008\n20-D SMA 123.930 VWAP 112.986\n50-D SMA 127.449 RSI14 32.046\n-----------------------------------\nStatus: Hitting an 1-month low, active buy/sell ratio is 69:31, with net buying turnover\nof HK$13.34m\n\nPerformance of stocks in the same sector or of relevance\n========================================================\n\nStock (Code) Price (HK$) Change (%)\n---------------------------------------------\nBYD COMPANY (01211) 113.20 -2.58\nGEELY AUTO (00175) 17.65 -0.06\nXIAOMI-W (01810) 53.70 +0.56\nLI AUTO-W (02015) 100.30 -0.20\nGAC GROUP (02238) 3.12 -0.64\nGWMOTOR (02333) 12.66 -0.47\nLEAPMOTOR (09863) 57.60 -1.37\nNIO-SW (09866) 38.74 +2.49\nXPENG-W (09868) 71.90 +0.84\nBYD COMPANY-R (81211) RMB103.80 -3.26\n---------------------------------------------\n(ed)\nBack to Others\nRemark: Real time quote last updated: 30/01/2026 17:59\n  Real-time basic market prices of Hong Kong securities are provided by HKEx; a Designated Website authorized by the HKEx Group to provide the Service\nA Member of HKET Holdings\nCustomer Service Hotline:(852) 2880 7004     Customer Service Email:cs@etnet.com.hk\nSecurity Tips\nCopyright 2026 ET Net Limited. http://www.etnet.com.hk ET Net Limited, HKEx Information Services Limited, its Holding Companies and/or any Subsidiaries of such holding companies, and Third Party Information Providers endeavour to ensure the availability, completeness, timeliness, accuracy and reliability of the information provided but do not guarantee its availability, completeness, timeliness, accuracy or reliability and accept no liability (whether in tort or contract or otherwise) any loss or damage arising directly or indirectly from any inaccuracies, interruption, incompleteness, delay, omissions, or any decision made or action taken by you or any third party in reliance upon the information provided. The quotes, charts, commentaries and buy/sell ratings on this website should be used as references only with your own discretion. ET Net Limited is not soliciting any subscriber or site visitor to execute any trade. Any trades executed following the commentaries and buy/sell ratings on this website are taken at your own risk for your own account.", "Content_Length": 3852, "Word_Count": 574, "Image_URLs": ["https://www.etnet.com.hk/www/eng/common/images/arrow_up1.gif", "https://www.etnet.com.hk/www/eng/common/images/new_ico.gif", "https://www.etnet.com.hk/www/eng/stocks/images/channelico.jpg", "https://www.etnet.com.hk/www/eng/common/images/realtime_eng.gif", "https://www.etnet.com.hk/www/eng/common/images/arrow_down2_M.gif"], "News_URL": "https://www.etnet.com.hk/www/eng/stocks/realtime/quote_news_detail.php?section=related&code=1211&newsid=ETE350804285", "Scrape_Time_Sec": 4.660281658172607}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-01-27T08:07:20+00:00", "News_Date_Formatted": "2026-01-27 08:07:20 (GMT+0)", "News_Title": "Is It Time To Reconsider BYD (SEHK:1211) After Mixed Returns And Rich P/E Ratio", "News_Source": "YAHOO", "News_Content": "Is It Time To Reconsider BYD (SEHK:1211) After Mixed Returns And Rich P/E Ratio\nSimply Wall St\nTue, January 27, 2026 at 4:07 PM GMT+8 5 min read\nIn this article:\nBYDDF\n-2.94%\nBYDDY\n-3.32%\nNever miss an important update on your stock portfolio and cut through the noise. Over 7 million investors trust Simply Wall St to stay informed where it matters for FREE.\nIf you are wondering whether BYD's current share price reflects its true worth, you are not alone, as many investors are asking the same question before making their next move.\nBYD's shares last closed at HK$98.5, with returns of a 2.2% decline over 7 days, 5.2% over 30 days, a 0.3% decline year to date, 8.7% over 1 year, 27.2% over 3 years, and 24.6% over 5 years, a mixed set of numbers that naturally raises questions about value and risk.\nRecent headlines around BYD have focused on its position in electric vehicles and batteries, alongside ongoing attention on how competition and regulation affect major auto makers. These themes provide helpful context when thinking about how the stock has traded and what could be influencing sentiment.\nRight now BYD has a valuation score of 2 out of 6, which means it screens as undervalued on 2 of the 6 checks used in the analysis. Next, we look at how different valuation methods assess the stock, before finishing with a way of thinking about value that goes beyond any single model.\nBYD scores just 2/6 on our valuation checks. See what other red flags we found in the full valuation breakdown.\nApproach 1: BYD Discounted Cash Flow (DCF) Analysis\nA Discounted Cash Flow, or DCF, model estimates what a company could be worth by projecting its future cash flows and then discounting them back to today’s value. It is essentially asking what those future CN¥ cash flows are worth in present terms.\nFor BYD, the latest twelve month free cash flow is a loss of CN¥29,051.48m. Analysts and internal estimates project CN¥61,159.21m of free cash flow in 2026 and CN¥73,877.89m in 2027, with further CN¥ cash flows projected each year out to 2035 using a 2 Stage Free Cash Flow to Equity model. Simply Wall St uses analyst estimates where available, then extends the series using its own growth assumptions.\nWhen all those projected cash flows are discounted back, the model arrives at an estimated intrinsic value of HK$135.32 per share, compared to the recent share price of HK$98.50. This implies the shares trade at a 27.2% discount to this DCF estimate, which indicates the stock screens as undervalued on this model.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests BYD is undervalued by 27.2%. Track this in your watchlist or portfolio, or discover 888 more undervalued stocks based on cash flows.\n1211 Discounted Cash Flow as at Jan 2026\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for BYD.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 2942, "Word_Count": 505, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/_xOD.2UXosb3OmP3NDsK6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a3cef10a725c4d2226d0bfb44896d61f", "https://s.yimg.com/ny/api/res/1.2/ENS0yuV5tOb1yFGdWyxSPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTM4MDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/a8e2a0c79d6b17faefd5d823601ba7b6", "https://s.yimg.com/ny/api/res/1.2/TJN1Y.SdzyO01HwFDmALMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/887aeaefba898f3ffc0a62642cd9ac29"], "News_URL": "https://finance.yahoo.com/news/time-reconsider-byd-sehk-1211-080720276.html", "Scrape_Time_Sec": 5.414418935775757}
{"Stock_Code": "1211.HK", "Category": "Auto", "News_Date": "2026-02-01T14:25:16.981902+00:00", "News_Date_Formatted": "2026-02-01 14:25:16 (GMT+0)", "News_Title": "BYD Co. Ltd.", "News_Source": "BARRONS", "News_Content": "WSJ\nBarron's\nMarketWatch\nIBD\nWSJ | Buy Side\nSearch News & Quotes\nStock Picks\nMarket Data\nWatchlist\nMagazine\nAdvisor Center\nMarkets\nEconomy\nTech\nRetirement\nLatest\nMore Topics\nSubscribe Now\n|\nSign In\nDJIA Futures\n48980.00\n-0.06%\nS&P 500 Futures\n6961.25\n-0.06%\nNasdaq Futures\n25639.25\n-0.12%\nStoxx 600\n611.00\n0.64%\nSSE Index\n4117.95\n-0.96%\nCrude Oil\n65.74\n0.81%\nU.S. 10 Yr\n4.238\n0.000%\nBitcoin\n78019.94\n0.07%\nDollar Index\n97.15\n0.90%\nBarron's 400\n1461.69\n-1.34%\nMarket Data\n/\nStocks\n/\n1211\n/\nOverview\nBYD Co. Ltd. Follow\nHong Kong\nMarket Closed\nHK$97.75\n1211\n-4.05 (-3.98%)\nJan 30, 2026 4:08 p.m. HKST\nDelayed quote\nAbout BYD Co. Ltd.\nBYD Co., Ltd. engages in the research, development, manufacture, and sale of rechargeable batteries and photovoltaic business. It operates through the following segments: Rechargeable Batteries and Photovoltaic Products, Mobile Handset Components, Assembly Service and Other Products, and Automobiles and Related Products and Other Products. The Rechargeable Batter...\nSee Full Profile\nRecently Viewed Tickers\nSymbol\nPrice\nChange\n% Chg\n1211\nHK$97.75\n-4.05\n-3.98\nDJIA\n48,892.47\n-179.09\n-0.36\nSPX\n6,939.03\n-29.98\n-0.43\nCOMP\n23,461.82\n-223.30\n-0.94\nRUT\n2,613.74\n-41.03\n-1.55\nB400\n1,461.69\n-19.84\n-1.34\nAnalyst Ratings\nAverage price target from 1 ratings:\nHK$22.00\nAverage Score:\nSell\nUnder\nHold\nOver\nBuy\nFull Ratings\nPeers\nName\nChg %\nMarket Cap\nShenzhen Desay Battery Technology Co. Ltd.\n+0.93\n¥9.94B\nChina Shipbuilding Industry Group Power Co. Ltd. A\n-0.87\n¥58.77B\nEVE Energy Co. Ltd.\n+5.07\n¥139.32B\nSimplo Technology Co. Ltd.\n+0.73\nNT$63.91B\nAmara Raja Energy & Mobility Ltd.\n+1.11\n₹120.71B\nOpen\nHK$101.80\nPrevious Close\nHK$101.80\nYTD Change\n2.52%\n12 Month Change\n7.42%\nDay Range\n97.40 - 101.80\n52 Wk Range\n88.67 - 159.27\nAdvanced\n$\n1D\nCompare\n10 am\n2 pm\n4 pm\nHK$94\nHK$96\nHK$98\nHK$100\nHK$102\nEnd of interactive chart.\nVolume\n28.69M (128.86% of Avg)\n65 Day Avg: 22.26M\nAverage Volume\n22.26M\nMarket Value\nHK$906.57B\nShares Outstanding\n3.68B\nEPS (TTM)\nHK$4.64\nP/E Ratio (TTM)\n21.07\nDividend Yield\n1.12%\nLatest Dividend\nHK$1.14\nEx-Dividend Date\nJun 11, 2024\nBeta\n1.23\nShort Interest\nN/A\nShort Interest Change\nN/A\nPercent of Float\nN/A\nBuild Your Watchlist\nPersonalize and monitor market data with your custom tool.\nRegister Now\nSymbol Price/Vol % Chg\narrow_downward\nDJIA\nDow Jones Industrial Average\n48,892.47\n--\n-0.36%\n-179.09\narrow_upward\nAAPL\nApple Inc.\n259.48\nVol. 92M\n0.46%\n1.20\narrow_downward\nMSFT\nMicrosoft Corp.\n430.29\nVol. 59M\n-0.74%\n-3.21\narrow_downward\nGOOG\nAlphabet Inc. Cl C\n338.53\nVol. 22M\n-0.04%\n-0.13\nOVERVIEW\nTopics\nCryptocurrencies\nData\nMagazine\nMarkets\nStock Picks\nBarron's Live\nRoundtable\nBarron's Stock Screen\nPersonal Finance\nStreetwise\nAdvisor Directory\nMemberships\nSubscribe to Barron's\nTools\nSaved Articles\nWatchlist\nNewsletters\nVideo Center\nCustomer Service\nCustomer Center\nNetwork\nThe Wall Street Journal\nMarketWatch\nInvestor's Business Daily\nMansion Global\nFinancial News London\nDow Jones Smart Money\nNewsstand\nBuy Issues\nReprints\nE-Edition\nFor Business\nCorporate Subscriptions\nFor Education\nInvesting in Education\nFor Advertisers\nPress & Media Inquiries\nAdvertising\nAccount\nSign In\nSubscriber Benefits\nManage Notifications\nManage Alerts\nAbout Barron's\nLive Events\nCentennial\nPrivacy Notice\nCookie Notice\nCopyright Policy\nAccessibility\nData Policy\nYour Ad Choices\nTerms of Use\nCommunity Rules\nBarron's Archive\nCopyright © 2026 Dow Jones & Company, Inc. All Rights Reserved.", "Content_Length": 3427, "Word_Count": 514, "Image_URLs": [], "News_URL": "https://www.barrons.com/market-data/stocks/1211?countrycode=hk&gaa_n=AWEtsqf3TkdcSWH0WHGohtna20Rzut7UYSN8rtAP_v3g6v3bmywn-uNZgHck&gaa_ts=697882d1", "Scrape_Time_Sec": 8.284673690795898}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-02-01T14:27:23.075566+00:00", "News_Date_Formatted": "2026-02-01 14:27:23 (GMT+0)", "News_Title": "Tencent stock price target raised to HK$790 from HK$700 at Benchmark", "News_Source": "INVESTING", "News_Content": "Get 50% Off\nSign In\nFree Sign Up\nMarkets\nMy Watchlist\nInvesting Challenges\nCharts\nNews\nAnalysis\nTechnical\nBrokers\nTools\nAcademy\nEconomic Calendar\nStock Screener\nMore\nLatest\nMost Popular\nBreaking News\nForex\nCommodities\nStock Markets\nEconomic Indicators\nEconomy\nCryptocurrency\nInsider Trading\nCompany News\nEarnings\nInvestment Ideas\nSWOT Analysis\n🚪 February's AI-picked stock list about to go live. Opportunity is knocking...\nPick Stocks with AI\nTencent stock price target raised to HK$790 from HK$700 at Benchmark\nAnalyst Ratings\nPublished 14/11/2025, 15:40\n0\n© Reuters.\n0700\n-2.57%\nInvesting.com - Benchmark raised its price target on Tencent Holdings (HK:0700) (OTC:TCEHY) to HK$790 from HK$700 while maintaining a Buy rating following the company’s strong third-quarter performance.\nThe Hong Kong-based tech giant delivered accelerating revenue growth above mid-teens in Q3 2025, driven by solid performance across key segments, particularly in online games and advertising.\nThe online games segment outperformed expectations, benefiting from strong domestic growth and international trends, reinforcing Tencent’s expanding position in global gaming.\nAdvertising also exceeded forecasts, fueled by AI-enhanced user engagement and improved AdTech conversion, with the launch of AIM+, Tencent’s automated ad solution, representing a significant step forward in leveraging AI to drive higher conversion rates.\nBenchmark cited Tencent’s disciplined capital expenditure approach amid global chip constraints as strategic rather than a deviation from industry trends, noting the company remains well-positioned as a key beneficiary of AI with its proprietary data and deep integration within the Weixin ecosystem.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\n\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\n\nWhich stock will be the next to soar?\nPick Stocks with AI\n0\nLatest comments\nPost\nComment Guidelines\nIndices\nCommodities\nBonds\nShares\n1D\n1W\n1M\n6M\n1Y\n5Y\nMax\n30/01\n10:00\n12:00\n14:00\n1…\n10 100\n10 150\n10 200\nFTSE 100 10,223.54 +51.78 +0.51%\nDAX 24,538.81 +229.35 +0.94%\nEuro Stoxx 50 5,947.81 +55.86 +0.95%\nS&P 500 6,939.03 -29.98 -0.43%\nNikkei 225 53,322.85 -52.75 -0.10%\nDow Jones 48,892.47 -179.09 -0.36%\nFTSE 100 Futures 10,189.50 +34.5 +0.34%\nInvesting Challenges\nJoin our investing challenges and compete for rewards while you learn!\nTake the Challenge\nMost Popular Articles\nNews\nAnalysis\nIs the U.K. economy on the brink of a recession? BCA Research weighs in.\nBy Investing.co...\n01 Feb 2026\n5 big analyst AI moves: Apple faces ’further downside’; ASML, AMAT upgraded\nBy Investing.co...\n01 Feb 2026\nUBS discusses top themes for media in 2026\nBy Investing.co...\n01 Feb 2026\nResMed stock price target raised to $314 from $311 at RBC Capital\nBy Investing.co...\n30 Jan 2026\nBitcoin price today: tumbles to $83k as heavy liquidations, Fed uncertainty weigh\nBy Investing.co...\n30 Jan 2026\nMore News\nMarket Movers\nMost Active\nGainers %\nLosers %\nName Last Chg. % Vol.\nGlencore\n499.25 -1.70% 55.75M\nHSBC\n1,285.40 +1.21% 22.62M\nRelx\n2,579.00 -0.58% 7.93M\nShell\n2,794.0 -0.13% 6.95M\nBritish American Tobacco\n4,376.0 +1.13% 5.55M\nRio Tinto PLC\n6,738.0 -1.62% 4.03M\nAstraZeneca\n13,600.0 +1.04% 1.64M\nTrending Stocks\nName Last Chg. % Vol.\nHSBC\n1,285.40 +1.21% 22.62M\nLloyds Banking\n108.95 +3.32% 158.37M\nRolls-Royce Holdings\n1,211.00 +0.83% 13.56M\nRio Tinto PLC\n6,738.0 -1.62% 4.03M\nFresnillo\n3,702.00 -5.08% 2.79M\nShow more\nMarkets\nAsk WarrenAI\nNew\nStocks Picked by AI\nWatchlist\nAlerts\nTop Brokers\nNew\nBreaking News\nTools\nInstall Our App\nScan QR code to install app\nGoogle Play\nApp Store\nBlog\nMobile\nYour Portfolio\nWidgets\nAbout Us\nAdvertise\nHelp & Support\nRisk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks.\nBefore deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed.\nFusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily pr", "Content_Length": 6034, "Word_Count": 926, "Image_URLs": ["https://i-invdn-com.investing.com/news/providers/investing-new.png", "https://i-invdn-com.investing.com/news/LYNXMPEB0Q0HK_L.jpg", "https://eb2.3lift.com/getuid?gdpr=0&cmp_cs=&us_privacy=&redir=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26triplelift_uid%3D$UID", "https://sync.go.sonobi.com/us?gdpr=0&consent_string=&us_privacy=&loc=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26sonobi_uid%3D%5BUID%5D", "https://ssum-sec.casalemedia.com/usermatchredir?s=196326&gdpr=0&gdpr_consent=&us_privacy=&cb=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26ix_uid%3D", "https://csync.loopme.me/?pubid=11586&gdpr=0&gdpr_consent=&us_privacy=&redirect=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26loopme_uid%3D%7Bviewer_token%7D", "https://sync.1rx.io/usersync2/rmpssp?sub=sportority&gdpr=0&gdpr_consent=&us_privacy=&redir=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26unruly_uid%3D%5BRX_UUID%5D", "https://u.openx.net/w/1.0/cm?id=6667519e-f89c-40a7-9fb6-e7217998098f&gdpr=0&gdpr_consent=&us_privacy=&r=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26openx_uid%3D%7BOPENX_ID%7D%20", "https://cs.media.net/cksync.php?cs=81&type=vol&gdpr=0&gdpr_consent=&redirect=https%3A%2F%2Frtb.voltaxam.com%2FcookieSync%3FvoltaxRTBUserID%3D01kgcskam7c59aq7fb7pp6dxa4%26medianet_uid%3D%3Cvsid%3E"], "News_URL": "https://uk.investing.com/news/analyst-ratings/tencent-stock-price-target-raised-to-hk790-from-hk700-at-benchmark-93CH-4372620", "Scrape_Time_Sec": 21.942320585250854}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-01-30T10:08:27+00:00", "News_Date_Formatted": "2026-01-30 10:08:27 (GMT+0)", "News_Title": "Tencent’s Nvidia H200 Approval Reframes AI Growth And Investment Risks", "News_Source": "YAHOO", "News_Content": "Tencent’s Nvidia H200 Approval Reframes AI Growth And Investment Risks\nSimply Wall St\nFri, January 30, 2026 at 6:08 PM GMT+8 3 min read\nIn this article:\nStockStory Top Pick\nNVDA\n-0.72%\nTCEHY\n-1.94%\nTCTZF\n+2.09%\nMake better investment decisions with Simply Wall St's easy, visual tools that give you a competitive edge.\nTencent Holdings received regulatory approval to import Nvidia's H200 AI chips into China.\nThe approval gives Tencent access to next generation AI hardware as part of a broader national push to accelerate artificial intelligence development.\nThe move comes against a backdrop of technology restrictions and rising focus on AI among China's largest internet companies.\nTencent Holdings (SEHK:700) now has the green light to bring in Nvidia's H200 chips, which sit at the high end of current AI hardware. The stock trades at HK$606.0, with a 52.4% return over the past year and 61.3% over the past three years, while the five year return shows a 7.4% decline. That mixed profile presents investors with a company that has experienced periods of strong share price gains along with longer term volatility.\nAccess to advanced chips could influence how Tencent allocates capital across cloud, advertising, gaming and its broader AI initiatives. For investors watching China's tech sector, this development may be one additional data point when comparing Tencent with other large platforms that are also investing heavily in AI infrastructure.\nStay updated on the most important news stories for Tencent Holdings by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on Tencent Holdings.\nSEHK:700 1-Year Stock Price Chart\nIs Tencent Holdings financially strong enough to weather the next crisis?\nThe approval to import Nvidia's H200 chips gives Tencent access to high-performance AI hardware that can support model training across its cloud, advertising, gaming and fintech products, in line with broader government support for AI development. For you as an investor, this sits squarely in the regulatory and supply-constraint story around Chinese tech, because chip access has been a key bottleneck for companies like Tencent, Alibaba and ByteDance.\nTencent Holdings narrative, now with an AI hardware twist\nThis update ties directly into existing investor narratives that focus on Tencent's push in AI, cloud services and its large WeChat ecosystem. The ability to source H200 chips can support the AI-heavy use cases already being rolled out, such as Tencent's healthcare biometrics work in Hong Kong, and may help it compete more effectively with Alibaba, ByteDance and other internet peers that are also part of the approved chip allocation.\nRisks and rewards as regulators open the AI hardware door\nGreater access to high-end GPUs could support Tencent's AI tools in cloud, advertising and gaming, which investors already watch as key long-term drivers.\nBeing included in the initial batch of H200 approvals reinforces Tencent's position among China's leading AI players alongside Alibaba and ByteDance.\nRegulators are attaching conditions to these approvals, so any future change in policy or compliance requirements could affect Tencent's chip access or increase costs.\nHeavy AI-related capital spending on chips and data centers may pressure margins if revenue from AI products and services scales more slowly than expected.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3462, "Word_Count": 533, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/sWz1SFLzrz6pPtUbuvVx_w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NDtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/3748f7748ce18afae2f86ee319f59a4b"], "News_URL": "https://finance.yahoo.com/news/tencent-nvidia-h200-approval-reframes-100827296.html?.tsrc=rss", "Scrape_Time_Sec": 8.133917570114136}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-02-01T14:27:34.556774+00:00", "News_Date_Formatted": "2026-02-01 14:27:34 (GMT+0)", "News_Title": "Wendy Huang\nHead of Investor Relations\n0:00:00", "News_Source": "YAHOO", "News_Content": "Back to quote\nTENCENT (0700.HK) Q3 FY2025 earnings call transcript\nPowered by Quartr\nNov 13, 2025, 8:00 PM GMT+8\nEarnings call\nTencent's Q3 2025 revenue rose 15% YoY to CNY 192.9B, with non-IFRS net profit up 18% to CNY 70.6B. Growth was driven by robust gaming (domestic and international), AI-enhanced advertising, and fintech. Management reaffirmed AI leadership ambitions and expects steady momentum despite macro uncertainty.\nPowered by Yahoo Scout\nWendy Huang\nHead of Investor Relations\n0:00:00\nGood day and a good evening. Thank you for standing by. Welcome to Tencent Holdings Limited 2025 third quarter results announcement webinar. I'm Wendy Huang from Tencent IR team. At this time, all participants are in a listen-only mode. After management's presentation, there will be a question-and-answer session. For participants who dial in by phone, if you wish to ask a question, please press five on your telephone to raise your hand. If you are accessing from the Tencent Meeting or Booth Meeting application, please click the raise hand button at the bottom left. Please be advised that today's webinar is being recorded. Before we start the presentation, we would like to remind you that it includes forward-looking statements, which are underlined by a number of risks and uncertainties, and may not be realized in the future for various reasons. Information about general market conditions is coming from a variety of sources outside of Tencent. This presentation also contains some unaudited non-IFRS financial measures that should be considered in addition to, but not as a substitute for, measures of the group's financial performance prepared in accordance with IFRS. For a detailed discussion of risk factors and non-IFRS measures, please refer to our disclosure documents on the IR section of our website. Let me now introduce the management team on the webinar tonight. Our Chairman and CEO, Pony Ma, will kick off with a short overview. President Martin Lau and Chief Strategy Officer, James Mitchell, will provide business review, and Chief Financial Officer, John Lo, will conclude his financial discussion before we open the floor for questions. I will now pass it to Pony.\nPony Ma\nCEO\n0:01:43\nOkay, thank you, Wendy. Good evening. Thank you, everyone, for joining us. During the third quarter of 2025, we achieved solid revenue and earning growth, reflecting healthy trends across games, marketing services, and fintech and business services. Our strategic investments in AI are benefiting us in business areas such as ad targeting and game engagement, as well as efficiency enhancement areas such as coding and game and video production. We are upgrading the team and architecture of our Hunyuan foundation model, whose imagery and 3D generation models are now industry-leading. As Hunyuan's capabilities continue to improve, our investment in growing Yuanbao adoption and our efforts in developing agentic AI capabilities within Weixin will gain further traction. Looking at our financial numbers for the third quarter, total revenue was CNY 193 billion, up 15% year-on-year. Gross profit was CNY 109 billion, up 22% year-on-year. Non-IFRS operating profit was CNY 73 billion, up 18% year-on-year.\nPony Ma\nCEO\n0:03:15\nNon-IFRS net profit attributable to equity holders was CNY 71 billion, up 18% year-on-year. Turning to our key services, for communication and social networks, combined MAU of Weixin and WeChat grew year-on-year and quarter-on-quarter to 1.4 billion. For digital content, Tencent Music Entertainment Group is paying Space and Apple, solidifying its leadership position in music streaming. For games, Delta Force is now the top three game in China by gross receipts, while Valorant successfully expands from PC to mobile. In AI, we enhanced Hunyuan large language model's complex reasoning capabilities, especially in coding, mathematics, and science. Our Hunyuan imagery generation model is ranked first globally among text-to-imagery models by LLM Arena. Our Hunyuan 3D model is the top-ranked 3D generative model of Hugging Face. I will now hand over to Martin for the business review.\nMartin Lau\nPresident\n0:04:34\nThank you, Pony. Good evening and good morning to everybody. For the third quarter of 2025, our total revenue was up 15% year-on-year. VAS represented 50% of our total revenue, within which social networks subsegment was 17%, domestic games subsegment was 22%, and international games was 11%. Marketing services was 19% of total revenue, and fintech and business services was 30% of total revenue. For the quarter, our gross profit was up 22% year-on-year to CNY 109 billion. VAS gross profit increased 23% year-on-year to CNY 59 billion, representing 54% of our total gross profit. Marketing services gross profit increased 29% year-on-year to CNY 21 billion, contributing 19% of total gross profit. Fintech and business services gross profit increased 15% year-on-year to CNY 29 billion, contributing 27% of total gross profit. Turning ", "Content_Length": 51242, "Word_Count": 8358, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/quote/0700.HK/earnings/0700.HK-Q3-2025-earnings_call-374535.html", "Scrape_Time_Sec": 8.483205795288086}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-01-29T02:23:00+00:00", "News_Date_Formatted": "2026-01-29 02:23:00 (GMT+0)", "News_Title": "Bupa and Tencent Launch Hong Kong's First Palm-based Check-in Service for Enhanced Healthcare Experiences", "News_Source": "YAHOO", "News_Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\nBupa and Tencent Launch Hong Kong's First Palm-based Check-in Service for Enhanced Healthcare Experiences\nPR Newswire\nThu, January 29, 2026 at 10:23 AM GMT+8 6 min read\nIn this article:\nTCEHY\n-1.94%\nAI-powered palm verification set to deliver seamless, contactless and hygienic check-in journeys for patients at Bupa's healthcare centres\nHONG KONG, Jan. 29, 2026 /PRNewswire/ -- Tencent in collaboration with Bupa Hong Kong (\"Bupa\"), today officially launched Hong Kong's first palm verification check-in service for the healthcare sector. The innovative solution is set to offer customers a smarter, faster, and more seamless way to access care, while enhancing hygiene and convenience.\n(From right) Earvin Lam, Chief Technology Officer at Bupa Hong Kong; Yvonne Leung, Chief Customer, Data & Digital Officer at Bupa Hong Kong; and Steven Choi, General Manager of Tencent Cloud Hong Kong & Macau, pictured beside the Express Check in kiosk following the introduction of the service, which has been deployed across designated clinics under the Bupa Medical Network and works in conjunction with the Blua Health app to enhance seamless check in experiences for customers.\n  The Express Check in service has been introduced at 20 designated clinics under the Bupa Medical Network across Hong Kong. Among them, the flagship medical centre in Central as well as clinics in Tsim Sha Tsui and Admiralty are equipped with advanced palm scan technology powered by Tencent PalmAI, enabling customers to complete check in quickly by simply placing their palm over the high precision scanner at the kiosk.\nThe Express Check-in, a first-of-its-kind contactless check-in experience in Hong Kong's private healthcare sector officially launched today across 20 designated Bupa's network clinics citywide, offering customers a faster and more convenient way to access care. Among these locations, the flagship medical centre in Central, and Tsim Sha Tsui and Admiralty centres feature advanced palm-scan technology powered by Tencent PalmAI, while other clinics provide QR code-based Express Check-in—ensuring flexibility and a consistent, seamless experience for all customers.\nPowered by Tencent PalmAI, the service uses AI-driven biometric technology that captures both palm print and real-life palm vein patterns to deliver secure, reliable, and hygienic authentication. With dual biometric identification, customers can simply place their palm over a high-precision scanner at the check-in kiosk for instant, document-free verification—without the need to remove masks or have physical contact with staff. For added flexibility, customers can also choose to check in using a QR code, ensuring a smooth and convenient experience for everyone. This innovation not only improves speed and convenience but also strengthens privacy and hygiene, supporting a smarter, more personalised healthcare journey.\nSince its launch in 2022, Tencent PalmAI has been adopted by tens of millions of users globally, supporting diverse use cases from access control and identity verification to payments—enhancing user experience while improving operational efficiency. Bupa's recent adoption of PalmAI was implemented by Tencent Cloud, the cloud business of Tencent.\nSteven Choi, General Manager of Tencent Cloud Hong Kong & Macau, said, \"We are excited to support Bupa in delivering seamless and smarter healthcare experiences to its customers. By leveraging Tencent's advanced PalmAI technology—which integrates dual biometric identification using both palm print and palm vein patterns—we are enabling a secure, contactless, and truly frictionless check-in experience. Compared with traditional methods such as facial or fingerprint recognition, this solution enhances security and accuracy, reduces waiting times, and offers a more hygienic, mask-friendly experience for users.\"\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 4008, "Word_Count": 584, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/8tPejQFdoIliZgB0OB9bWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NTtjZj13ZWJw/https://media.zenfs.com/en/prnewswire.com/19e315e82081f46de91e637f906b2e6c", "https://s.yimg.com/ny/api/res/1.2/UyJvw3zmTt.42PR1db0hiA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MDtjZj13ZWJw/https://media.zenfs.com/en/prnewswire.com/dd28d4b8ecd3ccc00d36ae5e720f3619", "https://s.yimg.com/ny/api/res/1.2/vFg.y_tvYVhXu9w0BGiNtA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTM2O2g9MzY7Y2Y9d2VicA--/https://media.zenfs.com/en/prnewswire.com/2377f71a0775ca3eef4449831edb6bc3"], "News_URL": "https://finance.yahoo.com/news/bupa-tencent-launch-hong-kongs-022300548.html?.tsrc=rss", "Scrape_Time_Sec": 5.768338918685913}
{"Stock_Code": "0700.HK", "Category": "Tech", "News_Date": "2026-02-01T14:27:45.512925+00:00", "News_Date_Formatted": "2026-02-01 14:27:45 (GMT+0)", "News_Title": "Tencent stock supported by Nomura after earnings beat on non-operating gains", "News_Source": "INVESTING", "News_Content": "Get 50% Off\nSign In\nFree Sign Up\nMarkets\nMy Watchlist\nInvesting Challenges\nCharts\nNews\nAnalysis\nTechnical\nBrokers\nTools\nAcademy\nEconomic Calendar\nStock Screener\nMore\nLatest\nMost Popular\nBreaking News\nForex\nCommodities\nStock Markets\nEconomic Indicators\nEconomy\nCryptocurrency\nInsider Trading\nCompany News\nEarnings\nInvestment Ideas\nSWOT Analysis\n📈 Get a powerful boost to your portfolio: February's freshest AI-picked stocks\nGet the list\nTencent stock supported by Nomura after earnings beat on non-operating gains\nAnalyst Ratings\nPublished 14/11/2024, 07:46\n0\nTencent stock supported by Nomura after earnings beat on non-operating gains\nTCEHY\n-1.52%\nOn Thursday, Nomura/Instinet reiterated a Buy rating for Tencent Holdings (HK:0700) (700:HK) (OTC: OTC:TCEHY) stock, with a steady price target of HK$500.00. The firm highlighted Tencent's third-quarter performance, noting an 8% year-over-year increase in total revenue, aligning with the latest Bloomberg consensus.\nThe company's non-IFRS earnings rose by 33% year-over-year, surpassing both the Street's and Nomura's expectations by 10% and 8%, respectively. This surge was attributed to higher-than-expected non-operating income and lower tax fees.\nTencent's gross margin saw a notable improvement, increasing by 3.6 percentage points year-over-year to 53.1% in the third quarter, albeit slightly below the Street's projection of 53.4%. The company's value-added (VA) ads revenue experienced a 17% year-over-year growth, exceeding market predictions of 16%.\nThis increase was primarily driven by revenue from Video Account (VA), Mini Programs, Weixin Search, and contributions from Paris Olympics-related brand advertising.\nThe report further detailed that Tencent's VA ads revenue jumped over 60% year-over-year in the third quarter, which was more than Nomura's forecast of 57% year-over-year growth. VA ads are estimated to constitute 17% of Tencent's total marketing services revenue.\nWhile the VA ads segment shows potential for significant growth, Nomura suggests that the development of a fully-fledged e-commerce ecosystem is essential for Tencent to maximize its advertising potential.\nIn other recent news, Tencent Holdings Limited announced an 8% year-on-year increase in total revenue, reaching RMB 167.2 billion in the third quarter of 2024.\nThe company's net profit attributable to equity holders saw a significant 33% rise to RMB 59.8 billion, and diluted earnings per share (EPS) increased by 36% to RMB 6.34. These positive results were primarily driven by robust performances in the games segment, digital content, and marketing services.\nTencent's games segment revenue grew by 14% domestically, supported by popular titles like DnF Mobile and Delta Force. The company's digital content subscriptions also experienced growth, with Tencent Music reporting 119 million subscribers and long-form video reaching 116 million subscribers.\nIn addition to these developments, Tencent continues to invest in AI technology and is expanding its e-commerce strategy through Weixin Mini Shops. The company launched Hunyuan Turbo to enhance AI capabilities and efficiency.\nDespite facing challenges in the short video and live streaming e-commerce markets, Tencent remains optimistic about its international games revenue and the long-term prospects of the Mini Shops and e-commerce business.\nThese are among the recent developments at Tencent, demonstrating the company's commitment to revenue growth, profitability, and strategic investments in AI and e-commerce.\nInvestingPro Insights\nTencent's strong performance, as highlighted in the Nomura/Instinet report, is further supported by recent data from InvestingPro. The company's market capitalization stands at an impressive $484.26 billion, reflecting its significant position in the tech industry. Tencent's revenue growth of 7.91% over the last twelve months aligns closely with the 8% year-over-year increase mentioned in the article, demonstrating consistent performance.\nInvestingPro Tips reveal that Tencent is a \"Prominent player in the Interactive Media & Services industry,\" which is evident from its robust financial metrics and market presence. The company's ability to maintain dividend payments for 20 consecutive years underscores its financial stability and commitment to shareholder returns, despite the recent dividend growth decline.\nMoreover, the InvestingPro data shows a healthy EBITDA growth of 34.26% over the last twelve months, which supports the article's mention of Tencent's earnings surpassing expectations. This strong growth, coupled with the company's moderate debt level, suggests a solid financial foundation for future expansion, particularly in areas like Video Account advertising and e-commerce ecosystem development.\nFor investors seeking a more comprehensive analysis, InvestingPro offers 8 additional tips for Tencent, providing deeper insights into the company's financial health and market position.\nThis article was generated with the support o", "Content_Length": 9162, "Word_Count": 1356, "Image_URLs": ["https://i-invdn-com.investing.com/news/providers/investing-new.png", "https://i-invdn-com.investing.com/news/World_News_10_800x533_L_1420026292.jpg"], "News_URL": "https://uk.investing.com/news/analyst-ratings/tencent-stock-supported-by-nomura-after-earnings-beat-on-nonoperating-gains-3790776", "Scrape_Time_Sec": 22.633877992630005}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-01-30T11:13:27+00:00", "News_Date_Formatted": "2026-01-30 11:13:27 (GMT+0)", "News_Title": "Alibaba’s Robovan Spinoff Adds Automation Angle To Long Term BABA Story", "News_Source": "YAHOO", "News_Content": "Alibaba’s Robovan Spinoff Adds Automation Angle To Long Term BABA Story\nSimply Wall St\nFri, January 30, 2026 at 7:13 PM GMT+8 3 min read\nIn this article:\nBABA\n-2.70%\nBABAF\n+1.92%\nFind your next quality investment with Simply Wall St's easy and powerful screener, trusted by over 7 million individual investors worldwide.\nAlibaba's logistics arm is combining its autonomous driving unit with China's Zelos Technology to form a standalone robovan and last mile logistics business.\nThe newly merged entity is valued at about US$2b and will focus on automated delivery solutions in China.\nFor investors watching NYSE:BABA, this move sits at the intersection of e commerce and automation. Alibaba already runs a broad logistics network to support its online marketplaces, and automated last mile delivery is increasingly seen as a key piece of that infrastructure as e commerce volumes evolve. The partnership with Zelos Technology brings the robovan focus into a dedicated structure, rather than leaving it as a smaller unit inside a larger logistics arm.\nThis deal also aligns with a wider push across logistics to reduce labor intensity and speed up fulfillment, particularly in dense urban markets. As Alibaba incorporates more automation into its operations, it creates another area for investors to monitor within the group, alongside core commerce, cloud and other digital services.\nStay updated on the most important news stories for Alibaba Group Holding by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on Alibaba Group Holding.\nNYSE:BABA Earnings & Revenue Growth as at Jan 2026\nHow Alibaba Group Holding stacks up against its biggest competitors\nThe Cainiao and Zelos tie up creates a focused US$2b robovan and last mile logistics business, which sits at the intersection of Alibaba's core e commerce operations and its broader push into automation and AI-powered services. For you as an investor, this looks like Alibaba trying to turn what was an in house capability into a more dedicated platform that could support its own parcel volumes in China and potentially serve third party clients, in a way that echoes how Amazon and JD.com have treated their logistics arms.\nHow This Fits The Alibaba Group Holding Narrative\nThe move lines up with the existing narrative that Alibaba is leaning into AI, cloud and quick commerce to build new earnings drivers over time. Autonomous vans are another way to apply Alibaba's AI models and cloud infrastructure to real world logistics problems, while tightening the link between its delivery network and higher frequency, quick commerce style orders that the narrative already flags as a focus area.\nKey Risks And Rewards To Keep In Mind\n🎁 Potential for more efficient last mile delivery, which could support margins in e commerce and quick commerce if operating costs per parcel improve over time.\n🎁 Alignment with Alibaba's broader AI push, as autonomous driving and routing depend on the same kind of model training and compute that Alibaba is already funding heavily.\n⚠️ Execution risk if the combined robovan business struggles with regulation, safety incidents or slower than expected merchant adoption, especially with rivals like JD.com and Meituan also investing in automation.\n⚠️ Capital and R&D needs for autonomous fleets may add to the investment burden that analysts already highlight around AI, cloud and quick commerce spending.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3514, "Word_Count": 556, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/sq9gro9ZVAwnxwYgYx7mxA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYxMztjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/128e6bfdc69d06cf2c35c755f57ebdc7"], "News_URL": "https://finance.yahoo.com/news/alibaba-robovan-spinoff-adds-automation-111327882.html?.tsrc=rss", "Scrape_Time_Sec": 10.034489870071411}
{"Stock_Code": "9988.HK", "Category": "Tech", "News_Date": "2026-01-30T14:30:03+00:00", "News_Date_Formatted": "2026-01-30 14:30:03 (GMT+0)", "News_Title": "Is It Worth Investing in Alibaba (BABA) Based on Wall Street's Bullish Views?", "News_Source": "YAHOO", "News_Content": "Is It Worth Investing in Alibaba (BABA) Based on Wall Street's Bullish Views?\nZacks Equity Research\nFri, January 30, 2026 at 10:30 PM GMT+8 4 min read\nIn this article:\nBABA\n-2.70%\nBABAF\n+1.92%\nWhen deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nLet's take a look at what these Wall Street heavyweights have to say about Alibaba (BABA) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\nAlibaba currently has an average brokerage recommendation (ABR) of 1.28, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 25 brokerage firms. An ABR of 1.28 approximates between Strong Buy and Buy.\nOf the 25 recommendations that derive the current ABR, 22 are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 88% and 4% of all recommendations.\nBrokerage Recommendation Trends for BABA\nBroker Rating Breakdown Chart for BABA\nCheck price target & stock forecast for Alibaba here>>>\nWhile the ABR calls for buying Alibaba, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near-term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\nZacks Rank Should Not Be Confused With ABR\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3035, "Word_Count": 501, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/ggHB1vGaLp0MunILB6Bv6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQ4MTtjZj13ZWJw/https://media.zenfs.com/en/zacks.com/2fb067eb3f8afdb2e0c611161e83b1f5"], "News_URL": "https://finance.yahoo.com/news/worth-investing-alibaba-baba-based-143003008.html?.tsrc=rss", "Scrape_Time_Sec": 5.893589735031128}
{"Stock_Code": "0005.HK", "Category": "Bank", "News_Date": "2026-02-01T14:28:58.750183+00:00", "News_Date_Formatted": "2026-02-01 14:28:58 (GMT+0)", "News_Title": "Operator\n0:00:00", "News_Source": "YAHOO", "News_Content": "Back to quote\nHSBC HOLDINGS (0005.HK) Q3 FY2025 earnings call transcript\nPowered by Quartr\nOct 28, 2025, 3:45 PM GMT+8\nEarnings call\nHSBC reported Q3 revenue of $17.9B, up 3% YoY, and raised 2025 guidance for ROTE to mid-teens or better and banking NII to $43B+. Wealth and transaction banking showed robust growth, while cost control and capital strength remained intact. Management emphasized strategic execution, including exits and the Hang Seng Bank privatization.\nPowered by Yahoo Scout\nOperator\n0:00:00\nWelcome, ladies and gentlemen, to the analysts and investor webinar on the three-year results for HSBC Holdings Plc. For your information, this call is being recorded. I will now hand over to Pam Kaur, Group CFO.\nPam Kaur\nCFO\n0:00:16\nWelcome, everyone. Thank you for joining. We are making positive progress towards creating a simple, more agile growing HSBC. The intent and discipline with which we are executing our strategy is reflected in the momentum this quarter and our target upgrades, most notably our annualized ROTE of 17.6% year-to-date, excluding notable items. Throughout this presentation, I'll focus on year-over-year comparisons. This will exclude notable items and be on a constant currency basis. The equivalent comparisons on a reported basis can be found on slides 16 and 22. Let's turn straight to the highlights. We reported a strong quarter. Total revenues grew $500 million-$17.9 billion. Wealth had another good quarter with 29% growth in fee and other income. Our customer deposit balances stand at $1.7 trillion. If we include held-for-sale balances, these grew by $86 billion. We are also investing for growth.\nPam Kaur\nCFO\n0:02:02\nOn 9th October, we announced our intention to privatize Hang Seng Bank. We see this as a compelling opportunity. Let me set out clearly our reasoning. First, it meets all four of our criteria for acquisitions. Second, we see good growth in Hong Kong in the years ahead. It's a business in a whole market we know very well. Third, we see an opportunity to create greater alignment for better operational leverage and efficiencies. Fourth, we are acquiring a business with structurally high pre-impairment margins, and while we are not calling the credit cycle, we believe it is a cycle. Fifth, we are removing a $3 billion capital inefficiency. This is a transaction which we initiated as a growth investment. It is also a statement of our confidence in the outlook for Hong Kong.\nPam Kaur\nCFO\n0:03:21\nWe are in an offer period, so we are unable to give more details on synergies at this stage. What I will say is that consolidating the non-controlling interest from the profit and loss increases our profit attributable to ordinary shareholders. We have also said that we see the potential for additional revenue through expanded capital market products to Hang Seng commercial clients and wealth products to its affluent clients. And we can simplify and streamline decision-making processes, improve operational risk management, and better align operations, which we expect will result in efficiencies. We are confident the integration will not distract us from organic growth, and it's more value-generative than a share buyback. Turning now to upgrades. We are delivering against the targets we set out to you.\nPam Kaur\nCFO\n0:04:33\nWe are now upgrading two items: our 2025 banking NII to $43 billion or better, our 2025 ROTE excluding notable items to be mid-teens or better. We remain disciplined with our shareholders' capital, investing it where we see growth, exiting businesses with the intention to redeploy the costs where we don't. We are progressing at pace with the exit of non-strategic activities. This quarter, we have announced the exits of HSBC Malta and retail banking in Sri Lanka. This brings our total announced exits to 11 so far this year. Last week, we announced that we are conducting a strategic review of our Egyptian retail banking business. The review will not include our wholesale banking activities in Egypt, which remains an important market and one we believe has strong potential for growth.\nPam Kaur\nCFO\n0:05:47\nFinally, we are on track to achieve our target of around 3% cost growth in 2025 compared to 2024 on a target basis. Let's now turn to the firm-wide financial results. First, the income statement. Annualized ROTE was 16.4% in the third quarter, or 17.6% year-to-date, both excluding notable items. Revenue grew 3% year-on-year to $17.9 billion in the quarter. This was driven by a return to growth in banking NII and strong fee and other income. Profit before tax was $9.1 billion. Looking at our capital and distributions, our CET1 capital ratio is 14.5%, and we continue to target a dividend payout ratio for 2025 of 50% of earnings per ordinary share, excluding material notable items and related impacts. Let's now turn to our business segment performance. We grew total revenue by 3%, and each of our four businesses returned greater than mid-teens' annualized ROTE.\nPam Kaur\n", "Content_Length": 45413, "Word_Count": 7813, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png"], "News_URL": "https://finance.yahoo.com/quote/0005.HK/earnings/0005.HK-Q3-2025-earnings_call-341201.html", "Scrape_Time_Sec": 5.483694076538086}
{"Stock_Code": "0005.HK", "Category": "Bank", "News_Date": "2026-01-29T13:02:58-06:00", "News_Date_Formatted": "2026-01-29 13:02:58 (GMT-6)", "News_Title": "HSBC Says Investors Should Stay ‘Aggressively’ Risk-On. Here’s a Top-Rated Stock to Buy Now to Keep Betting on Growth.", "News_Source": "BARCHART", "News_Content": "Amazon - Image by bluestork via Shutterstock\nDespite the constant chorus around diversification, mega-cap stocks continue to anchor market psychology. HSBC Holdings plc (HSBC) has leaned into that reality, urging investors to stay aggressively pro-risk as scale and earnings visibility continue to win. Recently, the global banking powerhouse said it is almost at maximum overweight in equities, while also overweight in high-yield credit, emerging-market debt, and gold. \nThe bank downplayed geopolitics as a secondary concern, arguing that U.S. rates, rate volatility, and near-term growth expectations remain the true market drivers. It also cautioned that fourth-quarter S&P 500 Index ($SPX) earnings expectations are “still way too low,” recommending a rotation away from rate-sensitive, high-beta sectors and back into mega caps. This rotation places Amazon (AMZN) firmly at center stage. \nAs one of the market’s most influential hyperscalers, Amazon sits at the intersection of consumer demand, cloud infrastructure, and artificial intelligence (AI). The company has even raised its 2026 capital expenditure forecast to $125 billion from $118 billion, the highest among mega caps, reflecting surging AI and cloud demand.\nAnalysts now project Amazon's growth of more than 17% in 2026 to over $146 billion. For investors aligned with HSBC’s strategy, Amazon increasingly reads as a long-term compounder rather than a short-term trade.\nAbout Amazon Stock\nThe Seattle, Washington-based Amazon has evolved far beyond an online retailer. With a market cap of nearly $2.6 trillion, it sells nearly everything, delivers at unmatched speed, streams content, and builds devices. Behind the scenes, Amazon Web Services (AWS) powers vast portions of the internet through cloud and AI services.\nOver the past six months, the stock has gained 3.6%. In the last three months, it is up 3.9%. Over just the past five trading sessions, shares have climbed another 2.14%, reflecting renewed confidence ahead of major earnings catalysts.\nwww.barchart.com\nComing to valuation, AMZN stock is currently trading at 31.02 times forward adjusted earnings and 3.63 times sales. Both metrics sit well above industry averages, signaling a premium multiple that investors appear willing to pay for scale, growth visibility, and expanding AI-driven profit pools.\nAmazon Surpasses Q3 Earnings\nAmazon’s shares surged more than 9.6% on Thursday, Oct. 30, 2025, a day after the company unveiled its Q3 2025 results that beat expectations. Revenue grew 13.4% year-over-year (YOY) to $180.17 billion, exceeding analyst estimates of $177.8 billion. EPS rose 36.4% from the year-ago period to $1.95, topping analyst forecasts of $1.57.\nThe real engine of upside remained AWS. Cloud revenue accelerated 20.2% during the quarter, outpacing expectations of 18.1%. Operating income marginally rose YOY to $17.4 million, while net income advanced 38.2% to $21.2 billion.\nCEO Andy Jassy underscored the shift, stating that AWS is “growing at a pace we haven’t seen since 2022,” driven by surging AI demand. The demand continues to reshape Amazon’s capital priorities and strengthens its long-term competitive positioning in cloud and enterprise services.\nThe strategic pivot is already translating into concrete action across Amazon’s AI stack. The company has launched Q, an enterprise-focused chatbot, and Bedrock, a generative AI platform for cloud customers, while commissioning its $11 billion Project Rainier data center built exclusively to run models from Anthropic’s Claude.\nLooking forward, Amazon’s management has guided fourth-quarter 2025 revenue between $206 billion and $213 billion, with operating income expected to range from $21 billion to $26 billion. \nThe e-commerce giant is scheduled to release its Q4 2025 results on Thursday, Feb. 5, after market close. Analysts expect quarterly EPS growth of 6.5% YOY to $1.98. For full-year 2025, EPS is projected to jump 29.8% to $7.18, followed by another 10% increase in fiscal 2026 to $7.90.\nWhat Do Analysts Expect for Amazon Stock?\nWall Street’s conviction around Amazon has left little room for ambiguity. Analysts continue to coalesce around a bullish outlook, assigning the stock an overall rating of “Strong Buy.” Among 57 analysts covering the stock, 50 rate it “Strong Buy,” five suggest “Moderate Buy,” and only two call for “Hold.” \nThe average price target of $297.22 represents potential upside of 24.3%. Meanwhile, the Street-high target of $360 points to a gain of 50.5% from current levels, highlighting expectations that sustained earnings momentum and aggressive investment could continue to re-rate the stock higher.\nwww.barchart.com\nwww.barchart.com\n\nOn the date of publication, Aanchal Sugandh did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\nMor", "Content_Length": 5020, "Word_Count": 753, "Image_URLs": [], "News_URL": "https://www.barchart.com/story/news/37305045/hsbc-says-investors-should-stay-aggressively-risk-on-heres-a-top-rated-stock-to-buy-now-to-keep-betting-on-growth?.tsrc=rss", "Scrape_Time_Sec": 6.214298725128174}
{"Stock_Code": "0981.HK", "Category": "Chips", "News_Date": "2026-01-30T16:00:00+00:00", "News_Date_Formatted": "2026-01-30 16:00:00 (GMT+0)", "News_Title": "The 5 Best Stocks to Buy for 2026", "News_Source": "FOOL", "News_Content": "With the first month of 2026 nearly over, there are some themes starting to take shape. First, investors are still skeptical that artificial intelligence (AI) spending is real. However, if you paid attention to Taiwan Semiconductor Manufacturing's\n(\nTSM\n2.65%\n)\nfourth-quarter results, then you know that it's real and only going to get bigger.\nHowever, the market hasn't caught on to that yet. That leads to a few stocks looking like incredible buys, but there are also some other non-AI stocks that look like strong buys for 2026 that are suffering a bit from a 2025 hangover.\nI think these are among the best stocks to buy now, and investors should consider doing so as soon as possible, before the market catches on.\nImage source: Getty Images.\n1. Nvidia\nIt should be no surprise that Nvidia\n(\nNVDA\n0.72%\n)\nis included in this list. It's still the top AI computing provider, and its graphics processing units (GPUs) continue to push the limit of what's possible with traditional computing. Demand for its GPUs continues to grow, and will likely increase through 2030, when Nvidia believes there will be $3 trillion to $4 trillion in global annual data center spending.\nCollapse\nNASDAQ: NVDA\nNvidia\nToday's Change\n(-0.72%) $-1.39\nCurrent Price\n$191.12\nNVDA\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$4.6T\nDay's Range\n$189.47 - $194.49\n52wk Range\n$86.62 - $212.19\nVolume\n5.6M\nAvg Vol\n182M\nGross Margin\n70.05%\nDividend Yield\n0.02%\nThat's a huge projection, and if it actually turns out to be correct, the stock will be a must-own. I think the tailwinds in the AI realm are still howling, making Nvidia a no-brainer to buy this year.\n2. Taiwan Semiconductor\nAs mentioned above, Taiwan Semiconductor already reported fourth-quarter results and crushed it. Revenue was up 26% year over year in U.S. dollars, and management gave guidance for nearly 30% revenue growth in 2026. Underscoring this announcement was its decision to spend $52 billion to $56 billion on production capabilities throughout the year.\nCollapse\nNYSE: TSM\nTaiwan Semiconductor Manufacturing\nToday's Change\n(-2.65%) $-8.99\nCurrent Price\n$330.56\nTSM\n^SPX\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$1.7T\nDay's Range\n$329.10 - $339.90\n52wk Range\n$134.25 - $351.33\nVolume\n12M\nAvg Vol\n13M\nGross Margin\n59.02%\nDividend Yield\n0.93%\nThis shows there is huge and lasting chip demand in the AI space, giving further credence to the idea that AI spending is just getting started.\n3. Nebius\nNebius Group\n(\nNBIS\n10.24%\n)\nis less known than the previous two because it's a smaller business that's deploying Nvidia GPUs filled with TSMC chips to be rented out to clients looking for AI training power. This is a similar business model to the already proven cloud computing one that several big tech companies use. By focusing on AI, they are targeting a niche that needs as much computing power as possible as soon as possible.\nDemand for Nebius' platform to expand is incredible, and management believes it will grow from a $551 million annual run rate at the end of the third quarter to a $7 billion to $9 billion run rate at the end of the year. That's a huge increase that I want to be a part of, since the stock a great buy now.\n4. The Trade Desk\nMoving to stocks not focused on AI, The Trade Desk\n(\nTTD\n2.90%\n)\nis one I think will have a strong comeback in 2026. The Trade Desk had an abysmal 2025, falling nearly 70%. However, I think that decline is overblown, because Wall Street analysts still expect 18% revenue growth for this year and 16% next year.\nThe demand for ad technology software is still growing, and The Trade Desk is in position to capture it. But because of recent pessimism, you can now buy the stock at a mere 17.5 times forward earnings.\nTTD PE Ratio (Forward) data by YCharts; PE = price to earnings.\nThat's an absolute steal of a price, and investors should be flocking to the stock.\n5. MercadoLibre\nMercadoLibre\n(\nMELI\n3.13%\n)\nis a diversification play, since its business is based in Latin America, giving investors exposure to a different part of the world. While I'm not a fan of diversifying just for diversification's sake, MercadoLibre is a business well worth owning. It has built itself into an e-commerce giant, complete with a fintech platform in Latin America. As a result, MercadoLibre has its hand in many transactions that occur in that part of the world.\nCollapse\nNASDAQ: MELI\nMercadoLibre\nToday's Change\n(-3.13%) $-69.39\nCurrent Price\n$2148.74\nMELI\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$109B\nDay's Range\n$2136.13 - $2224.58\n52wk Range\n$1723.90 - $2645.22\nVolume\n23K\nAvg Vol\n541K\nGross Margin\n45.14%\nThe stock is down around 20%, which happens now and again because the market sometimes forgets it's not associated with the U.S. This makes it a perfect buying opportunity because the company has a fantastic record of increasing the business. There is still a large part of the Latin American population that hasn't come onto the platfo", "Content_Length": 5058, "Word_Count": 880, "Image_URLs": ["https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F850851%2Fstock-investor-looking-at-a-graph-on-a-computer-screen-celebrating.jpg&w=3840&op=resize", "https://media.ycharts.com/charts/338651f44e8abe651fa9f2fcc2cfde1d.png", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853265%2Fhand-holding-ai-lightbulb.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F854058%2Fbubble-popping.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F837807%2Ftwo-engineers-working-on-a-data-center.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853123%2Fgettyimages-1357572936.jpg&w=3840&op=resize", "https://a.pub.network/core/imgs/1.png?x=2026-02-01T14%3A29%3A15.671", "https://a.pub.network/core/imgs/1.png?x=2026-02-01T14%3A29%3A16.558"], "News_URL": "https://www.fool.com/investing/2026/01/30/the-5-best-stocks-to-buy-for-2026/?.tsrc=rss", "Scrape_Time_Sec": 7.3005690574646}
{"Stock_Code": "0981.HK", "Category": "Chips", "News_Date": "2026-01-26T14:40:49+00:00", "News_Date_Formatted": "2026-01-26 14:40:49 (GMT+0)", "News_Title": "Nvidia’s Unspoken Problem: 40% of Revenue Comes From Companies Developing Their Own AI Chips", "News_Source": "247WALLST", "News_Content": "Jensen Huang has built a $4.6 trillion empire selling the picks and shovels of the AI revolution. But while he preaches accelerated computing, three existential threats aren’t discussed in earnings calls. They’re happening now.\nThreat #1: Your Best Customers Are Building Your Replacement\nMicrosoft (NASDAQ:MSFT), Meta (NASDAQ:META), Amazon (NASDAQ:AMZN), and Alphabet (NASDAQ:GOOGL) represent 40-50% of Nvidia (NASDAQ:NVDA) revenue. Every single one is developing custom AI chips.\nGoogle’s TPUs power Bard and Search. Amazon’s Trainium chips offer AWS customers cheaper alternatives. Meta’s MTIA handles inference workloads. Microsoft’s Maia chip is deploying across Azure. These are production infrastructure.\nNvidia’s response? Custom chips “complement” rather than replace GPUs. But here’s the math that should terrify investors: inference represents 80% of long-term AI compute. Training is 20%. If hyperscalers build inference chips in-house, Nvidia loses access to 80% of the addressable market. The company captured 85% gross margins selling infrastructure to customers now building their own data centers.\nThreat #2: AMD Is the Alternative Nobody Wants to Acknowledge\nLoading stock data...\nAdvanced Micro Devices (NASDAQ:AMD) stock surged 111% over the past year while Nvidia gained 28%. The market is noticing what enterprises already know: MI300X chips deliver competitive performance at 20-30% lower cost.\nMicrosoft Azure now offers MI300X instances. Oracle Cloud partnered with AMD for infrastructure. Meta deployed MI300X for inference. OpenAI reportedly tested AMD chips to diversify away from Nvidia dependency.\nThe CUDA moat argument assumes 2020 dynamics still apply. PyTorch support improved dramatically. AMD’s ROCm software stack closed gaps. OpenAI’s Triton compiler abstracts hardware differences. For inference workloads, where performance-per-dollar matters more than raw speed, AMD wins business.\nNvidia doesn’t need to lose outright. AMD capturing 20-30% market share means Nvidia’s growth decelerates sharply. Can the company sustain 73% gross margins with real competition? The MI400 series launching in 2026 closes the performance gap further.\nThreat #3: China’s Approval Is Bait for Later Retaliation\nChina approving H200 chips sounds bullish. It’s actually a trap. China’s playbook: approve foreign technology, extract partnerships and knowledge transfer, develop domestic alternatives, then ban the foreigner citing national security.\nThey did this with rare earth metals. With Qualcomm. They’re attempting it with Apple’s iPhone. Huawei’s Ascend 910B chips emerged despite sanctions. SMIC produces 7nm chips despite equipment bans. China’s “indigenous innovation” strategy always ends the same way.\nIf Nvidia rebuilds 20-30% revenue dependency on China, the 2028 ban becomes an extinction-level event. Investors celebrating today’s approval are ignoring tomorrow’s geopolitical weapon.\nWhat Jensen Won’t Discuss\nIn quarterly calls, Huang focuses on insatiable AI demand and partnership announcements. He never addresses customer chip development progress, AMD market share trajectory, or the inference versus training margin split. These omissions aren’t accidental.\nThe bull case assumes AI growth lifts all boats. The bear case recognizes customers are building their own boats, AMD is offering cheaper passage, and China is planning to sink the ship entirely. These aren’t distant risks. They’re current realities the market refuses to price in.\nGet Ready To Retire (Sponsored)\nStart by taking a quick retirement quiz from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes, or less.\nEach advisor has been vetted by SmartAsset and is held to a fiduciary standard to act in your best interests.\nHere’s how it works:\n1. Answer SmartAsset advisor match quiz\n2. Review your pre-screened matches at your leisure. Check out the advisors’ profiles.\n3. Speak with advisors at no cost to you. Have an introductory call on the phone or introduction in person and choose whom to work with in the future.", "Content_Length": 4086, "Word_Count": 595, "Image_URLs": [], "News_URL": "https://247wallst.com/investing/2026/01/26/nvidias-unspoken-problem-40-of-revenue-comes-from-companies-developing-their-own-ai-chips/?.tsrc=rss", "Scrape_Time_Sec": 7.001678943634033}
{"Stock_Code": "0981.HK", "Category": "Chips", "News_Date": "2026-01-20T10:40:00+00:00", "News_Date_Formatted": "2026-01-20 10:40:00 (GMT+0)", "News_Title": "Who Are the Biggest Winners from Taiwan Semiconductor Manufacturing's Blowout Quarterly Report?", "News_Source": "FOOL", "News_Content": "Taiwan Semiconductor Manufacturing\n(\nTSM\n2.65%\n)\nrecently reported a blowout quarter, sending its stock higher. However, it's not the only stock set to be a winner from its strong report and outlook.\nWhen the company projected it would spend between $52 billion and $56 billion in capital expenditures (capex) in 2026, up from $41 billion in 2025, it sent a clear message that the demand for artificial intelligence (AI) chips has staying power. Let's look at other stocks set to benefit from the same dynamics it's seeing.\nImage source: Getty Images.\nAI chipmakers\nTSMC ramping up capex to build out new fabs is good news for its customers, who it said continue to seek out increased capacity. Nvidia\n(\nNVDA\n0.72%\n)\nis a clear winner, given that its graphics processing units (GPUs) are the primary chips used to train large language models (LLMs). Given the wide moat it has with CUDA for AI model training, it will continue to be a significant beneficiary of AI infrastructure spending.\nBroadcom\n(\nAVGO\n+0.17%\n)\nis also set to benefit, as it continues to help its customers design custom AI chips. Citigroup analysts see Broadcom having the potential to increase its AI revenue fivefold over the next two years. Advanced Micro Devices\n(\nAMD\n6.09%\n)\n, meanwhile, has a strong position in the data center central processing unit (CPU) market, and its GPUs should benefit from an expanding market for AI inference, where Nvidia has a narrower moat.\nCollapse\nNYSE: TSM\nTaiwan Semiconductor Manufacturing\nToday's Change\n(-2.65%) $-8.99\nCurrent Price\n$330.56\nTSM\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$1.7T\nDay's Range\n$329.10 - $339.90\n52wk Range\n$134.25 - $351.33\nVolume\n12M\nAvg Vol\n13M\nGross Margin\n59.02%\nDividend Yield\n0.93%\nASML\nMore capex spending from TSMC means it will need more machines that can manufacture advanced semiconductors. ASML\n(\nASML\n2.21%\n)\nis the big winner here, as it is the only company that makes the extreme ultraviolet lithography (EUV) machines needed to manufacture these chips.\nMeanwhile, as TSMC looks to push the limits on advanced chip architecture, it sets AMSL up to eventually begin selling the foundry its newer High-NA EUV platform, which costs nearly double its EUV machines.\nMemory makers\nFor AI chips to perform to their fullest potential, they need high-bandwidth memory (HBM), which is a specialized form of DRAM (dynamic random access memory). The memory market for DRAM is currently very tight, leading to rising prices, and TSMC aggressively spending to increase AI chip capacity is likely only to keep it in short supply. That bodes well for DRAM companies like Micron Technology\n(\nMU\n4.80%\n)\n, SK Hynix, and Samsung\n(\nSSNL.F\n+55.02%\n)\n, which are all already benefiting from huge demand and increasing prices.\nCollapse\nNASDAQ: ASML\nASML\nToday's Change\n(-2.21%) $-32.16\nCurrent Price\n$1423.00\nASML\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$552B\nDay's Range\n$1416.01 - $1466.43\n52wk Range\n$578.51 - $1493.47\nVolume\n2.4M\nAvg Vol\n1.6M\nGross Margin\n52.80%\nDividend Yield\n0.52%\nCloud computing and neocloud companies\nTwo other segments set to benefit from TSMC's strong outlook are cloud computing and neocloud companies. The big three cloud computing companies -- Amazon\n(\nAMZN\n1.00%\n)\n, Microsoft\n(\nMSFT\n0.83%\n)\n, and Alphabet\n(\nGOOG\n0.04%\n)\n(\nGOOGL\n0.04%\n)\n-- along with Oracle\n(\nORCL\n2.54%\n)\n, are all spending aggressively to build out their data center capacity to meet increasing demand for AI services.\nOn its earnings call, TSMC CEO C.C. Wei said he spoke to all the big cloud service providers, and they gave him evidence that AI is helping their businesses, and that their infrastructure spending is driving strong returns. Without that assurance and evidence, he would not have increased TSMC's capex to the level he did. That is great news for these companies, as right now, cloud computing is the bigger driver of their businesses.\nCollapse\nNASDAQ: GOOGL\nAlphabet\nToday's Change\n(-0.07%) $-0.25\nCurrent Price\n$338.00\nGOOGL\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$4.1T\nDay's Range\n$332.29 - $340.00\n52wk Range\n$140.53 - $342.29\nVolume\n31M\nAvg Vol\n35M\nGross Margin\n59.18%\nDividend Yield\n0.25%\nMeanwhile, this also bodes well for the smaller neocloud providers like CoreWeave\n(\nCRWV\n6.37%\n)\nand Nebius Group\n(\nNBIS\n10.24%\n)\n. These companies specialize in renting out the computer power needed to handle AI workloads, and demand for their services has been through the roof. However, they don't have the balance sheets and free cash flow of the big three cloud computing providers, and are more leveraged plays.\nTSMC's commitment to more capex is a big vote of confidence that the economics of the AI cloud computing model work.", "Content_Length": 4749, "Word_Count": 812, "Image_URLs": ["https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F851618%2Fmicrochip-technology-computer-chip-data-processing.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853367%2Fgettyimages-ai-chip-on-a-circuit-board.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853692%2F371-tsmc.png&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F851756%2Fperson-buying-a-stock-while-using-a-computer-and-a-tablet.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853107%2Fbuffett9-tmf.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F852753%2Fa-person-holding-up-an-artificial-intelligence-chip.jpg&w=3840&op=resize"], "News_URL": "https://www.fool.com/investing/2026/01/20/biggest-winners-tsmc-blowout-earnings-report/?.tsrc=rss", "Scrape_Time_Sec": 4.946706771850586}
{"Stock_Code": "0981.HK", "Category": "Chips", "News_Date": "2026-01-22T10:30:00+00:00", "News_Date_Formatted": "2026-01-22 10:30:00 (GMT+0)", "News_Title": "Taiwan Semiconductor Just Delivered Great News for Nvidia Shareholders", "News_Source": "FOOL", "News_Content": "The stock market is full of independent companies, but they are all intertwined. One may be a supplier, while another markets products. Another may be a designer, while another uses its products. As a result, investors can look for clues about one stock in other companies' earnings reports.\nRecently, I saw one such huge connection in Taiwan Semiconductor Manufacturing's\n(\nTSM\n2.65%\n)\nfourth-quarter earnings report. TSMC, as it's also known, is the world's primary foundry for producing logic chips and supplies them to nearly every company in cutting-edge tech. One of its biggest clients is Nvidia\n(\nNVDA\n0.72%\n)\n, and the news that TSMC just delivered is huge for that client.\nTSMC's dominance makes it easy to trace beneficiaries\nThe world of logic-chip foundries is fairly small. There is TSMC and some lesser competitors that don't have the same level of dominance, such as Samsung. TSMC is really the only name in town after Intel's fall from grace. So, when the leading chip producer says that something good (or bad) is happening with demand, it's pretty easy to trace its downstream effects.\nDuring the company's fourth-quarter conference call, Chief Executive Officer C.C. Wei said that his company has increased its projection for artificial intelligence (AI) chips to a mid- to high-50% compound annual growth rate (CAGR) for the period between 2024 and 2029. That's monstrous growth, and bodes well for some other predictions that Nvidia has already given shareholders.\nCollapse\nNYSE: TSM\nTaiwan Semiconductor Manufacturing\nToday's Change\n(-2.65%) $-8.99\nCurrent Price\n$330.56\nTSM\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$1.7T\nDay's Range\n$329.10 - $339.90\n52wk Range\n$134.25 - $351.33\nVolume\n12M\nAvg Vol\n13M\nGross Margin\n59.02%\nDividend Yield\n0.93%\nNvidia told investors that it expects global data-center capital expenditures to reach $3 trillion to $4 trillion by 2030, up from $600 billion in 2025. That equates to a 42% CAGR over that time frame, which is slightly less than what TSMC expects.\nThese two projections aren't exactly the same, but they are close enough that I think investors can take TSMC's projection as a confirmation of Nvidia's. This could be huge for the latter company since it would make an enormous amount of revenue in 2030 if it comes true.\nNvidia could come close to $1 trillion in revenue if the projection pans out\nWall Street analysts expect $213 billion in revenue for Nvidia's fiscal 2026 (ending January 2026). Should the company's revenue check in at a 42% CAGR during the next four years through 2030, that would give it revenue of $866 billion. It would be quite the feat for the largest company in the world by market cap to quadruple revenue in four years, and would make it a no-brainer buy now if its projection pans out.\nThat would require Nvidia to maintain its market share, which won't be easy to do. However, I think it's certainly in a strong position to continue growing rapidly during the next four years, and investors who don't have exposure to Nvidia should think about changing that.\nCollapse\nNASDAQ: NVDA\nNvidia\nToday's Change\n(-0.72%) $-1.39\nCurrent Price\n$191.12\nNVDA\nYTD\n1W\n1M\n3M\n6M\n1Y\n5Y\nPRICE\nVS S&P\nKEY DATA POINTS\nMarket Cap\n$4.6T\nDay's Range\n$189.47 - $194.49\n52wk Range\n$86.62 - $212.19\nVolume\n5.6M\nAvg Vol\n182M\nGross Margin\n70.05%\nDividend Yield\n0.02%\nOne apprehension many investors have is the fear of an AI bubble. If one forms, it would likely affect Nvidia's stock. Taiwan Semiconductor's CEO has the same concern. He mentioned that he is \"very nervous\" about AI demand.\nHowever, he said his company did a lot of research and checked in with its biggest clients before making the decision to invest more than $50 billion in chip production capabilities. If it's wrong, Wei cautioned, TSMC is in trouble. However, he is very confident that the research is right, especially because he spent a significant amount of time in the past quarter ensuring demand is real.\nI think this should ease some fears about an AI bubble, because companies are doing their due diligence to ensure that AI demand is something that's here to stay. If it is, stocks like Taiwan Semiconductor Manufacturing and Nvidia have plenty of room to soar. I think each is an excellent investment option in 2026, and if you don't own them already, now is the perfect time to load up.", "Content_Length": 4361, "Word_Count": 743, "Image_URLs": ["https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853367%2Fgettyimages-ai-chip-on-a-circuit-board.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853692%2F371-tsmc.png&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F851756%2Fperson-buying-a-stock-while-using-a-computer-and-a-tablet.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853107%2Fbuffett9-tmf.jpg&w=3840&op=resize", "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F852753%2Fa-person-holding-up-an-artificial-intelligence-chip.jpg&w=3840&op=resize", "https://a.pub.network/core/imgs/1.png?x=2026-02-01T14%3A29%3A24.313", "https://a.pub.network/core/imgs/1.png?x=2026-02-01T14%3A29%3A24.797"], "News_URL": "https://www.fool.com/investing/2026/01/22/taiwan-semiconductor-just-delivered-increible-news/?.tsrc=rss", "Scrape_Time_Sec": 7.316073656082153}
{"Stock_Code": "0981.HK", "Category": "Chips", "News_Date": "2026-01-26T05:06:37+00:00", "News_Date_Formatted": "2026-01-26 05:06:37 (GMT+0)", "News_Title": "A Look At Taiwan Semiconductor Manufacturing’s Valuation After Strong Recent Share Price Momentum", "News_Source": "YAHOO", "News_Content": "A Look At Taiwan Semiconductor Manufacturing’s Valuation After Strong Recent Share Price Momentum\nSimply Wall St\nMon, January 26, 2026 at 1:06 PM GMT+8 3 min read\nIn this article:\nTSM\n-2.45%\nTSMWF\n0.00%\n0981.HK\n-2.39%\nFind winning stocks in any market cycle. Join 7 million investors using Simply Wall St's investing ideas for FREE.\nEvent context and recent share performance\nTaiwan Semiconductor Manufacturing (TSM) shares recently closed at US$334.87, with a 1 day return of 2.29%, a 1 week decline of 2.20%, and gains of 10.58% over the past month and 11.06% over the past 3 months.\nSee our latest analysis for Taiwan Semiconductor Manufacturing.\nSet against a 1 year total shareholder return of 75.96% and a 3 year total shareholder return that is more than three times the starting value, the recent 30 day and 90 day share price gains suggest that momentum has remained firm rather than fading.\nIf TSM has you looking closer at chipmakers, this may be a useful moment to scan other high growth tech and AI names through high growth tech and AI stocks and see what else fits your watchlist.\nWith revenue and net income both growing at about 17% annually and the stock trading roughly 22% below the average analyst price target, you now have to ask: Is there still a buying opportunity here, or is the market already pricing in future growth?\nMost Popular Narrative: 16.3% Undervalued\nAccording to the most followed narrative, Taiwan Semiconductor Manufacturing’s fair value sits at $400, above the last close at $334.87. This sets up a clear valuation gap for investors to consider.\nTSMC is the central pillar of the global semiconductor ecosystem, powering the AI revolution with scale, advanced process technology, and disciplined execution. With record profits, a broad client base, and significant expansion underway, both in Taiwan and abroad, it is presented as a relatively lower-risk way to gain exposure to AI infrastructure.\nRead the complete narrative.\nInvestors may be curious how that $400 figure is constructed. The narrative leans heavily on strong profitability, high margins, and a future earnings multiple that assumes ongoing AI chip demand. It can be useful to examine which specific revenue and profit assumptions support that view, and how they factor into the discount rate and long-term cash flow estimates.\nResult: Fair Value of $400 (UNDERVALUED)\nHave a read of the narrative in full and understand what's behind the forecasts.\nHowever, this optimistic view could be challenged if geopolitical tensions or heavy capital spending lead to weaker margins or underused fabs, which may pressure both earnings and sentiment.\nFind out about the key risks to this Taiwan Semiconductor Manufacturing narrative.\nAnother View: Our DCF Model Points the Other Way\nWhile the most followed narrative sees fair value at $400, the Simply Wall St DCF model estimates future cash flows at $212.75 per share, below the current $334.87 price. Instead of a 16.3% undervaluation, this approach suggests the stock may already be ahead of those cash flow expectations. Which lens do you find more useful for your own decision making?\nStory Continues\nTerms\nand\nPrivacy Policy\nPrivacy Dashboard", "Content_Length": 3198, "Word_Count": 519, "Image_URLs": ["https://s2.coinmarketcap.com/static/img/coins/64x64/1.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/1027.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/52.png", "https://s2.coinmarketcap.com/static/img/coins/64x64/5426.png", "https://s.yimg.com/ny/api/res/1.2/m8IRms05hU5O_cJYoLig5g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTQyODtjZj13ZWJw/https://media.zenfs.com/en/simply_wall_st__316/aaaf89937abe49977f47ef8a6be60df7"], "News_URL": "https://finance.yahoo.com/news/look-taiwan-semiconductor-manufacturing-valuation-050637366.html?.tsrc=rss", "Scrape_Time_Sec": 7.634835243225098}
